{
    "identifiers": [
        "powerbi",
        "VisualDataRoleKind",
        "VisualDataChangeOperationKind",
        "VisualUpdateType",
        "VisualPermissions",
        "CartesianRoleKind",
        "ViewMode",
        "EditMode",
        "AdvancedEditModeSupport",
        "ResizeMode",
        "JoinPredicateBehavior",
        "PromiseResultType",
        "VisualInteractivityAction",
        "VisualEventType",
        "FilterAction",
        "powerbi",
        "options",
        "extensibility",
        "extensibility",
        "jsCommon",
        "id",
        "id",
        "powerbi",
        "reason",
        "value",
        "promises",
        "promises",
        "value",
        "successCallback",
        "promiseValue",
        "errorCallback",
        "reason",
        "successCallback",
        "promiseValue",
        "errorCallback",
        "reason",
        "onRejected",
        "reason",
        "onRejected",
        "reason",
        "finallyCallback",
        "value",
        "reason",
        "reason",
        "result",
        "done",
        "powerbi",
        "Selector",
        "data",
        "SelectorsByColumn",
        "data",
        "categoryColumn",
        "index",
        "seriesColumn",
        "valueColumn",
        "measureId",
        "other",
        "other",
        "ignoreHighlight",
        "powerbi",
        "SortDirection",
        "powerbi",
        "powerbi",
        "name",
        "data",
        "data",
        "data",
        "data",
        "data",
        "data",
        "data",
        "id",
        "data",
        "data",
        "data",
        "data",
        "id",
        "powerbi",
        "name",
        "propertyName",
        "id",
        "powerbi",
        "DataRepetitionKind",
        "powerbi",
        "DataRepetitionKind",
        "powerbi",
        "IStringResourceProvider",
        "jsCommon",
        "resourceProvider",
        "powerbi",
        "powerbi",
        "DataRepetitionKind",
        "powerbi",
        "DataRepetitionKind",
        "powerbi",
        "data",
        "data",
        "powerbi",
        "DisplayNameGetter",
        "powerbi",
        "validMembers",
        "powerbi",
        "powerbi",
        "powerbi",
        "powerbi",
        "powerbi",
        "powerbi",
        "ISQExpr",
        "powerbi",
        "powerbi",
        "SemanticFilter",
        "data",
        "powerbi",
        "powerbi",
        "powerbi",
        "powerbi",
        "Selector",
        "powerbi",
        "propertyName",
        "propertyName",
        "propertyName",
        "data",
        "powerbi",
        "Selector",
        "powerbi",
        "objectName",
        "powerbi",
        "dataview",
        "powerbi",
        "powerbi",
        "selectionId",
        "multiSelect",
        "callback",
        "ids",
        "powerbi",
        "categoryColumn",
        "index",
        "seriesColumn",
        "valueColumn",
        "measureId",
        "powerbi",
        "key",
        "powerbi",
        "options",
        "options",
        "options",
        "powerbi",
        "payload",
        "powerbi",
        "VisualPlugin",
        "options",
        "powerbi",
        "key",
        "powerbi",
        "visualId",
        "powerbi",
        "powerbi",
        "extensibility",
        "options",
        "viewModel",
        "options",
        "extensibility",
        "visuals",
        "changes",
        "objectName",
        "propertyName",
        "action",
        "url",
        "extensibility",
        "extensibility"
    ],
    "literals": [
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string"
    ],
    "variables": [],
    "comments": [
        "Indicates that the role should be bound to something that evaluates to a grouping of values.",
        "Indicates that the role should be bound to something that evaluates to a single value in a scope.",
        "Indicates that the role can be bound to either Grouping or Measure.",
        "Default editing mode for the visual.",
        "Indicates the user has asked the visual to display advanced editing controls.",
        "The visual doesn't support Advanced Edit mode. Do not display the 'Edit' button on this visual.",
        "The visual supports Advanced Edit mode, but doesn't require any further changes aside from setting EditMode=Advanced.",
        "The visual supports Advanced Edit mode, and requires that the host pops out the visual when entering Advanced EditMode.",
        "Prevent items in this role from acting as join predicates.",
        "Normal selection behavior which should call onSelect",
        "No additional action or feedback from the visual is needed",
        "Should be used at the beginning of a visual's rendering operation.",
        "Should be used at the end of a visual's rendering operation.",
        "Should be used by visuals to trace information in PBI telemetry.",
        "Should be used by visuals to trace errors in PBI telemetry.",
        "Merging filter into existing filters.",
        "removing existing filter.",
        "This IVisualPlugin interface is only used by the CLI tools when compiling",
        "The name of the plugin.  Must match the property name in powerbi.visuals.",
        "Function to call to create the visual.",
        "The class of the plugin.  At the moment it is only used to have a way to indicate the class name that a custom visual has.",
        "Check if a visual is custom",
        "The version of the api that this plugin should be run against",
        "Human readable plugin name displayed to users",
        "Represents views of a data set.",
        "The metadata repetition objects.",
        "When defined, describes whether the DataView contains just a segment of the complete data set.",
        "Describes the data reduction applied to this data set when limits are exceeded.",
        "The user-facing display name of the column.",
        "The query name the source column in the query.",
        "The format string of the column.",
        "TODO: Deprecate this, and populate format string through objects instead.",
        "Data type information for the column.",
        "Indicates that this column is a measure (aggregate) value.",
        "The position of the column in the select statement.",
        "The properties that this column provides to the visualization.",
        "The metadata repetition objects.",
        "The name of the containing group.",
        "The sort direction of this column.",
        "The order sorts are applied. Lower values are applied first. Undefined indicates no sort was done on this column.",
        "The KPI metadata to use to convert a numeric status value into its visual representation.",
        "Indicates that aggregates should not be computed across groups with different values of this column.",
        "The aggregates computed for this column, if any.",
        "The SQExpr this column represents.",
        "Represents a single value evaluation, similar to a total.",
        "Client-computed maximum value for a column.",
        "Client-computed maximum value for a column.",
        "The data repetition objects.",
        "Returns an array that groups the columns in this group together.",
        "The set of expressions that define the identity for instances of the value group.  This must match items in the DataViewScopeIdentity in the grouped items result.",
        "The data repetition objects.",
        "NOTE: The following is needed for backwards compatibility and should be deprecated.  Callers should use",
        "DataViewMetadataColumn.aggregates instead.",
        "The set of expressions that define the identity for instances of the category.  This must match items in the DataViewScopeIdentity in the identity.",
        "The data repetition objects.",
        "The set of expressions that define the identity for the child nodes.  This must match items in the DataViewScopeIdentity of those nodes.",
        "The set of expressions that define the identity for rows of the table.  This must match items in the DataViewScopeIdentity in the identity.",
        "The data repetition objects.",
        "Indicates the level this node is on. Zero indicates the outermost children (root node level is undefined).",
        "If this DataViewMatrixNode represents the  inner-most dimension of row groups (i.e. a leaf node), then this property will contain the values at the \n        * matrix intersection under the group. The valueSourceIndex property will contain the position of the column in the select statement to which the \n        * value belongs.\n        *\n        * When this DataViewMatrixNode is used under the context of DataView.matrix.columns, this property is not used.",
        "Indicates whether or not the node is a subtotal node. Its value is false if omitted.",
        "Represents a value at the matrix intersection, used in the values property on DataViewMatrixNode (inherited from DataViewTreeNode).",
        "The data repetition objects.",
        "Indicates the index of the corresponding measure (held by DataViewMatrix.valueSources). Its value is 0 if omitted.",
        "When false, five state KPIs are in: { -2, -1, 0, 1, 2 }.",
        "When true, five state KPIs are in: { -1, -0.5, 0, 0.5, 1 }.",
        "Indicates the column is a what-if parameter",
        "Defines the acceptable values of a number.",
        "Defines the PrimitiveValue range.",
        "Represents evaluated, named, custom objects in a DataView.",
        "Represents an object (name-value pairs) in a DataView.",
        "Map of property name to property value.",
        "Instances of this object. When there are multiple instances with the same object name they will appear here.",
        "Defines a match against all instances of given roles.",
        "Defines a match against all instances of a given DataView scope. Does not match Subtotals.",
        "intentionally blank interfaces since this is not part of the public API",
        "Kind of the Data Repetition Selector",
        "Defines a match against any Total within a given DataView scope.",
        "The exprs defining the scope that this Total has been evaluated for\n         * It's an array to support expressing Total across a composite group\n         * Example: If this represents Total sales of USA across States, the Exprs wil refer to \"States\"",
        "Defines a custom enumeration data type, and its values.",
        "Gets the members of the enumeration, limited to the validMembers, if appropriate.",
        "Indicates whether the color value may be nullable, and a 'no fill' option is appropriate.",
        "stepped2?",
        "...",
        "Defines instances of structural types.",
        "Describes a structural type in the client type system. Leaf properties should use ValueType.",
        "border?: BorderTypeDescriptor;",
        "etc.",
        "Describes a data value type in the client type system. Can be used to get a concrete ValueType instance.",
        "Simplified primitive types",
        "TODO: 5005022 remove none type when we introduce property categories.",
        "Extended types",
        "readonly",
        "variant types",
        "Describes instances of value type objects.",
        "The name of the object (as defined in VisualCapabilities).",
        "A display name for the object instance.",
        "The set of property values for this object.  Some of these properties may be defaults provided by the IVisual.",
        "The selector that identifies this object.",
        "(Optional) Defines the constrained set of valid values for a property.",
        "(Optional) VisualObjectInstanceEnumeration category index.",
        "(Optional) Set the required type for particular properties that support variant types.",
        "The visual object instances.",
        "Defines a set of containers for related object instances.",
        "Instances which should be merged with existing instances.",
        "Instances which should replace existing instances.",
        "Instances which should be deleted from the existing instances.",
        "Instances which should be deleted from the existing objects.",
        "The selector that identifies the objects.",
        "Used to group differernt repetitions into containers. That will be used as the container displayName in the PropertyPane",
        "The set of repetition descriptors for this object.",
        "Properties used for formatting (e.g., Conditional Formatting).",
        "These are the base interfaces. These should remain empty",
        "All visual versions should extend these for type compatability",
        "The loaded module, if any, defined by the IVisualPlugin.module.",
        "foreground variants",
        "Also used in High-contrast accessibility mode",
        "Used only in High-contrast accessibility mode",
        "background variants",
        "Also used in High-contrast accessibility mode",
        "specific purpose colors",
        "Also used in High-contrast accessibility mode",
        "sentiment indicators",
        "Notifies the IVisual of an update (data, viewmode, size change).",
        "Notifies the visual that it is being destroyed, and to do any cleanup necessary (such as unsubscribing event handlers).",
        "Gets the set of objects that the visual is currently displaying."
    ],
    "docstrings": [
        "* Defines actions to be taken by the visual in response to a selection.\n     *\n     * An undefined/null VisualInteractivityAction should be treated as Selection,\n     * as that is the default action.",
        "* Defines various events Visuals can notify the host on.",
        "* An interface to promise/deferred, \n     * which abstracts away the underlying mechanism (e.g., Angular, jQuery, etc.).",
        "* Creates a Deferred object which represents a task which will finish in the future.",
        "* Creates a Deferred object which represents a task which will finish in the future.",
        "* Creates a promise that is resolved as rejected with the specified reason.\n         * This api should be used to forward rejection in a chain of promises.\n         * If you are dealing with the last promise in a promise chain, you don't need to worry about it.\n         * When comparing deferreds/promises to the familiar behavior of try/catch/throw,\n         * think of reject as the throw keyword in JavaScript.\n         * This also means that if you \"catch\" an error via a promise error callback and you want \n         * to forward the error to the promise derived from the current promise, \n         * you have to \"rethrow\" the error by returning a rejection constructed via reject.\n         * \n         * @param reason Constant, message, exception or an object representing the rejection reason.",
        "* Creates a promise that is resolved with the specified value.\n         * This api should be used to forward rejection in a chain of promises. \n         * If you are dealing with the last promise in a promise chain, you don't need to worry about it.\n         *\n         * @param value Object representing the promise result.",
        "* Combines multiple promises into a single promise that is resolved when all of the input promises are resolved.\n         * Rejects immediately if any of the promises fail",
        "* Combines multiple promises into a single promise that is resolved when all of the input promises are resolved.\n         * Does not resolve until all promises finish (success or failure).",
        "* Wraps an object that might be a value or a then-able promise into a promise. \n         * This is useful when you are dealing with an object that might or might not be a promise",
        "* Represents an operation, to be completed (resolve/rejected) in the future.",
        "* Represents an operation, to be completed (resolve/rejected) in the future.\n     * Success and failure types can be set independently.",
        "* Regardless of when the promise was or will be resolved or rejected, \n         * then calls one of the success or error callbacks asynchronously as soon as the result is available.\n         * The callbacks are called with a single argument: the result or rejection reason.\n         * Additionally, the notify callback may be called zero or more times to provide a progress indication, \n         * before the promise is resolved or rejected.\n         * This method returns a new promise which is resolved or rejected via \n         * the return value of the successCallback, errorCallback.",
        "* Regardless of when the promise was or will be resolved or rejected,\n         * then calls one of the success or error callbacks asynchronously as soon as the result is available.\n         * The callbacks are called with a single argument: the result or rejection reason.\n         * Additionally, the notify callback may be called zero or more times to provide a progress indication,\n         * before the promise is resolved or rejected.\n         * This method returns a new promise which is resolved or rejected via \n         * the return value of the successCallback, errorCallback.",
        "* Shorthand for promise.then(null, errorCallback).",
        "* Shorthand for promise.then(null, errorCallback).",
        "* Allows you to observe either the fulfillment or rejection of a promise, \n         * but to do so without modifying the final value.\n         * This is useful to release resources or do some clean-up that needs to be done \n         * whether the promise was rejected or resolved.\n         * See the full specification for more information.\n         * Because finally is a reserved word in JavaScript and reserved keywords \n         * are not supported as property names by ES3, you'll need to invoke \n         * the method like promise['finally'](callback) to make your code IE8 and Android 2.x compatible.",
        "* The set of expressions that define the identity for instances of this grouping field.\n         * This must be a subset of the items in the DataViewScopeIdentity in the grouped items result.\n         * This property is undefined for measure fields, as well as for grouping fields in DSR generated prior to the CY16SU08 or SU09 timeframe.",
        "* When used under the context of DataView.tree, this value is one of the elements in the values property.\n         *\n         * When used under the context of DataView.matrix, this property is the value of the particular \n         * group instance represented by this node (e.g. In a grouping on Year, a node can have value == 2016).\n         *\n         * DEPRECATED for usage under the context of DataView.matrix: This property is deprecated for objects \n         * that conform to the DataViewMatrixNode interface (which extends DataViewTreeNode).\n         * New visuals code should consume the new property levelValues on DataViewMatrixNode instead.\n         * If this node represents a composite group node in matrix, this property will be undefined.",
        "* This property contains all the values in this node. \n         * The key of each of the key-value-pair in this dictionary is the position of the column in the \n         * select statement to which the value belongs.",
        "* The metadata columns of the measure values.\n         * In visual DataView, this array is sorted in projection order.",
        "* Indicates the source metadata index on the node's level. Its value is 0 if omitted.\n         *\n         * DEPRECATED: This property is deprecated and exists for backward-compatibility only.\n         * New visuals code should consume the new property levelSourceIndex on DataViewMatrixGroupValue instead.",
        "* The values of the particular group instance represented by this node.\n         * This array property would contain more than one element in a composite group\n         * (e.g. Year == 2016 and Month == 'January').",
        "* Represents a value at a particular level of a matrix's rows or columns hierarchy.\n     * In the hierarchy level node is an instance of a composite group, this object will\n     * be one of multiple values",
        "* Indicates the index of the corresponding column for this group level value \n         * (held by DataViewHierarchyLevel.sources).\n         *\n         * @example\n         * // For example, to get the source column metadata of each level value at a particular row hierarchy node:\n         * let matrixRowsHierarchy: DataViewHierarchy = dataView.matrix.rows;\n         * let targetRowsHierarchyNode = <DataViewMatrixNode>matrixRowsHierarchy.root.children[0];\n         * // Use the DataViewMatrixNode.level property to get the corresponding DataViewHierarchyLevel...\n         * let targetRowsHierarchyLevel: DataViewHierarchyLevel = matrixRows.levels[targetRowsHierarchyNode.level];\n         * for (let levelValue in rowsRootNode.levelValues) {\n         *   // columnMetadata is the source column for the particular levelValue.value in this loop iteration\n         *   let columnMetadata: DataViewMetadataColumn = \n         *     targetRowsHierarchyLevel.sources[levelValue.levelSourceIndex];\n         * }",
        "* The metadata columns of this hierarchy level.\n         * In visual DataView, this array is sorted in projection order.",
        "* Only used if strategy is specificColor",
        "* Interface for expanded color palette.\n     * \n     * isHighContrast: boolean - when true, indicates that high-contrast accesibility support is active. Draw the visual using only foreground and background colors, and clearly visible strokes.\n     * \n     * Also exposes non-data colors: foreground and variants, background and variants, sentiment indicators (positive, neutral, negative) and some specifc colors (e.g. hyperlink)",
        "* Change Log Version 1.13.0\n *  Expanded `host.colorPalette` now expose a boolean `isHighContrast` flag and several non-data colors \n *  including `foreground`, `foregroundSelected`, `background` and `hyperlink` all of which are required for high-contrast accessibility support.",
        "* Represents a visualization displayed within an application (PowerBI dashboards, ad-hoc reporting, etc.).\n     * This interface does not make assumptions about the underlying JS/HTML constructs the visual uses to render itself."
    ],
    "functions": [],
    "classes": []
}