{
    "identifiers": [],
    "literals": [
        "'A'",
        "'To enter the competition you MUST create an audio track (aka a '",
        "'\"piece\"), upload the audio file to archive.org and submit the link '",
        "'to the track via the submission form '",
        "'(https://fmchallenge.osamc.de/submit/) between the start of the '",
        "'competition (15.09.2018 00:00:00 UTC) and before the dead line for '",
        "'submission (14.10.2018 23:59:59 UTC). Every person can enter the '",
        "'competition with one entry only. The representative of the '",
        "'competition organizer is excluded from entering the competition.'",
        "'Your audio track MUST be downloadable without access control and '",
        "'the audio file MUST be FLAC encoded and properly tagged with (at '",
        "'least) artist name, track title, year (2018) and \"Open Source Music '",
        "'FM Synthesizer Challenge\" as the album title. The audio MUST be '",
        "'stereo and have a sampling rate of 44100 Hz and 16 bits per sample.'",
        "'The length of your submitted audio file MUST be no less than one '",
        "'(1) minute and no more than five (5) minutes.'",
        "'Your audio track MUST be created specifically for this competition, '",
        "'not released elsewhere before, and the composition SHOULD be a new '",
        "\"one (we know we can't check this, but please be honest).\"",
        "'You MUST license your audio track under a Creative Common license '",
        "'(CC BY-NC-SA or more permissive).'",
        "'You MAY use ONLY the following software synthesizers as sound '",
        "'generators (in alphabetical order):\\n'",
        "'        6PM by Michel Vergnaud\\n'",
        "'        ADLplug by Jean Pierre Cimalando\\n'",
        "'        Dexed by Pascal Gauthier et al.\\n'",
        "'        DX10 by mda\\n'",
        "'        Hexter by Sean Bolton\\n'",
        "'        JuceOPLVSTi by Bruce Sutherland\\n'",
        "'        OpulenZ by the LMMS project\\n'",
        "'        Oxe FM Synth by Oxesoft (Daniel Moura)'",
        "'You MAY use as many instances of the above synthesizers as you need.'",
        "'You MAY use any other Open Source (see below under \"Open Source '",
        "'Conformance\") audio plug-ins, which do not generate audio on their '",
        "'own, e.g. effects like chorus, delay, reverb, distortion, etc. or '",
        "'MIDI and control signal generators and processors, but you MAY NOT '",
        "'use any other software or hardware, which is capable of generating '",
        "'audio independently of its audio input.'",
        "'You MAY NOT use any samples or recordings (not even for e.g. drums '",
        "'or vocals), but you MAY freeze or bounce tracks to an audio file to '",
        "'save CPU processing power.\\n'",
        "'To clarify: no vocals are allowed (unless you synthesize them '",
        "'with FM). The reason is that this competition is about showing your '",
        "'skills with synth sound programming and production. Usually a vocal '",
        "'track has a big impact on the listening experience and not '",
        "'everybody has the voice/talent to lay down a good vocal performance '",
        "'(or access to someone possessing it).\\n'",
        "'Also, you may not sample single sounds of the allowed FM '",
        "'synthesizers and load them into a sampler and sequence them. '",
        "'Recordings are only allowed to bounce a whole track or a sequence '",
        "'to audio to save processing power.'",
        "'You MAY use non Open Source Software for recording, sequencing, '",
        "'mixing, mastering and preparing the audio track for upload, as '",
        "'long as you follow all the other rules, particularly rule A.6 and '",
        "'A.8.\\n'",
        "'To clarify: if you use a non-OS DAW, you may only use the '",
        "'following types of non-open source signal processors within the '",
        "'DAW: gain, panning, delay, reverb, eq, compressor and limiter. '",
        "'These may be built-in or proprietary plugins, which come with the '",
        "'DAW, when purchased. Any other proprietary plug-ins are not '",
        "'allowed.'",
        "'When submitting your entry, you MUST list all plug-ins you used '",
        "'for creating your track and also any other sequencing, recording '",
        "'and mastering software you used. The competition organizer MAY '",
        "'request access to our project files if there is a reasonable '",
        "'suspicion that you did not follow rules A.6 to A.10.'",
        "'To be eligible for winning, you MUST vote on the other submissions '",
        "'into the competition (see below under \"Voting Rules\"). If you '",
        "\"don't vote, your submission will be disqualified.\"",
        "'Your track SHOULD be a musical piece in the broadest sense (e.g. '",
        "'including ambient, soundtrack, abstract music etc.) and MAY be in '",
        "'any genre you want. The only guideline here is to try to please '",
        "'the audience.'",
        "'You SHOULD make the patches you created for the synthesizer(s) and '",
        "'other plug-ins, which you used for your track, available for '",
        "'download, preferably under a permissive license or public domain. '",
        "'Doing so is not a requirement for being eligible for winning the '",
        "'competition.'",
        "'B'",
        "'Software regarded as Open Source MUST be released under and conform '",
        "'to one of the licenses listed on https://opensource.org/licenses.'",
        "'This means (but is not limited to) that the source code for the '",
        "'software MUST be freely downloadable and distributable according to '",
        "'the rules of the license.'",
        "'The software SHOULD be packaged for a current version of a major '",
        "'Linux distribution or available as a binary installer for Linux '",
        "\"from the software's creator or third-parties (so that everybody has \"",
        "'a realistic chance of using the same software).'",
        "'C'",
        "'The voting period starts immediately after the final submission '",
        "'date for competition entries (see rule A.1) and lasts for ten (10) '",
        "'days until 24.10.2018 23:59:59 UTC.'",
        "'Voting is open to every person (except the representative of the '",
        "'competition organizer, see rule A.1), contestants MUST vote to be '",
        "'able to win.'",
        "'Everybody has one vote, which consist of fifteen (15) points '",
        "'distributed across five (5) competition entries, where one entry '",
        "'gets five (5) points, another four (4) points, and so on, down to '",
        "'one (1) point.'",
        "'The vote may be changed (but not retracted completely) as often as '",
        "'desired during the voting period.'",
        "'Voters must go to https://fmchallenge.osamc.de/vote/ and provide a '",
        "'valid email address, which will be validated during the voting '",
        "'process by sending a personalized confirmation link to said email '",
        "'address. The voter must open this link to get access to the voting '",
        "'form. This link may also be used to change the vote until the end '",
        "'of the voting period. The email address will not be used for other '",
        "'purposes.'",
        "'D'",
        "'Only those contestants can win, which are not disqualified by the '",
        "'competition organizer due to not adhering to the rules.'",
        "'The contestant who gets the most points wins. In case of a tie, the '",
        "'entry which has the most four and five points per individual vote '",
        "'wins.'",
        "'Second and third place are awarded according to the same rules, '",
        "'where the loser of a tie from a higher tier takes precedence over '",
        "'the next lower tier.'",
        "'The final decision in case of disputes lies with the competition '",
        "'organizer.'"
    ],
    "variables": [
        "rules"
    ],
    "comments": [],
    "docstrings": [],
    "functions": [],
    "classes": []
}