{
    "identifiers": [
        "com",
        "e3value",
        "eval",
        "ncf",
        "org",
        "apache",
        "log4j",
        "Logger",
        "log",
        "Logger",
        "getLogger",
        "getName",
        "row",
        "col",
        "sheetName",
        "row",
        "col",
        "row",
        "sheetName",
        "row",
        "row",
        "col",
        "col",
        "sheetName",
        "sheetName",
        "row",
        "row",
        "row",
        "col",
        "ProfGenerator",
        "convertToXLSCol",
        "col",
        "ProfGenerator",
        "convertToXLSRow",
        "row",
        "col",
        "col",
        "col",
        "sheetName"
    ],
    "literals": [],
    "variables": [],
    "comments": [],
    "docstrings": [
        "Copyright (C) 2016 vu.nl, e3value.com\n \nRedistribution and use in source and binary forms, with or without modification,\nare permitted provided that the following conditions are met:\n\n    (1) Redistributions of source code must retain the above copyright\n    notice, this list of conditions and the following disclaimer.\n\n    (2) Redistributions in binary form must reproduce the above copyright\n    notice, this list of conditions and the following disclaimer in\n    the documentation and/or other materials provided with the\n    distribution.\n\n    (3)The name of the author may not be used to\n    endorse or promote products derived from this software without\n    specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE AUTHOR ``AS IS'' AND ANY EXPRESS OR IMPLIED\nWARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO\nEVENT SHALL THE AUTHOR BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,\nEXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT\nOF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\nINTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\nCONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING\nIN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY\nOF SUCH DAMAGE.\n\nThis code contains third-party software, as in mentioned in the included\nlicenses.txt file.The third-party software is redistributed under their own\nintellectual property rights. Other third-party software components may need\nto be downloaded separately under their own intellectual property rights.\nPlease check and follow applicable third party intellectual\nproperty conditions."
    ],
    "functions": [
        "getRow",
        "CellTracker",
        "setRow",
        "getCol",
        "getXLSCol",
        "getXLSRow",
        "setCol",
        "getSheetName"
    ],
    "classes": [
        "CellTracker"
    ]
}