{
    "identifiers": [
        "data",
        "data",
        "data",
        "data",
        "ko",
        "data",
        "data",
        "data",
        "ko",
        "initialLocations",
        "locationItem",
        "Location",
        "locationItem",
        "clickedLocation",
        "ko",
        "ListViewModel"
    ],
    "literals": [
        "\"Old Salem\"",
        "\"history\"",
        "\"education\"",
        "\"http://www.oldsalem.org/\"",
        "\"Experience early American history in the unique Moravian settlement of Salem. Original structures, gardens, tours, artifacts, hands-on workshops, fun family events and shopping.\"",
        "\"Greensboro Science Center\"",
        "\"science\"",
        "\"nature\"",
        "\"animals\"",
        "\"http://www.greensboroscience.org/\"",
        "\"The Greensboro Science Center is committed to excellence in science education by providing the community with a dynamic, experiential and family-focused attraction designed to inspire scientific curiosity and encourage personal discovery about life and the natural world.\"",
        "\"Elon University\"",
        "\"nature\"",
        "\"education\"",
        "\"https://www.elon.edu/home/\"",
        "\"Elon is a selective, mid-sized private university renowned as a national model for engaged and experiential learning. The campus is a designated botanical garden and has several great spots to read or study.\"",
        "\"Haw River State Park\"",
        "\"nature\"",
        "\"recreation\"",
        "\"https://www.ncparks.gov/haw-river-state-park\"",
        "\"Located in the northern Piedmont Triad region, picturesque terrain makes Haw River State Park the perfect place to connect with nature. Housed within this natural setting is The Summit Environmental Education and Conference Center, N.C. State Park’s first residential environmental education center. Along with environmental education programming, The Summit Center offers conference center facilities for groups ranging in size from 10 to 180.\"",
        "\"Greensboro Arboretum\"",
        "\"nature\"",
        "\"http://www.greensborobeautiful.org/gardens/greensboro_arboretum.php\"",
        "\"This 17-acre site features 14 plant collections, special display gardens and distinct structural features. The extensive variety of plants offers rich educational opportunities for children and adults, landscape designers, and homeowners.\"",
        "\"this will open the info window on the map\""
    ],
    "variables": [
        "initialLocations",
        "Location",
        "ListViewModel"
    ],
    "comments": [
        "Model",
        "ViewModel",
        "this.currentLocations = ko.observableArray(this.locationList()[indexes of selected filters])",
        "this.currentLocations should initially be set to show all locations",
        "self.currentLocations(clickedLocation);",
        "View"
    ],
    "docstrings": [],
    "functions": [],
    "classes": []
}