{
    "identifiers": [
        "Google",
        "Protobuf",
        "number",
        "FieldNumber",
        "number",
        "TTarget",
        "TValue",
        "Extension",
        "TTarget",
        "IExtendableMessage",
        "TTarget",
        "FieldCodec",
        "TValue",
        "number",
        "FieldCodec",
        "TValue",
        "codec",
        "number",
        "codec",
        "codec",
        "codec",
        "DefaultValue",
        "TTarget",
        "ExtensionValue",
        "TValue",
        "codec",
        "TTarget",
        "TValue",
        "Extension",
        "TTarget",
        "IExtendableMessage",
        "TTarget",
        "FieldCodec",
        "TValue",
        "number",
        "FieldCodec",
        "TValue",
        "codec",
        "number",
        "codec",
        "codec",
        "TTarget",
        "RepeatedExtensionValue",
        "TValue",
        "codec"
    ],
    "literals": [],
    "variables": [
        "Type",
        "TargetType",
        "FieldNumber",
        "codec",
        "TValue",
        "DefaultValue",
        "Type",
        "TargetType",
        "codec",
        "Type",
        "TargetType"
    ],
    "comments": [
        "Protocol Buffers - Google's data interchange format",
        "Copyright 2008 Google Inc.  All rights reserved.",
        "https://developers.google.com/protocol-buffers/",
        "",
        "Redistribution and use in source and binary forms, with or without",
        "modification, are permitted provided that the following conditions are",
        "met:",
        "",
        "notice, this list of conditions and the following disclaimer.",
        "copyright notice, this list of conditions and the following disclaimer",
        "in the documentation and/or other materials provided with the",
        "distribution.",
        "contributors may be used to endorse or promote products derived from",
        "this software without specific prior written permission.",
        "",
        "THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS",
        "\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT",
        "LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR",
        "A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT",
        "OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,",
        "SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT",
        "LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,",
        "DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY",
        "THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT",
        "(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE",
        "OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.",
        "Represents a non-generic extension definition",
        "</summary>",
        "Internal use. Creates a new extension with the specified field number.",
        "</summary>",
        "Gets the field number of this extension",
        "</summary>",
        "Represents a type-safe extension identifier used for getting and setting single extension values in <see cref=\"IExtendableMessage{T}\"/> instances",
        "</summary>",
        "<typeparam name=\"TTarget\">The message type this field applies to</typeparam>",
        "<typeparam name=\"TValue\">The field value type of this extension</typeparam>",
        "Creates a new extension identifier with the specified field number and codec",
        "</summary>",
        "Represents a type-safe extension identifier used for getting repeated extension values in <see cref=\"IExtendableMessage{T}\"/> instances",
        "</summary>",
        "<typeparam name=\"TTarget\">The message type this field applies to</typeparam>",
        "<typeparam name=\"TValue\">The repeated field value type of this extension</typeparam>",
        "Creates a new repeated extension identifier with the specified field number and codec",
        "</summary>"
    ],
    "docstrings": [
        "* Redistributions of source code must retain the above copyright",
        "* Redistributions in binary form must reproduce the above",
        "* Neither the name of Google Inc. nor the names of its",
        "<summary>",
        "<summary>",
        "<summary>",
        "<summary>",
        "<summary>",
        "<summary>",
        "<summary>"
    ],
    "functions": [
        "Extension",
        "IExtensionValue",
        "CreateValue",
        "Extension",
        "IExtensionValue",
        "CreateValue",
        "RepeatedExtension",
        "IExtensionValue",
        "CreateValue"
    ],
    "classes": [
        "Extension",
        "Extension",
        "RepeatedExtension"
    ]
}