{
    "identifiers": [
        "floor",
        "floor",
        "directly",
        "enabled",
        "enabled",
        "cback",
        "cback",
        "Elevation",
        "Direction",
        "Direction",
        "Direction",
        "elevators",
        "floors",
        "floors",
        "nfloors",
        "elevators",
        "elevator",
        "elevator",
        "mfloor",
        "elevator",
        "num",
        "elevator",
        "num",
        "elevator",
        "num",
        "floors",
        "floor",
        "i",
        "foo",
        "elevator",
        "i",
        "floor",
        "foo",
        "floor",
        "foo",
        "dt",
        "elevators",
        "floors",
        "Elevation",
        "test",
        "Elevation"
    ],
    "literals": [
        "string",
        "string",
        "\"idle\"",
        "\"floor_button_pressed\"",
        "\"up_button_pressed\"",
        "\"down_button_pressed\""
    ],
    "variables": [
        "nfloors",
        "mfloor",
        "elevator",
        "foo",
        "test"
    ],
    "comments": [
        "Queue the elevator to go to specified floor number. If you specify true as second argument, the elevator will go to that floor directly, and then go to any other queued floors.",
        "Clear the destination queue and stop the elevator if it is moving. Note that you normally don't need to stop elevators - it is intended for advanced solutions with in-transit rescheduling logic.",
        "Gets the floor number that the elevator currently is on.",
        "Gets or sets the going up indicator, which will affect passenger behaviour when stopping at floors.",
        "Gets or sets the going down indicator, which will affect passenger behaviour when stopping at floors.",
        "Gets the load factor of the elevator. 0 means empty, 1 means full. Varies with passenger weights, which vary - not an exact measure.",
        "The current destination queue, meaning the floors the elevator is scheduled to go to. Can be modified and emptied if desired. Note that you need to call checkDestinationQueue() for the change to take effect immediately.",
        "Checks the destination queue for any new destinations to go to. Note that you only need to call this if you modify the destination queue explicitly.",
        "Event Handler",
        "Gets the floor number of the floor object.",
        "Event Handler",
        "Dummy IEFE due to reasons. Delete the first (",
        "TODO",
        "Let's use the first elevator",
        "We normally don't need to do anything here",
        "Delete the last )"
    ],
    "docstrings": [],
    "functions": [
        "getDirection",
        "init",
        "update"
    ],
    "classes": [
        "Elevator",
        "ElevatorControl"
    ]
}