{
    "identifiers": [
        "org",
        "sola",
        "services",
        "common",
        "javax",
        "xml",
        "bind",
        "annotation",
        "XmlType",
        "XmlType",
        "ServiceConstants",
        "BASE_TO_NAMESPACE",
        "EntityTable",
        "BAUNIT",
        "RRR",
        "NOTATION",
        "APPLICATION",
        "PARTY",
        "SOURCE",
        "PARCEL",
        "table",
        "table",
        "table",
        "table",
        "table"
    ],
    "literals": [
        "\"administrative.ba_unit\"",
        "\"administrative.rrr\"",
        "\"administrative.notation\"",
        "\"application.application\"",
        "\"party.party\"",
        "\"source.source\"",
        "\"cadastre.cadastre_object\""
    ],
    "variables": [
        "table"
    ],
    "comments": [],
    "docstrings": [
        "* ******************************************************************************************\n * Copyright (C) 2014 - Food and Agriculture Organization of the United Nations\n * (FAO). All rights reserved.\n *\n * Redistribution and use in source and binary forms, with or without\n * modification, are permitted provided that the following conditions are met:\n *\n * 1. Redistributions of source code must retain the above copyright notice,this\n * list of conditions and the following disclaimer. 2. Redistributions in binary\n * form must reproduce the above copyright notice,this list of conditions and\n * the following disclaimer in the documentation and/or other materials provided\n * with the distribution. 3. Neither the name of FAO nor the names of its\n * contributors may be used to endorse or promote products derived from this\n * software without specific prior written permission.\n *\n * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\n * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE\n * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE\n * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR\n * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,PROCUREMENT OF\n * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS\n * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN\n * CONTRACT,STRICT LIABILITY,OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING\n * IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE\n * POSSIBILITY OF SUCH DAMAGE.\n * *********************************************************************************************",
        "* Enumeration identifying the database schema and table name for key entities\n * in the SOLA schema soladev"
    ],
    "functions": [
        "EntityTable",
        "getTable"
    ],
    "classes": []
}