{
    "identifiers": [
        "$",
        "buttonMaking",
        "$",
        "i",
        "anime",
        "i",
        "$",
        "animeBtn",
        "anime",
        "i",
        "animeBtn",
        "animeBtn",
        "animeBtn",
        "anime",
        "i",
        "$",
        "animeBtn",
        "$",
        "$",
        "animeAdded",
        "alert",
        "animeAdded",
        "alert",
        "anime",
        "animeAdded",
        "buttonMaking",
        "$",
        "userPick",
        "$",
        "$",
        "userPick",
        "APIKey",
        "$",
        "queryURL",
        "response",
        "response",
        "j",
        "results",
        "j",
        "response",
        "$",
        "$",
        "gifPic",
        "results",
        "j",
        "gifPic",
        "results",
        "j",
        "gifPic",
        "results",
        "j",
        "gifPic",
        "gifPic",
        "animeDiv",
        "$",
        "animeDiv",
        "$",
        "results",
        "j",
        "$",
        "animeDiv",
        "gifPic",
        "$",
        "animeDiv",
        "buttonMaking",
        "$",
        "getGif",
        "$",
        "$",
        "state",
        "$",
        "$",
        "$",
        "$",
        "$",
        "$"
    ],
    "literals": [
        "\"Kuroko no Basket\"",
        "\"Black Butler\"",
        "\"Attack on Titan\"",
        "\"Assassination Classroom\"",
        "\"#BTN\"",
        "\"test\"",
        "\"<button>\"",
        "\"btn btn-success\"",
        "\"animeShows\"",
        "\"data-name\"",
        "\"#BTN\"",
        "\"#submit\"",
        "\"click\"",
        "\"#animeShow\"",
        "\"\"",
        "\"Please enter an anime show\"",
        "\"#BTN\"",
        "\"Already have that anime enter a different one\"",
        "\"#animeShow\"",
        "\"\"",
        "\"data-name\"",
        "\"#theGIF\"",
        "\"dc6zaTOxFJmzC\"",
        "\"http://api.giphy.com/v1/gifs/search?q=\"",
        "\"&api_key=\"",
        "\"&limit=10\"",
        "\"GET\"",
        "\"<div>\"",
        "\"<img>\"",
        "\"src\"",
        "'data-still'",
        "'data-animate'",
        "\"data-state\"",
        "\"still\"",
        "\"GIF\"",
        "\"show col-md-4\"",
        "\"<p>\"",
        "\"Rating: \"",
        "\"#theGIF\"",
        "\"click\"",
        "\".animeShows\"",
        "'click'",
        "'.GIF'",
        "'data-state'",
        "'still'",
        "'src'",
        "'animate'",
        "'data-state'",
        "'animate'",
        "'src'",
        "'still'",
        "'data-state'",
        "'still'"
    ],
    "variables": [
        "anime",
        "i",
        "animeBtn",
        "animeAdded",
        "APIKey",
        "queryURL",
        "results",
        "j",
        "animeDiv",
        "gifPic",
        "state"
    ],
    "comments": [
        "Delete the content inside the div prior to adding new movies",
        "(this is necessary otherwise you will have repeat buttons)",
        "for loop for the button already exsisting at the top.",
        "see if it works",
        "adding the button varaiable and text to corresponding array",
        "anding the shows name onto the buttons",
        "adding the bootstrap class to each button.",
        "this class will be use to identify the button",
        "adding an attribute to the button. It will be call on it in the GIF later",
        "attaching the button to the chosen div",
        "Preventing the submit button from trying to submit the form",
        "We're optionally using a form so the user may hit Enter to search instead of clicking the button",
        "if not your button will appear and disappear",
        "taking the user input and making it into a button. Use the trim to remove the white space at the two ends",
        "taking user input and adding it to the array anime",
        "if user did not typed anything anything",
        "not working trying to prevent repeat entrys",
        "after adding it to the array call the function to make it into a button in the designated spot",
        "clear the input box after input have been submitted",
        "specify the button that the usser pick to run that one not all of them",
        "clearing out the last gif so current gif could fill it up without the old ones there.",
        "this is the api key that is need to access the api to get the gif",
        "the url to get gif to seach for the anime that was  pick and put it only show 10 results",
        "It is a promise when the imformation finally gather that this function will deploy",
        "making a variable for the response",
        "a for loop to get all ten response from the gather gif.",
        "debugging purposes",
        "aking a div where all this will go",
        "making an image",
        "creating atttributes",
        "this is the source of the gif that is getting",
        "this is the gif when it is not moving",
        "this is when the image is moving",
        "this attribute will be call on later use as a way to refer to it",
        "adding a class to it to idenify the images",
        "adding a bootstrap class to the new div. Help in not needing to use floats n the css",
        "adding the text ratings of the gif to the html",
        "this will attach the gif to the assigned area.",
        "attaching the new div to the designated area",
        "Document Event Listeners",
        "putting a on click event to the anime buttons. If you don't do it like this new buttons that where\nadded you wil not get the GIF of new buttons",
        ".animeShows is the class the buttons are and the getGif is the function to get the gif the button corrrespond to",
        "putting an on click function to the gif images. If you don't do it this button added by the user will not \nhave gif images that are animated",
        "making a variable refering to the specify image that the user just click",
        "stated that the gif the user click is not moving/still then animate it",
        "stating that if the image is animating/moving to stop when user click it."
    ],
    "docstrings": [],
    "functions": [
        "buttonMaking",
        "getGif"
    ],
    "classes": []
}