{
    "identifiers": [
        "java",
        "util",
        "Scanner",
        "args",
        "input",
        "firstName",
        "input",
        "nextLine",
        "WeekOneFortuneTeller",
        "checkQuit",
        "firstName",
        "lastName",
        "input",
        "nextLine",
        "WeekOneFortuneTeller",
        "checkQuit",
        "lastName",
        "ageString",
        "input",
        "nextLine",
        "WeekOneFortuneTeller",
        "checkQuit",
        "ageString",
        "age",
        "age",
        "parseInt",
        "ageString",
        "ex",
        "age",
        "birthMonthString",
        "input",
        "nextLine",
        "WeekOneFortuneTeller",
        "checkQuit",
        "birthMonthString",
        "birthMonthString",
        "birthMonthString",
        "toLowerCase",
        "birthMonthString",
        "birthMonthString",
        "birthMonthString",
        "birthMonthString",
        "birthMonthString",
        "birthMonthString",
        "birthMonthString",
        "birthMonthString",
        "birthMonthString",
        "birthMonthString",
        "birthMonthString",
        "birthMonthString",
        "birthMonthString",
        "birthMonthString",
        "birthMonth",
        "parseInt",
        "birthMonthString",
        "favColor",
        "input",
        "nextLine",
        "WeekOneFortuneTeller",
        "checkQuit",
        "favColor",
        "timesAsked",
        "favColor",
        "equalsIgnoreCase",
        "timesAsked",
        "timesAsked",
        "favColor",
        "input",
        "nextLine",
        "WeekOneFortuneTeller",
        "checkQuit",
        "favColor",
        "timesAsked",
        "timesAsked",
        "favColor",
        "input",
        "nextLine",
        "WeekOneFortuneTeller",
        "checkQuit",
        "favColor",
        "timesAsked",
        "timesAsked",
        "favColor",
        "input",
        "nextLine",
        "WeekOneFortuneTeller",
        "checkQuit",
        "favColor",
        "timesAsked",
        "timesAsked",
        "favColor",
        "input",
        "nextLine",
        "WeekOneFortuneTeller",
        "checkQuit",
        "favColor",
        "favColor",
        "input",
        "nextLine",
        "WeekOneFortuneTeller",
        "checkQuit",
        "favColor",
        "siblingsString",
        "input",
        "nextLine",
        "WeekOneFortuneTeller",
        "checkQuit",
        "siblingsString",
        "siblings",
        "siblings",
        "parseInt",
        "siblingsString",
        "ex",
        "siblings",
        "retirement",
        "age",
        "retirement",
        "retirement",
        "vacationHome",
        "siblings",
        "vacationHome",
        "siblings",
        "vacationHome",
        "siblings",
        "vacationHome",
        "siblings",
        "vacationHome",
        "siblings",
        "vacationHome",
        "siblings",
        "siblings",
        "vacationHome",
        "vacationHome",
        "bankBalance",
        "birthMonth",
        "birthMonth",
        "bankBalance",
        "birthMonth",
        "birthMonth",
        "bankBalance",
        "birthMonth",
        "birthMonth",
        "bankBalance",
        "bankBalance",
        "col",
        "favColor",
        "charAt",
        "color",
        "toString",
        "col",
        "car",
        "color",
        "equalsIgnoreCase",
        "car",
        "color",
        "equalsIgnoreCase",
        "car",
        "color",
        "equalsIgnoreCase",
        "car",
        "color",
        "equalsIgnoreCase",
        "car",
        "color",
        "equalsIgnoreCase",
        "car",
        "color",
        "equalsIgnoreCase",
        "car",
        "color",
        "equalsIgnoreCase",
        "car",
        "car",
        "firstName",
        "lastName",
        "retirement",
        "bankBalance",
        "vacationHome",
        "car",
        "firstName",
        "equalsIgnoreCase",
        "firstName",
        "equalsIgnoreCase",
        "input",
        "close",
        "lingo",
        "lingo",
        "equalsIgnoreCase",
        "exit"
    ],
    "literals": [
        "\"Prepare to have your fortune actually predicted.\\nIf you'd like to quit, just type \\\"quit\\\" instead of an answer.\"",
        "\"\\nFirst, please type your first name, then press enter.\"",
        "\"Great, how about your last name?\"",
        "\"Now, not to get too personal, but how old are you?\"",
        "\"You cannot be an amount of years old that is not a number.\\nWe're going to say you're 10,000. Nice going, Methuselah.\"",
        "\"And if you could be born in any month you were actually born in, what would that month be?\"",
        "\"\\nYou can write the name or its number, but no abbreviations like Oct or Jan. May is alright.\"",
        "\"january\"",
        "\"1\"",
        "\"01\"",
        "\"1\"",
        "\"february\"",
        "\"2\"",
        "\"02\"",
        "\"2\"",
        "\"march\"",
        "\"3\"",
        "\"03\"",
        "\"3\"",
        "\"april\"",
        "\"4\"",
        "\"04\"",
        "\"4\"",
        "\"may\"",
        "\"5\"",
        "\"05\"",
        "\"5\"",
        "\"june\"",
        "\"6\"",
        "\"06\"",
        "\"6\"",
        "\"july\"",
        "\"7\"",
        "\"07\"",
        "\"7\"",
        "\"august\"",
        "\"8\"",
        "\"08\"",
        "\"8\"",
        "\"september\"",
        "\"9\"",
        "\"09\"",
        "\"9\"",
        "\"october\"",
        "\"10\"",
        "\"10\"",
        "\"november\"",
        "\"11\"",
        "\"11\"",
        "\"december\"",
        "\"12\"",
        "\"12\"",
        "\"2\"",
        "\"Did you misspell something? Let's just say you were born in February.\"",
        "\"Out of the ROY G. BIV colors, which is your favorite? If you don't know what these are, type HELP\"",
        "\"HELP\"",
        "\"You know, the ROG. B IVY Colors.\"",
        "\"I mean Red, Orange, Yellow, Green, Blue, Indigo, or Violet. That's who ROY G. BIV is.\"",
        "\"ROY G BIV stands for: Red, Orange, Yellow, Green, Blue, Indigo, Violet.\"",
        "\"Like, the R is for Red. O is Orange. And so on. Indigo is like, a purple kind of blue.\"",
        "\"You could say red. Or orange. Or yellow. Green is fine. As are blue and violet, aka purple.\\nAlso acceptable is indigo. Please type one of these.\"",
        "\"Finally, how many siblings do you have?\"",
        "\"The number of siblings you have should be a number. Let's just say there's 2 of them.\"",
        "\"3,000 years\"",
        "\"4,000 years\"",
        "\"vacation home error\"",
        "\"in the vacuumm of space, where you quickly suffocate amongst the slendor of the cosmos.\\nDid you kill your siblings? Is that what happened!? Why are there less than none!?\"",
        "\"adjacent to your normal home. What could be more practical? Saves so much gas.\"",
        "\"on the banks of Steverson Lake, Nebraska. It's not that bad, and you got a really good deal on the real estate.\\nAnd nobody is ever asking to come visit you, so you get that solitude.\"",
        "\"a vast complex of linked hot air baloons, floating over Porcupine, South Dakota.\\nYou've been designing this for years. They said you couldn't do it.\\nBut you could.\"",
        "\"constantly in peril of being \\\"borrowed for the weekend\\\" by your siblings.\"",
        "\"in the Akmola Province of Kazakhstan. It beautiful and far, far away from your many, many siblings.\"",
        "\"in an underground bunker. Your army of siblings has tried to draft you into a weird militia.\\nYou're on the run by this point. This is your only refuge.\"",
        "\"bank balance error\"",
        "\"six dollars but the actual Mona Lisa in a safe deposit box in Switzerland.\"",
        "\"$125 for appearance's sake, but you actually keep your money in gold bars\\nunder your mattress because the government.\"",
        "\"all the money in the world. All of it. Your super villain plan worked, but in the process\\nyou obviously destabilized the economy and all that currency is worthless.\\nThe bank laughs at you as they trade their livestock for grain on the bartering market.\"",
        "\"the secrets of the universe, considering you were born outside of time.\"",
        "\"car error\"",
        "\"r\"",
        "\"an actual rocket ship. It's useless for going to Kroger, but not to get to Moon Kroger!\"",
        "\"o\"",
        "\"eight reindeer hitched together like you're motherfuckin' Santa Claus\"",
        "\"y\"",
        "\"a puma you've caught, trained, and made a cute little saddle for. It is fearsome.\"",
        "\"g\"",
        "\"your own feet. You don't need any fancy automobile when you've got two cars on the end of your legs!\"",
        "\"b\"",
        "\"a submarine. The world has flooded by this point. The grocery store is in a kelp forest.\"",
        "\"i\"",
        "\"an infinite number of brick masons who are constantly restructuring the built environment to move around you.\\nYou don't go to the store. The store comes to you. All movement is an illusion, but yours is especially.\"",
        "\"v\"",
        "\"a dog sled team, but instead of dogs it's norwegian forest cats and instead of a sled it's a surfboard.\\nYou're pretty bodacious in your old age.\"",
        "\"equipped with six GPS devices but it doesn't matter becuase you don't follow directions anyway.\"",
        "\"\\n\\n\\n\"",
        "\" \"",
        "\". It has been \"",
        "\". You have finally retired.\"",
        "\"In your bank account, you will have \"",
        "\"Your vacation home will be \"",
        "\"Your mode of transportation will be \"",
        "\"Brian\"",
        "\"Donnie\"",
        "\"You will one day look back on the time you gave a great grade to an entertaining\\ncoding project as a pivitol moment in your career.\"",
        "\"Enjoy your retirement.\"",
        "\"QUIT\"",
        "\"Ain't nobody like a quitter.\\nBut fine.\""
    ],
    "variables": [
        "age",
        "siblings",
        "retirement"
    ],
    "comments": [
        "make sure we can use scanners",
        "create a new scanner to get us some sweet, sweet keyboard input.",
        "let's refer to this scanner as \"input\"",
        "First let's gobble up some data like we're facebook",
        "DATA GATHERING STAGE////////////////////////////////////////////////////",
        "Ask the user an innocent question by displaying it in the console",
        "Let's save their response in a String type variable called firstName",
        "BOOM, one step closer to stealing their identity!",
        "Save that info for later when you can sell it to facebook.",
        "Also, let's check to see if they told us their name was quit, in which case",
        "let's back off and quit the program.",
        "aaaand repeat. Next question.",
        "",
        "let's save this as a string for now",
        "check to see if the user wants to quit at THIS input. Exit's coming up,",
        "buddy. You want off?",
        "now let's turn that into an integer from a string. Or at least try.",
        "let's not let the user break the program by telling us our age is G or some",
        "shit.",
        "I want the user to be able to write the month's name besides just giving the",
        "number.",
        "let's just a switch case to go through our options based on the input we",
        "received.",
        "if they typed out a month, let's parse that.",
        "then let's turn that string into an integer so we can operate on it later.",
        "And now we're going to ask about their favorite color:",
        "we'll use this variable to see if they've already asked for help because",
        "we're going to be snarky the first time.",
        "so, this loop will run as long as they keep saying HELP is their favorite",
        "color.",
        "if this is the first time they ask for help, give them snark.",
        "okay, maybe they actually need help.",
        "why are they asking again",
        "why are they asking again",
        "if has asked conditional end",
        "while loop end",
        "back to normal questions",
        "alright, we have their info. Let's make some shit up.",
        "if their age is even or odd, we might force them into early retirement.",
        "the location of their vacation home (which is a 100% normal thing to have) is",
        "based on how many of their siblings are chipping in.",
        "this OUGHT to be overwritten. If it isn't, you've managed to",
        "have a number of siblings I didn't account for.",
        "I feel like more than this and the user is lying.",
        "so you have more than 10 siblings? Really?",
        "so now we're gonna decide their bank based on their birth month.",
        "How you get around is going to be dependent on your favorite color. People",
        "might fuck around with their spellings so let's make this a little more",
        "robust:",
        "let's just get the first character from their favorite color. Maybe they read",
        "ROY G BIV and were like, O is the literal thing you are asking for, program.",
        "then let's make that character into a string because equalsIgnoreCase didn't",
        "immediately work how I wanted to with chars.",
        "then based on the letter of your favorite color, here's your transportation.",
        "because you always need a contingency plan for if they didn't answer",
        "correctly. Ugh. Hypothetical users.",
        "and now we'll spit out the fortune we've computed. This is how magic works.",
        "We've done a spell. Wizards."
    ],
    "docstrings": [],
    "functions": [
        "main",
        "checkQuit"
    ],
    "classes": [
        "WeekOneFortuneTeller"
    ]
}