{
    "identifiers": [
        "mochaOvercoat",
        "dreamGown",
        "rainJacket",
        "merlotSuit",
        "moonlightDress",
        "denimPioneer",
        "mochaOvercoat",
        "dreamGown",
        "rainJacket",
        "merlotSuit",
        "moonlightDress",
        "denimPioneer"
    ],
    "literals": [
        "'./assets/mocha-overcoat.jpg'",
        "'./assets/dream-gown.jpg'",
        "'./assets/rain-jacket.jpg'",
        "'./assets/merlot-suit.jpg'",
        "'./assets/moonlight-dress.jpg'",
        "'./assets/denim-pioneer.jpg'",
        "'p1'",
        "'Majestic Vintage Mocha Overcoat'",
        "'Channel timeless sophistication with this stunning mocha overcoat. Crafted for the discerning gentleman who appreciates the fine blend of vintage charm and modern elegance.'",
        "'p2'",
        "'Enchanting Blush Dream Gown'",
        "'Bask in the glow of elegance with our Enchanting Blush Dream Gown. Embody the regality of a queen with a sweet touch of pink that whispers enchantment. This is the perfect piece for those seeking to create unforgettable moments.'",
        "'p3'",
        "'Vintage Sunshine Rain Jacket'",
        "'Brace the showers in style! Our Vintage Sunshine Rain Jacket ensures that you stand out, even in the dullest weather. Because rain is never a reason to compromise on your fashion quotient.'",
        "'p4'",
        "'Classic Merlot Business Suit'",
        "'Step into the boardroom with unmatched confidence in our Classic Merlot Business Suit. Exuding an air of refined class and understated power, it is ideal for the modern executive who values tradition and elegance.'",
        "'p5'",
        "'Ethereal Moonlight Evening Dress'",
        "'Sweep the room off its feet in our Ethereal Moonlight Evening Dress. Crafted to mimic the allure of the moonlight, this dress is a nod to those who appreciate subtle glamour and a standout silhouette.'",
        "'p6'",
        "'Pioneer Rugged Denim Jacket'",
        "'Our Pioneer Rugged Denim Jacket is a tribute to those who embody the spirit of adventure. Designed with durability and comfort in mind, this jacket is a wardrobe essential for the urban explorer.'"
    ],
    "variables": [
        "DUMMY_PRODUCTS"
    ],
    "comments": [],
    "docstrings": [],
    "functions": [],
    "classes": []
}