{
    "identifiers": [
        "fr",
        "gouv",
        "vitamui",
        "commons",
        "api",
        "exception",
        "org",
        "springframework",
        "http",
        "HttpStatus",
        "org",
        "springframework",
        "web",
        "bind",
        "annotation",
        "ResponseStatus",
        "ResponseStatus",
        "value",
        "HttpStatus",
        "BAD_REQUEST",
        "serialVersionUID",
        "message",
        "message",
        "message",
        "key",
        "message",
        "key"
    ],
    "literals": [],
    "variables": [],
    "comments": [],
    "docstrings": [
        "* Copyright French Prime minister Office/SGMAP/DINSIC/Vitam Program (2019-2020)\n * and the signatories of the \"VITAM - Accord du Contributeur\" agreement.\n *\n * contact@programmevitam.fr\n *\n * This software is a computer program whose purpose is to implement\n * implement a digital archiving front-office system for the secure and\n * efficient high volumetry VITAM solution.\n *\n * This software is governed by the CeCILL-C license under French law and\n * abiding by the rules of distribution of free software.  You can  use,\n * modify and/ or redistribute the software under the terms of the CeCILL-C\n * license as circulated by CEA, CNRS and INRIA at the following URL\n * \"http://www.cecill.info\".\n *\n * As a counterpart to the access to the source code and  rights to copy,\n * modify and redistribute granted by the license, users are provided only\n * with a limited warranty  and the software's author,  the holder of the\n * economic rights,  and the successive licensors  have only  limited\n * liability.\n *\n * In this respect, the user's attention is drawn to the risks associated\n * with loading,  using,  modifying and/or developing or reproducing the\n * software by the user in light of its specific status of free software,\n * that may mean  that it is complicated to manipulate,  and  that  also\n * therefore means  that it is reserved for developers  and  experienced\n * professionals having in-depth computer knowledge. Users are therefore\n * encouraged to load and test the software's suitability as regards their\n * requirements in conditions enabling the security of their systems and/or\n * data to be ensured and,  more generally, to use and operate it in the\n * same conditions as regards security.\n *\n * The fact that you are presently reading this means that you have had\n * knowledge of the CeCILL-C license and that you accept its terms.",
        "* Invalid sanitizing criteria",
        "*",
        "* @param message\n     *            the message",
        "* @param message\n     *            the message"
    ],
    "functions": [
        "InvalidSanitizeCriteriaException",
        "InvalidSanitizeCriteriaException"
    ],
    "classes": [
        "InvalidSanitizeCriteriaException"
    ]
}