{
    "identifiers": [
        "Microsoft",
        "Sbom",
        "Targets",
        "Collections",
        "Generic",
        "Diagnostics",
        "Tracing",
        "Microsoft",
        "Build",
        "Framework",
        "Required",
        "Required",
        "Required",
        "Required",
        "Required"
    ],
    "literals": [],
    "variables": [
        "BuildDropPath",
        "PackageSupplier",
        "PackageName",
        "PackageVersion",
        "NamespaceBaseUri",
        "BuildComponentPath",
        "NamespaceUriUniquePart",
        "ExternalDocumentListFile",
        "FetchLicenseInformation",
        "EnablePackageMetadataParsing",
        "Verbosity",
        "ManifestInfo",
        "DeleteManifestDirIfPresent",
        "ManifestDirPath",
        "SbomToolPath"
    ],
    "comments": [
        "Copyright (c) Microsoft. All rights reserved.",
        "Licensed under the MIT license. See LICENSE file in the project root for full license information.",
        "This partial class defines and sanitizes the arguments that will be passed",
        "into the SBOM API and CLI tool for generation.",
        "</summary>",
        "Gets or sets the path to the drop directory for which the SBOM will be generated.",
        "</summary>",
        "Gets or sets the supplier of the package the SBOM represents.",
        "</summary>",
        "Gets or sets the name of the package the SBOM represents.",
        "</summary>",
        "Gets or sets the version of the package the SBOM represents.",
        "</summary>",
        "Gets or sets the base path of the SBOM namespace uri.",
        "</summary>",
        "Gets or sets the path to the directory containing build components and package information.",
        "For example, path to a .csproj or packages.config file.",
        "</summary>",
        "Gets or sets a unique URI part that will be appended to NamespaceBaseUri.",
        "</summary>",
        "Gets or sets the path to a file containing a list of external SBOMs that will be appended to the",
        "SBOM that is being generated.",
        "</summary>",
        "Indicates whether licensing information will be fetched for detected packages.",
        "</summary>",
        "Indicates whether to parse licensing and supplier information from a packages metadata file.",
        "</summary>",
        "Gets or sets the verbosity level for logging output.",
        "</summary>",
        "Gets or sets a list of names and versions of the manifest format being used.",
        "</summary>",
        "Indicates whether the previously generated SBOM manifest directory should be deleted",
        "before generating a new SBOM in the directory specified by ManifestDirPath.",
        "Defaults to true.",
        "</summary>",
        "Gets or sets the path where the SBOM will be generated. For now, this property",
        "will be unset as the _manifest directory is intended to be at the root of a NuGet package",
        "specified by BuildDropPath.",
        "</summary>",
        "Gets or sets the path to the SBOM CLI tool",
        "</summary>"
    ],
    "docstrings": [
        "<summary>",
        "<summary>",
        "<summary>",
        "<summary>",
        "<summary>",
        "<summary>",
        "<summary>",
        "<summary>",
        "<summary>",
        "<summary>",
        "<summary>",
        "<summary>",
        "<summary>",
        "<summary>",
        "<summary>",
        "<summary>"
    ],
    "functions": [],
    "classes": [
        "GenerateSbom"
    ]
}