{
    "identifiers": [
        "ex12Q2",
        "NUM_OF_GENES",
        "NUM_OF_PREFERENCE_LISTS",
        "NUM_OF_COMPONENTS",
        "_man",
        "_woman",
        "_dog",
        "man",
        "woman",
        "dog",
        "setMan",
        "man",
        "woman",
        "dog",
        "setWoman",
        "woman",
        "man",
        "dog",
        "setDog",
        "dog",
        "man",
        "woman",
        "man",
        "woman",
        "dog",
        "man",
        "setPartners",
        "woman",
        "dog",
        "setMan",
        "man",
        "woman",
        "man",
        "dog",
        "woman",
        "setPartners",
        "man",
        "dog",
        "setWoman",
        "woman",
        "dog",
        "man",
        "woman",
        "dog",
        "setPartners",
        "man",
        "woman",
        "setDog",
        "dog",
        "_man",
        "man",
        "_man",
        "man",
        "_woman",
        "woman",
        "_woman",
        "woman",
        "_dog",
        "dog",
        "_dog",
        "dog",
        "numOfChromosomes",
        "numOfChromosomes",
        "NUM_OF_PREFERENCE_LISTS",
        "NUM_OF_COMPONENTS",
        "_man",
        "getDistance",
        "_woman",
        "getDistance",
        "_dog",
        "getDistance"
    ],
    "literals": [],
    "variables": [
        "_man",
        "_woman",
        "_dog"
    ],
    "comments": [
        "The number of components/genes in each chromosome.",
        "Number of preference lists.",
        "Number of components in the chromosome.",
        "Represents a man in a solution for the three-way matching optimization problem.",
        "Represents a man in a solution for the three-way matching optimization problem.",
        "Represents a man in a solution for the three-way matching optimization problem."
    ],
    "docstrings": [
        "* Represents a possible solution to the three-way matching optimization problem.\n * @author Yaniv Tzur",
        "* Creates a new chromosome (solution) with the input man, woman and dog components (genes).\n\t * @param man The man component (gene) to store in the chromosome.\n\t * @param woman The woman component (gene) to store in the chromosome.\n\t * @param dog The dog component (gene) to store in the chromosome.",
        "* Sets the man component (gene) of the chromosome to the input man component and sets its\n\t * partners to be the input woman and dog.\n\t * @param man The man to set as the man component (gene) of the chromosome.\n\t * @param woman The woman to set as one of the man's partners.\n\t * @param dog The dog to set as one of the man's partners.",
        "* Sets the woman component (gene) of the chromosome to the input woman component and sets its\n\t * partners to be the input man and dog.\n\t * @param woman The woman to set as the woman component (gene) of the chromosome.\n\t * @param man The man to set as one of the woman's partners.\n\t * @param dog The dog to set as one of the woman's partners.",
        "* Sets the dog component (gene) of the chromosome to the input dog component and sets its\n\t * partners to be the input man and woman.\n\t * @param dog The dog to set as the dog component (gene) of the chromosome.\n\t * @param man The man to set as one of the dog's partners.\n\t * @param woman The woman to set as one of the dog's partners.",
        "* Returns a reference to the man component of the three-way matching (chromosome).\n\t * @return A reference to the man component of the three-way matching (chromosome).",
        "* Sets the input man as the chromosome's man component.\n\t * @param man The man to set as the man component for the chromosome.",
        "* Returns a reference to the woman component of the three-way matching (chromosome).\n\t * @return A reference to the woman component of the three-way matching (chromosome).",
        "* Sets the input woman as the chromosome's man component.\n\t * @param woman The woman to set as the woman component for the chromosome.",
        "* Returns a reference to the dog component of the three-way matching (chromosome).\n\t * @return A reference to the dog component of the three-way matching (chromosome).",
        "* Sets the input dog as the chromosome's man component.\n\t * @param dog The dog to set as the dog component for the chromosome.",
        "* Receives the number of chromosomes in the current generation and returns the fitness\n\t * of the chromosome.\n\t * The fitness is calculated as the maximum possible sum of distances minus the actual sum of\n\t * distances to obtain a monotonically increasing function.\n\t * @param numOfChromosomes The number of chromosomes in the current generation.\n\t * @return The fitness of the chromosome."
    ],
    "functions": [
        "Chromosome",
        "setMan",
        "setWoman",
        "setDog",
        "Man",
        "getMan",
        "setMan",
        "Woman",
        "getWoman",
        "setWoman",
        "Dog",
        "getDog",
        "setDog",
        "getFitness"
    ],
    "classes": [
        "Chromosome"
    ]
}