"""
Задача №2.
Послідовність складається з натуральних чисел і завершується числом 0.
Визначте, скільки елементів цієї послідовності рівні її найбільшому
елементу. Вводиться послідовність цілих чисел, що закінчується числом 0
(саме число 0 в послідовність не входить, а використовується як ознака
її закінчення).

Автор: Новосад Сніжана
"""

# Ініціалізація змінних
max_element = 0
count_max = 0

# Введення послідовності
number = int(input("Введіть число (0 для завершення): "))

# Обробка послідовності
while number != 0:
    if number > max_element:
        max_element = number
        count_max = 1
    elif number == max_element:
        count_max += 1
    
    number = int(input("Введіть число (0 для завершення): "))

# Виведення результату
print(f"Кількість елементів, рівних найбільшому елементу, складає {count_max}.")