{
    "identifiers": [
        "ComicBookThumbnail",
        "ComicBookImage",
        "BarkMatchThumbnail",
        "BarkMatchImage",
        "EatDaBurgerThumbnail",
        "EatDaBurgerImage",
        "TimedQuizThumbnail",
        "TimedQuizImage",
        "WeatherThumbnail",
        "WeatherImage",
        "ComicBookThumbnail",
        "ComicBookImage",
        "BarkMatchThumbnail",
        "BarkMatchImage",
        "EatDaBurgerThumbnail",
        "EatDaBurgerImage",
        "WeatherThumbnail",
        "WeatherImage",
        "TimedQuizThumbnail",
        "TimedQuizImage",
        "projects"
    ],
    "literals": [
        "'../assets/images/comicbook.gif'",
        "'../assets/images/comic-book-finder.png'",
        "'../assets/images/barkmatch.gif'",
        "'../assets/images/barkmatch.png'",
        "'../assets/images/eat-da-burger.gif'",
        "'../assets/images/eat-da-burger.PNG'",
        "'../assets/images/timed-quiz.gif'",
        "'../assets/images/timed-quiz.png'",
        "'../assets/images/weather-dashboard.gif'",
        "'../assets/images/weather-dashboard.png'",
        "\"Comicbook Finder\"",
        "\"This project was created in a collaboration with me and three other developers with our code hosted in GitHub. The frontend was created using HTML 5 and styled mainly using the Bootstrap framework along with some custom CSS. The backend uses jQuery to call two API's, Comicvine and SuperheroAPI, to retrieve data about the characters and comic books. The page is then populated with elements dynamically created from the clientside Javascript.\"",
        "\"A single page website created to find random characters and comic books that the characters made appearances in.\"",
        "'https://raiford2530.github.io/ComicBook-Finder/'",
        "'https://github.com/raiford2530/ComicBook-Finder'",
        "'Git'",
        "'HTML 5'",
        "'jQuery'",
        "'CSS'",
        "'Bootstrap'",
        "'Javascript'",
        "\"Bark Match\"",
        "'Barkmatch was created using Node.js and several node packages. The project used the express node package to create the server, view routes, and api routes. The express handlebars node package was used to render templates created on the server side with data pulled in from the database. The Sequelize node package was used for all of the queries to the MySql database. We used node NodeMailer to create and send a confirmation email to a user once they sign up to walk a dog. Authentication was implemented using the Passport node package. All of the styling was done using the Bulma css framework along with custom css.'",
        "\"BarkMatch is a website that allows users to browse dogs and sign up to walk a dog from a list of dogs uploaded by a dog shelter\"",
        "'https://vast-river-69240.herokuapp.com/'",
        "'https://github.com/raiford2530/BarkMatch-project2'",
        "'Git'",
        "'Node.js'",
        "'jQuery'",
        "'CSS'",
        "'Bulma'",
        "'Express'",
        "'Express Handlebars'",
        "'MySQL'",
        "'Sequelize'",
        "'NodeMailer'",
        "'Passport'",
        "\"Eat-Da-Burger\"",
        "'Eat-Da-Burger was created using Node.js. I used the express node package for to create view routes and api routes. For the view routes, I used the express handlebars node package to render templates created on the server side. I created an ORM to mediate calls to the MySQL database to create and modify data about the burgers input by the user.'",
        "\"Eat-Da-Burger is a simple web app for users to enter burgers that they want to eat and then indicate when they have eaten the burgers\"",
        "'https://rraiford-eat-a-burger.herokuapp.com'",
        "'https://github.com/raiford2530/burger'",
        "'Git'",
        "'Node.js'",
        "'jQuery'",
        "'CSS'",
        "'Bootstrap'",
        "'Express'",
        "'Express Handlebars'",
        "'MySQL'",
        "\"Weather Dashboard\"",
        "\"The frontend was created using HTML 5 and styled mainly using the Bootstrap framework along with some custom CSS. The backend uses jQuery to call the OpenWeather API to retrieve the weather data for the searched city. The page is then populated with elements dynamically created from the clientside Javascript. The page uses local storage to store the user's last search so that it persists when the user leaves or refreshes the page.\"",
        "\"A website created to find current weather conditions and the five day weather forecast for a given city.\"",
        "'https://raiford2530.github.io/weather-dashboard/'",
        "'https://github.com/raiford2530/weather-dashboard'",
        "'Git'",
        "'HTML 5'",
        "'jQuery'",
        "'CSS'",
        "'Bootstrap'",
        "'Javascript'",
        "\"Timed Quiz\"",
        "\"The frontend was created using HTML 5 and styled mainly using the Bootstrap framework along with some custom CSS. I used clientside Javascript to handle the timer and to populate the questions with questions and answers. The webpage uses local storage to store the user's score and display it in the list of highscores on the highscore page.\"",
        "\"A website created for a user to take a timed quiz over javascript terms.\"",
        "'https://raiford2530.github.io/timed-quiz/'",
        "'https://github.com/raiford2530/timed-quiz'",
        "'Git'",
        "'HTML 5'",
        "'CSS'",
        "'Bootstrap'",
        "'Javascript'"
    ],
    "variables": [
        "projects"
    ],
    "comments": [],
    "docstrings": [],
    "functions": [],
    "classes": []
}