{
    "identifiers": [
        "SolidityIcon",
        "JavascriptIcon",
        "LearningIcon",
        "SolidityIcon",
        "JavascriptIcon",
        "LearningIcon",
        "LearningIcon"
    ],
    "literals": [
        "\"../../../../public/Solidity.svg\"",
        "\"../../../../public/javascript.svg\"",
        "\"../../../../public/learn-icon.svg\"",
        "'Solidity'",
        "'Level Up Your Tech Team Recruitment With Coding Tests In 20+ Languages, Helping You Identify Top Developer Talent With Ease.'",
        "'Programming'",
        "'April 27th, 2025'",
        "'$180'",
        "\"Institution's Name\"",
        "\"The Solidity Programming Test Evaluates Candidates' Ability To Develop Smart Contracts Using The Solidity Language On The Ethereum Virtual Machine. The Test Can Include Various Tasks Such As Creating Smart Contracts Such As State Variables, Functions, Data Structures, Modifiers, And Events. It Also Evaluates Their Ability To Write Secure, Efficient, And Maintainable Code, Ensuring They Can Build And Interact With Decentralized Applications Designed In A Web3 Environment.\"",
        "\"Variables\"",
        "\"Data Structures\"",
        "\"Events\"",
        "\"Functions\"",
        "\"Modifiers\"",
        "'JavaScript'",
        "'Level Up Your Tech Team Recruitment With Coding Tests In 20+ Languages, Helping You Identify Top Developer Talent With Ease.'",
        "'Programming'",
        "'May 15th, 2025'",
        "'$150'",
        "\"Code Academy\"",
        "\"The JavaScript Programming Test Evaluates Candidates' Ability To Develop Client-Side And Server-Side Applications Using JavaScript. The Test Covers Core Concepts Such As Variables, Data Types, Functions, Object-Oriented Programming, Asynchronous Programming With Promises, And DOM Manipulation. It Also Assesses Their Ability To Write Clean, Efficient, And Maintainable Code For Modern Web Applications.\"",
        "\"DOM Manipulation\"",
        "\"Async/Await\"",
        "\"ES6 Features\"",
        "\"Object-Oriented JS\"",
        "\"Functional Programming\"",
        "'Design Thinking'",
        "'Level Up Your Tech Team Recruitment With Coding Tests In 20+ Languages, Helping You Identify Top Developer Talent With Ease.'",
        "'Product Design'",
        "'June 3rd, 2025'",
        "'$200'",
        "\"Design Institute\"",
        "\"The Design Thinking Test Evaluates Candidates' Understanding Of Human-Centered Design Processes And Problem-Solving Methodologies. The Assessment Covers The Key Phases Of Design Thinking: Empathize, Define, Ideate, Prototype, And Test. It Measures Their Ability To Create User Personas, Journey Maps, And Wireframes, As Well As Their Skills In Conducting User Research And Translating Findings Into Actionable Design Solutions.\"",
        "\"User Research\"",
        "\"Prototyping\"",
        "\"Journey Mapping\"",
        "\"User Testing\"",
        "\"Wireframing\"",
        "'Web3 Basics'",
        "'Level Up Your Tech Team Recruitment With Coding Tests In 20+ Languages, Helping You Identify Top Developer Talent With Ease.'",
        "'Technical Writing'",
        "'June 21st, 2025'",
        "'$220'",
        "\"Blockchain Academy\"",
        "\"The Web3 Basics Test Evaluates Candidates' Knowledge Of Fundamental Web3 Concepts And Decentralized Technologies. The Exam Covers Blockchain Principles, Smart Contracts, Decentralized Applications (dApps), Cryptocurrencies, Non-Fungible Tokens (NFTs), And Decentralized Finance (DeFi). It Assesses Their Understanding Of The Underlying Infrastructure And The Ability To Explain Complex Web3 Concepts In Clear, Concise Technical Documentation.\"",
        "\"Blockchain Basics\"",
        "\"Smart Contracts\"",
        "\"dApp Architecture\"",
        "\"Tokenomics\"",
        "\"Wallet Integration\""
    ],
    "variables": [
        "examData"
    ],
    "comments": [
        "Additional fields from the Figma design",
        "Additional fields from the Figma design",
        "Additional fields from the Figma design",
        "Additional fields from the Figma design"
    ],
    "docstrings": [],
    "functions": [],
    "classes": []
}