{
    "identifiers": [
        "org",
        "gnome",
        "gtk",
        "org",
        "gnome",
        "gdk",
        "Screen",
        "org",
        "gnome",
        "glib",
        "GlibException",
        "org",
        "gnome",
        "glib",
        "pointer",
        "pointer",
        "GtkCssProvider",
        "createCssProvider",
        "name",
        "variant",
        "GtkCssProvider",
        "getNamed",
        "name",
        "variant",
        "resource_path",
        "GtkCssProvider",
        "loadFromResource",
        "resource_path",
        "data",
        "GtkCssProvider",
        "loadFromData",
        "data",
        "data",
        "length",
        "e",
        "e",
        "getMessage",
        "path",
        "GtkCssProvider",
        "loadFromPath",
        "path",
        "e",
        "e",
        "getMessage",
        "GtkCssProvider",
        "toString"
    ],
    "literals": [],
    "variables": [],
    "comments": [],
    "docstrings": [
        "* java-gnome, a UI library for writing GTK and GNOME programs from Java!\n *\n * Copyright © 2020 java-gnome contributors\n *\n * The code in this file, and the program it is a part of, is made available\n * to you by its authors as open source software: you can redistribute it\n * and/or modify it under the terms of the GNU General Public License version\n * 2 (\"GPL\") as published by the Free Software Foundation.\n *\n * This program is distributed in the hope that it will be useful, but WITHOUT\n * ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or\n * FITNESS FOR A PARTICULAR PURPOSE. See the GPL for more details.\n *\n * You should have received a copy of the GPL along with this program. If not,\n * see http://www.gnu.org/licenses/. The authors of this program may be\n * contacted through http://java-gnome.sourceforge.net/.\n *\n * Linking this library statically or dynamically with other modules is making\n * a combined work based on this library. Thus, the terms and conditions of\n * the GPL cover the whole combination. As a special exception (the\n * \"Classpath Exception\"), the copyright holders of this library give you\n * permission to link this library with independent modules to produce an\n * executable, regardless of the license terms of these independent modules,\n * and to copy and distribute the resulting executable under terms of your\n * choice, provided that you also meet, for each linked independent module,\n * the terms and conditions of the license of that module. An independent\n * module is a module which is not derived from or based on this library. If\n * you modify this library, you may extend the Classpath Exception to your\n * version of the library, but you are not obligated to do so. If you do not\n * wish to do so, delete this exception statement from your version.",
        "* CSS-like styling for widgets\n * <br/><br/>\n * CssProvider is an object implementing the {@link StyleProvider} interface. \n * It is able to parse CSS-like input in order to style widgets.\n * <br/><br/>\n * An application can make GTK+ parse a specific CSS style sheet by calling \n * {@link #loadFromPath(String)} or {@link #loadFromResource(String)} and \n * adding the provider with {@link StyleContext#addProvider(StyleProvider, int)} \n * or {@link StyleContext#addProviderForScreen(Screen, StyleProvider, int)}\n * \n * @author Patrick Plenefisch\n * @since 4.1.4",
        "* Creates a new CssProvider\n     * \n     * @since 4.1.4",
        "* Loads a theme from the usual theme paths.\n     * \n     * @since 4.1.4",
        "* Loads the data contained in the resource at resource_path into the \n     * CssProvider, clearing any previously loaded information.\n     * \n     * @since 4.1.4",
        "* Loads data into css_provider , and by doing so clears any previously loaded information.\n     * \n     * @since 4.1.4",
        "* Loads the data contained in path into css_provider,\n     * making it clear any previously loaded information.\n     * \n     * @since 4.1.4",
        "* Converts the provider into a string representation in CSS format.\n     * \n     * @since 4.1.4"
    ],
    "functions": [
        "CssProvider",
        "CssProvider",
        "CssProvider",
        "getNamed",
        "loadFromResource",
        "loadFromData",
        "loadFromPath",
        "toString"
    ],
    "classes": [
        "CssProvider"
    ]
}