using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp4
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Task1();
            Task2();
            Task3();
            Task4();
        }

        private static void Task1()
        {
            /*
            Задание 1

    Напишите программу - консольный калькулятор.
    Создайте две переменные с именами operand1 и operand2.
    Задайте переменным некоторые произвольные значения.
    Предложите пользователю ввести знак арифметической операции.
    Примите значение, введенное пользователем, и поместите его в строковую переменную sign.
    Для организации выбора алгоритма вычислительного процесса, используйте переключатель switch.
    Выведите на экран результат выполнения арифметической операции.
    **В случае использования операции деления, организуйте проверку попытки деления на ноль.
    И если таковая имеется, то отмените выполнение арифметической операции и уведомите об ошибке пользователя. 
             */
            throw new NotImplementedException();
        }

        private static void Task2()
        {
            /*
     Задание 2

    Напишите программу определения, попадает ли указанное пользователем число от 0 до 100 в числовой промежуток [0 - 14] [15 - 35] [36 - 50][50 - 100].
    Если да, то укажите, в какой именно промежуток.
    Если пользователь указывает число, не входящее ни в один из имеющихся числовых промежутков, то выводится соответствующее сообщение.
                 */


        }

        private static void Task3()
        {

            /*
               Задание 3

            Напишите программу русско-английский переводчик.
            Программа знает 10 слов о погоде.
            Требуется, чтобы пользователь вводил слово на русском языке, а программа давала ему перевод этого слова на английском языке.
            Если пользователь ввел слово, для которого отсутствует перевод, то следует вывести сообщение, что такого слова нет.
                         */
            throw new NotImplementedException();
        }

        private static void Task4()
        {
            /*
Задание 4

Напишите программу, которая будет выполнять проверку чисел на четность.
             */

            throw new NotImplementedException();
        }
    }
}