{
    "identifiers": [
        "Shepherd",
        "Shepherd",
        "Shepherd",
        "visualTour",
        "visualTour",
        "localStorage",
        "localStorage",
        "visualTour",
        "visualTour",
        "userHasSeenTour",
        "visualTour",
        "visualTour",
        "visualTour",
        "userHasSeenTour",
        "visualTour",
        "alreadySeenTour"
    ],
    "literals": [
        "'shepherd.js'",
        "'shadow-md bg-purple-dark'",
        "'smooth'",
        "'center'",
        "'Previous'",
        "'Next'",
        "'tour'",
        "'true'",
        "'tour'",
        "'true'",
        "'Welcome to ORCA'",
        "'ORCA is a dashboard for visualizing and analyzing data of the organ donation process.<br>In this tour, we will show you the main features of the dashboard.'",
        "'Do not show again'",
        "'Skip'",
        "'Start'",
        "'Grid'",
        "'This is the grid. It is the main component of the dashboard. It consists of tiles, which are visualizations of data.'",
        "'.vue-grid-layout'",
        "'top'",
        "'Tiles'",
        "'Tiles are visualizations of data. They can be moved by dragging them around the grid. You can also resize them by dragging the bottom right corner. Feel free to try it out!'",
        "'#vue-tile-0'",
        "'right'",
        "'Distribution Visualization'",
        "'This tile shows the first type of visualization: a distribution. To be exact, currently it shows the distribution of genders in the dataset.'",
        "'You can change the disaggregation attribute by editing the tile.<br> Lets start by changing this visualization to show the distribution of ages in the dataset. Click on the edit button in the top right corner of the tile.'",
        "'#vue-tile-0'",
        "'right'",
        "'#vue-tile-0 .flex-1:nth-child(3)>.tile-btn'",
        "'click'",
        "'Disaggregation Attribute'",
        "'This is the disaggregation attribute. It is used to determine the distribution. You can change it by clicking on the dropdown menu and selecting a different attribute.'",
        "'input#change-title+div.p-dropdown'",
        "'right'",
        "'input#change-title+div.p-dropdown'",
        "'click'",
        "'Select a Disaggregation Attribute'",
        "'Select the age attribute.'",
        "'ul.p-dropdown-items'",
        "'right'",
        "'ul.p-dropdown-items>li:nth-child(2)'",
        "'click'",
        "'Tile Title'",
        "'This is the title of the tile. You can change it by clicking on the text and typing a new title.'",
        "'input#change-title'",
        "'right'",
        "'Save Changes'",
        "'You can save the changes you made by clicking on the save button.'",
        "'div.p-dialog-footer>button.primary'",
        "'right'",
        "'div.p-dialog-footer>button.primary'",
        "'click'",
        "'Age Distribution'",
        "'The tile now shows the distribution of ages in the dataset. You can see that the majority of the patients are between 50 and 80 years old.<br>'",
        "'Let\\'s investigate how the age distribution looks for female patients. To add filters click the \"Add Filter\" button in the bottom center of the tile.'",
        "'#vue-tile-0'",
        "'right'",
        "'#vue-tile-0 .tile-footer button'",
        "'click'",
        "'Add Filter'",
        "'First start by selecting the attribute you want to filter by. The attributes are grouped into two categories: \"Patient\" and \"Process\" attributes.<br>'",
        "'Under the patient group you can find all extracted attributes of the patient. Under the process group you can find all supported attributes of the process.<br>'",
        "'Or you can search for an attribute by typing its name into the search bar.<br>'",
        "'Select the \"Gender\" attribute to add your first filter'",
        "'.p-overlaypanel'",
        "'right'",
        "'.p-overlaypanel .p-listbox-list-wrapper>ul'",
        "'click'",
        "'Edit filter'",
        "'By default all added filters are set to \"is not empty\". You can change this by clicking on the filter.'",
        "'#vue-tile-0 .tile-footer'",
        "'right'",
        "'#vue-tile-0 .tile-footer .p-chip'",
        "'click'",
        "'Filter operator'",
        "'You can change the operator by clicking on the dropdown menu and selecting a different operator.'",
        "'.p-overlaypanel'",
        "'right'",
        "'.p-overlaypanel .p-dropdown'",
        "'click'",
        "'Select operator'",
        "'Select the \"EQUALS\" operator.'",
        "'.p-dropdown-panel .p-dropdown-items'",
        "'right'",
        "'.p-dropdown-panel .p-dropdown-items'",
        "'click'",
        "'Filter value'",
        "'You can change the value of the filter by clicking on the input field. For categorical attributes you can select a value from a dropdown menu. For numerical attributes you can type in a value.'",
        "'.p-overlaypanel .p-dropdown:nth-child(2)'",
        "'right'",
        "'.p-overlaypanel .p-dropdown:nth-child(2)'",
        "'click'",
        "'Select filter value'",
        "'As we want to see the age distribution for female patients, select the \"F\" (Female) value.'",
        "'.p-dropdown-panel .p-dropdown-items'",
        "'right'",
        "'.p-dropdown-panel .p-dropdown-items>li'",
        "'click'",
        "'Filtered Age Distribution'",
        "'Here we go! Now we see the distribution of ages among female patients.<br>'",
        "'You can remove a filter by clicking on the \"x\" next to the filter.'",
        "'Or you can add even more filters by clicking on the \"Add Filter\" button again. Those filters are combined with an \"AND\" operator.<br>'",
        "'Last but not least you can download the visualization by clicking on the \"Download\" button in the top right corner of the tile.'",
        "'#vue-tile-0'",
        "'right'",
        "'Global Filters'",
        "'You can also add global filters. These filters are applied to all tiles. To add a global filter click on the \"Add Global Filter\" button in the top center of the dashboard.'",
        "'#global-filters'",
        "'bottom'",
        "'Add a Tile'",
        "'You can add a new tile by clicking on the \"Add Tile\" button in the top right corner of the dashboard.'",
        "'#add-tile-button'",
        "'bottom'",
        "'#add-tile-button'",
        "'click'",
        "'Configure Tile'",
        "'You can configure the tile by clicking on the \"Configure Tile\" button in the top right corner of the tile.'",
        "'.vue-grid-item:nth-last-child(3)'",
        "'top'",
        "'.vue-grid-item:nth-last-child(3) .flex-1:nth-child(3)>.tile-btn'",
        "'click'",
        "'Select Visualization'",
        "'You can select a visualization by clicking on the dropdown menu and selecting a visualization. Do not forget to also select a disaggregation attribute and to save the changes.'",
        "'.p-dialog.p-component.modal-window'",
        "'right'",
        "'div.p-dialog-footer>button.primary'",
        "'click'",
        "'Remove Tile'",
        "'You can remove a tile by clicking on the \"Remove Tile\" button in the top right corner of the tile.'",
        "'.vue-grid-item:nth-last-child(3) .flex-1:nth-child(4)>.tile-btn'",
        "'right'",
        "'End of Tour'",
        "'This is the end of the tour. Please refer to the user manual for more and detailed information.<br>'",
        "'If you want to see the tour again, you can click on the \"Help\" button in the top right corner of the dashboard.<br>'",
        "'We hope you enjoy using ORCA!'",
        "'Finish'"
    ],
    "variables": [
        "visualTour",
        "alreadySeenTour"
    ],
    "comments": [
        "load from local storage if the user has already seen the tour",
        "function that saves that the user has seen the tour in local storage"
    ],
    "docstrings": [],
    "functions": [
        "userHasSeenTour"
    ],
    "classes": []
}