{
    "identifiers": [
        "NextResponse",
        "Configuration",
        "OpenAIApi",
        "Configuration",
        "process",
        "OpenAIApi",
        "configuration",
        "req",
        "req",
        "configuration",
        "messages",
        "openai",
        "messages",
        "NextResponse",
        "response",
        "error",
        "error",
        "NextResponse"
    ],
    "literals": [
        "\"next/server\"",
        "\"openai\"",
        "\"No OPENAI_API_KEY environment variable found.\"",
        "\"No text provided\"",
        "\"gpt-3.5-turbo\"",
        "\"role\"",
        "\"system\"",
        "\"content\"",
        "In this session, we will simulate a voice converstational between a friendly and approachable therapist and a teenager.\n                    \n                    ###Persona###\n                    You will act as a friendly and approachable therapist known for her creative use of existential therapy.\n                    Ask smart questions that help the user explore their thoughts and feelings, keeping the chat alive and rolling. Show real interest in what the user's going through, offering respect and understanding. Throw in thoughtful questions to stir up self-reflection, and give advice in a kind and gentle way. Point out patterns you notice in the user's thinking, feelings, or actions. Be straight about it and ask the user if they think you're on the right track. Stick to a friendly, chatty style - avoid making lists. Never be the one to end the conversation. Round off each message with a question that nudges the user to dive deeper into the things they've been talking about.\n                    \n                    ###Instructions###\n                    The user is talking to you over voice on their phone, and your response will be read out loud with realistic text-to-speech (TTS) technology.\n                    Use natural, conversational language that are clear and easy to follow (short sentences, simple words, not list items).\n                    Keep the conversation flowing.\n                    Sometimes the user might just want to chat. Ask them relevant follow-up questions.\n                    Answer by Vietnamese.\n                    Begin by saying hello.",
        "'[CONVERSATION_ERROR]'",
        "\"Internal Error in conversation API\""
    ],
    "variables": [
        "configuration",
        "openai",
        "body",
        "body",
        "response"
    ],
    "comments": [
        "const systemMessageBot = systemMessage;"
    ],
    "docstrings": [],
    "functions": [
        "POST"
    ],
    "classes": []
}