{
    "identifiers": [
        "ActionType",
        "CardType"
    ],
    "literals": [
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string"
    ],
    "variables": [],
    "comments": [
        "This module contains type definitions and run-time type-checking code used\n  throughout the app.",
        "A Party is a single group of players that persists across multiple games.",
        "_ids of players with super cow powers.",
        "A Player is a member of a Party and an participant in a Game. For now,\n  a Player represents a single person within a game session, NOT a single\n  user that persists across many sessions.",
        "Unique identifier for this player",
        "User-chosen display name",
        "A secret used to authenticate player. This secret should be randomly\n    generated by client and sent to server, but it should NOT be a player\n    chosen password (these would have to be hashed). This secret is intended\n    for temporary use during a game and is not a permanent account or\n    authentication solution.\n\n    This field should NOT be published.",
        "A Game is an instance of a game, with its configuration options and game\n  state, as players interact with it",
        "What version of the game is this? Allows us to migrate rules and",
        "game format gracefully in the future.",
        "A copy of the Party *at the time* the game was created. We make a copy\n    because the Party may change from Game to Game -- e.g. a player is added\n    or dropped.",
        "Game State",
        "Information used to represent the base state of the game",
        "Base (private) information about players (do not publish)",
        "List of completed turns for this game from oldest to newest.",
        "Is this game done yet?",
        "Timestamps",
        "Options for configuring how an instance of this game is played",
        "How many planets should each player get by default?",
        "Immutable characteristics for a Planet",
        "_id of Player who controls this planet",
        "Display name for this planet",
        "Description text of what's on this planet",
        "Private state for a player (public or immutable information is reflected in\n  the Party type or other game state types)",
        "Is this player the evil mastermind?",
        "Represents a completed turn and the state of things immediately following\n  the",
        "Action information that is public knowledge",
        "Additional state information private to a player or group of players",
        "DO NOT PUBLISH",
        "Players who have confirmed that they're ready to go",
        "Things about a planet that may change during a turn",
        "Has this planet been destroyed?",
        "_id of player owning ships",
        "Number of ships belonging to player",
        "Resources generated per turn for planet's owner",
        "A set of our primary resources",
        "Player engaged in action. Public state is null when anonymous. This field\n    will be populated if player is allowed to know who engaged in this action.",
        "Resource Actions",
        "Play an action card",
        "Public attack / defend",
        "A resource action is an act by a player that represents an expenditure\n  of resources on some new item, like buying a ship. Private to player.",
        "Upgrades a planet's resource output. Private to player.",
        "Purchase a player ship.",
        "Buy an Action Card",
        "Represents an Action Card",
        "Card that targets planet",
        "Card that targets another player",
        "Because playerId is used to denote player of card",
        "Represents an attempt to defend or attack a planet",
        "True if attacking, false if defending",
        "Planet being attacked or defended",
        "Number of ship being commited",
        "Ships lost during attack",
        "Private state of a player immediately after a turn has completed -- also\n  used to record actions somewhat private to player during that turn",
        "Resources and cards controlled by player",
        "Undeployed ships are ships not committed to any planet",
        "Actions by or affecting this player that are NOT public",
        "Supplemental information that a player may have about things",
        "Player's additional information about planets that may differ from or add\n  to public state",
        "Does this planet have a super weapon? Null means \"don't know\", whereas",
        "false means \"confirmed no\".",
        "Player's additional informaion about actions that may differ from or add\n  to public state",
        "Used to de-anonymize anonymous players"
    ],
    "docstrings": [],
    "functions": [],
    "classes": []
}