{
    "identifiers": [
        "Collections",
        "Collections",
        "Generic",
        "MatterHackers",
        "DataConverters3D",
        "T",
        "T",
        "T",
        "items",
        "T",
        "T",
        "sourceItems",
        "items",
        "T",
        "sourceItems",
        "T",
        "item",
        "Modify",
        "Add",
        "item",
        "T",
        "item",
        "Modify",
        "Add",
        "item",
        "items",
        "Count",
        "T",
        "item",
        "items",
        "Contains",
        "item",
        "Action",
        "T",
        "modifier",
        "T",
        "items",
        "modifier",
        "safeClone",
        "items",
        "safeClone",
        "ItemsModified",
        "Invoke",
        "IEnumerator",
        "T",
        "items",
        "GetEnumerator",
        "items",
        "GetEnumerator"
    ],
    "literals": [],
    "variables": [
        "EventHandler",
        "ItemsModified",
        "items",
        "Count",
        "safeClone"
    ],
    "comments": [
        "Copyright (c) 2017, Lars Brubaker, John Lewin\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this\n   list of conditions and the following disclaimer.\n2. Redistributions in binary form must reproduce the above copyright notice,\n   this list of conditions and the following disclaimer in the documentation\n   and/or other materials provided with the distribution.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\nANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\nWARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\nDISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR\nANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\nLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND\nON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\nSOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nThe views and conclusions contained in the software and documentation are those\nof the authors and should not be interpreted as representing official policies,\neither expressed or implied, of the FreeBSD Project.",
        "Provides a safe context to manipulate items. Copies items into a new list, invokes the 'modifier'",
        "Action passing in the copied list and finally swaps the modified list into place after the invoked Action completes",
        "</summary>",
        "<param name=\"modifier\">The Action to invoke</param>",
        "Copy the child items to a new list",
        "Pass the new list to the Action for manipulation",
        "Swap the modified list into place"
    ],
    "docstrings": [
        "<summary>"
    ],
    "functions": [
        "SafeList",
        "SafeList",
        "Add",
        "Remove",
        "Contains",
        "Modify",
        "GetEnumerator",
        "IEnumerator",
        "GetEnumerator"
    ],
    "classes": [
        "SafeList"
    ]
}