{
    "identifiers": [
        "iTextSharp",
        "text",
        "iTextSharp",
        "tool",
        "xml",
        "css",
        "apply",
        "iTextSharp",
        "tool",
        "xml",
        "pipeline",
        "html",
        "iTextSharp",
        "tool",
        "xml",
        "html",
        "T",
        "ICssApplier",
        "T",
        "IElement",
        "T",
        "e",
        "Tag",
        "t",
        "IMarginMemory",
        "mm",
        "IPageSizeContainable",
        "psc",
        "HtmlPipelineContext",
        "ctx",
        "ICssApplier",
        "IElement",
        "e",
        "Tag",
        "t",
        "IMarginMemory",
        "mm",
        "IPageSizeContainable",
        "psc",
        "HtmlPipelineContext",
        "ctx",
        "e",
        "T",
        "ArgumentException",
        "Format",
        "T",
        "Name",
        "e",
        "GetType",
        "Name",
        "Apply",
        "T",
        "e",
        "t",
        "mm",
        "psc",
        "ctx"
    ],
    "literals": [
        "\"Expected element of type {0}, but was {1}\""
    ],
    "variables": [],
    "comments": [],
    "docstrings": [
        "* $Id: 5f52a20d34b0987f555d0c0a822af7f154336c40 $\n *\n * This file is part of the iText (R) project.\n * Copyright (c) 1998-2016 iText Group NV\n * Authors: Bruno Lowagie, Paulo Soares, et al.\n *\n * This program is free software; you can redistribute it and/or modify\n * it under the terms of the GNU Affero General Public License version 3\n * as published by the Free Software Foundation with the addition of the\n * following permission added to Section 15 as permitted in Section 7(a):\n * FOR ANY PART OF THE COVERED WORK IN WHICH THE COPYRIGHT IS OWNED BY\n * ITEXT GROUP. ITEXT GROUP DISCLAIMS THE WARRANTY OF NON INFRINGEMENT\n * OF THIRD PARTY RIGHTS\n *\n * This program is distributed in the hope that it will be useful, but\n * WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY\n * or FITNESS FOR A PARTICULAR PURPOSE.\n * See the GNU Affero General Public License for more details.\n * You should have received a copy of the GNU Affero General Public License\n * along with this program; if not, see http://www.gnu.org/licenses or write to\n * the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor,\n * Boston, MA, 02110-1301 USA, or download the license from the following URL:\n * http://itextpdf.com/terms-of-use/\n *\n * The interactive user interfaces in modified source and object code versions\n * of this program must display Appropriate Legal Notices, as required under\n * Section 5 of the GNU Affero General Public License.\n *\n * In accordance with Section 7(b) of the GNU Affero General Public License,\n * a covered work must retain the producer line in every PDF that is created\n * or manipulated using iText.\n *\n * You can be released from the requirements of the license by purchasing\n * a commercial license. Buying such a license is mandatory as soon as you\n * develop commercial activities involving the iText software without\n * disclosing the source code of your own applications.\n * These activities include: offering paid services to customers as an ASP,\n * serving PDFs on the fly in a web application, shipping iText with a closed\n * source product.\n *\n * For more information, please contact iText Software Corp. at this\n * address: sales@itextpdf.com",
        "* @param <T> the type of iText element that can be customized"
    ],
    "functions": [
        "T",
        "Apply",
        "IElement",
        "Apply"
    ],
    "classes": [
        "CssApplier"
    ]
}