namespace lesson_6
{
    internal static class Program
    {
        #region Task1

        /*
         * 1. Изменить программу вывода таблицы функции так,
         * чтобы можно было передавать функции типа double (double, double).
         * Продемонстрировать работу на функции с функцией a*x^2 и функцией a*sin(x).
         */

        #endregion

        #region Task2

        /*
         * 2. Модифицировать программу нахождения минимума функции так,
         * чтобы можно было передавать функцию в виде делегата.
         * а) Сделайте меню с различными функциями и предоставьте пользователю выбор,
         * для какой функции и на каком отрезке находить минимум.
         * б) Ипользуйте массив (или список) делегатов, в котором хранятся различные функции.
         * в) *Переделайте функцию Load, чтобы она возвращала массив считанных значений. Пусть она
         * возвращает минимум через параметр.
         */

        #endregion
        public static void Main(string[] args)
        {
            
        }
    }
}