// Введение в C#. Урок 2. Практическое задание 6.

// Для полного закрепления битовых масок, попытайтесь создать универсальную структуру
// расписания недели, к примеру, чтобы описать работу какого либо офиса.
// Явный пример - офис номер 1 работает со вторника до пятницы, офис номер 2 работает
// с понедельника до воскресенья и выведите его на экран консоли.

using System;

namespace exercize_2_6
{
    class Program
    {
        static void Main(string[] args)
        {
            // Для полного закрепления битовых масок, попытайтесь создать универсальную структуру
            // расписания недели, к примеру, чтобы описать работу какого либо офиса.
            // Явный пример - офис номер 1 работает со вторника до пятницы, офис номер 2 работает
            // с понедельника до воскресенья и выведите его на экран консоли.
        }
    }
}