{
    "identifiers": [
        "arr",
        "arr",
        "arr",
        "loc",
        "index",
        "randomIndex",
        "arr",
        "loc",
        "arr",
        "index"
    ],
    "literals": [
        "\"Be creative and make some art inspired by the words Blooming Heart and write about it\"",
        "\"What comes to mind when you think of your hand? Make some art and write about it\"",
        "\"When it comes to a calm mind, what do you think of? Be creative, make some art, and write about what that means to you.\"",
        "\"In your Art Journal, write about your superpowers, and create something that represents it\"",
        "\"What animal represents you? Write about it in your art journal and sketch an image of the animal\"",
        "\"In your art journal, think about what the phrase healing words means to you and draw something that represents it.\"",
        "\"Think about what your heart is wispering to you right now, and draw a picture about it in your Art Journal\"",
        "\"Draw a picture and write about what makes you unique\"",
        "\"Where do you want to improve in life, draw a picture and write about it.\"",
        "\"Draw a picture and write about the phrase I Feel Good in your Art Journal\"",
        "\"Write and make some art in your Art Journal reguarding the phrase, Through My Eyes\"",
        "\"Imagine having a secret garden, make some art on what it would look like and write about how that makes you feel\"",
        "\"When you hear the phrase, City Lights, What do you think of? Make some art and write about it\"",
        "\"When you hear the phrase, Desert Sunset, What do you think of? Make some art and write about it\"",
        "\"When you think about Ocean Weaves, what do you think of? Make art and write about how that makes you feel\"",
        "\"When you hear the phrase, Bursting Colors, What comes to mind? Make art and write about it in your journal.\"",
        "\"When you hear the phrase, Abstract Energy, what are you thinking of? Create abstract art in your journal to represent it, and write what meanings you get from the phrase.\"",
        "\"How does the phrase, Vibrant Blooms, represent a time in your life? Write about it and create art in your Art Journal that represents it.\"",
        "\"Write and create art in your art journal that represents the phrase, Timeless Elegance\"",
        "\"Create and write about the phrase, Neon Dreams, in your Art Journal\"",
        "\"Create a visual representation of Colorful Chaos in your Art Journal and write what that means to you.\"",
        "\"Think of the phrase, Fluid Emotions, write about it and create a visual representation of it in your Art Journal\"",
        "\"Create an art piece in your Art Journal that represents the phrase, Gradient Harmony, and write about it.\"",
        "\"Create an art piece in your Art Journal that represents the phrase, Splatter Fusion, and write about it.\"",
        "\"Create an art piece that represents what Meaningful Shaddows means to you and write about it.\"",
        "\"Create an art piece in your Art Journal with meditative strokes and write about what it represents to you and how it makes you feel.\"",
        "\"Create or color a Mandala and write about the experience.\"",
        "\"Create a Zentangle and write about it.\"",
        "\"The past, upbringing, what we’re born with, does this makeup who we are today, affect our present, who are you because of this? Write about it and create a visual representation of this.\"",
        "\"What effect has the bad had on the good in life, and how has that changed you as a person in how you go about the present? Write about it and create a visual representation of this.\"",
        "\"Write about your perspective on the representation of humanity and reflect on the thought of, What is the definition of, and what does it mean to be human? Write about it and create a visual representation of this\"",
        "\"What’s the culture you grew up in and how does that affect your principles, values, and the way you see yourself? Does your culture have an effect on who you are as a person? Write and create some art in your Art Journal about it.\"",
        "\"What are your hobbies? What do you like to do for fun? Write about it and create some art in your Art Journal.\"",
        "\"Think about the idea of commercialism -vs- creativity, analyze what you do in your spare time, what are you getting from it and how does the ideas of commercialism and creativity play a part in your life? Journal and make some art about it.\"",
        "\"What are your life goals? Journal and make some art about it.\"",
        "\"Design an art piece that has no meaning, symbolism or interpretation as non-objective art. Write about it.\"",
        "\"Write a summary of known family history and create a family tree. Write about family history and represent it with a sketch in your Art Journal\"",
        "\"Has something ever happened to you that you couldn’t explain? Describe the experience and an art representation of the event.\"",
        "\"Create a temporary sculpture from things you find in nature, take a picture of it and put it in your art journal, write about what making something that fades over time means to you. What beauty do you take from this?\"",
        "\"Write about a judgment call you made when it came to principles and morality and make a visual representation of that in your Art Journal.\"",
        "\"Contemplate and write about this question of, what is the me that is me? Am I the sum total of all my parts, and if so, if something is taken away from me like memory, would I still exist? Is there anything specifically within me that makes me up, or am I just everything that makes me? Is there any permanent state of me or am I always changing? Make some art in your Art Journal to represent your thoughts and write about it.\"",
        "\"Think about the question: Are you what consumes your time? Write about your thoughts and represent them in your Art Journal by creating some form of art.\"",
        "\"Think about the question: Are you your genetics? Write about your thoughts and represent them in your Art Journal by creating some form of art.\"",
        "\"Think about the question: Are you the sum of experiences? Write about your thoughts and represent them in your Art Journal by creating some form of art.\"",
        "\"Think about the questions: Are you your beliefs? How have your beliefs changed over time? How do you define yourself this way? Research in depth what your beliefs are and how they’re defined and reflect on what you identify with. Write about your thoughts and represent them in your Art Journal by creating some form of art.\"",
        "\"When a dog is cloned, they may have the same genetics and are raised the exact same way, but the cloned dog has a different personality, different things they’ve learned and so on from the original dog that was cloned. Reflect on this and make some art about it in your Art Journal.\"",
        "\"Think about the question: Are you what you do? Write about your thoughts and represent them in your Art Journal by creating some form of art.\"",
        "\"Do you follow a specific religion? If so, which one? Write about your spiritual journey in that religion and represent this journey in your Art Journal by creating some form of art.\"",
        "\"If you were given enough money to live comfortably without a need to work, how would you spend your time? Write about your thoughts on this, and make some art representing it in your Art Journal\"",
        "\"Describe your perfect day in this world where you don’t have to work, and represent this in your Art Journal by creating some form of art.\"",
        "\"Write about where you would go if you could go anywhere in the world, and represent this in your Art Journal by creating some form of art.\"",
        "\"Describe where your dream house would be and what it would be like living there, and represent this in your Art Journal by creating some form of art.\"",
        "\"If you could use any of your talents to help someone which talent would it be? Write about it, and represent this in your Art Journal by creating some form of art.\"",
        "\"What would your ideal life be like, write about it and how it would make you feel, what aspects would change and what would stay the same? Represent this in your Art Journal by creating some form of art.\"",
        "\"What activities/skills come naturally to you? Write about them, how they make you feel and represent this in your Art Journal by creating some form of art.\"",
        "\"In what ways have you spent time in nature this week? How does that make you feel?  Represent this in your Art Journal by creating some form of art.\"",
        "\"How have you changed in the last five years? Write about it, and represent this in your Art Journal by creating some form of art.\"",
        "\"How was your day? Write about it, and represent this in your Art Journal by creating some form of art.\"",
        "\"What makes you truly happy? Take some time to write about it, and represent this in your Art Journal by creating some form of art.\"",
        "\"If you could relive an experience, what would it be and why? Take some time to write about it, and represent this in your Art Journal by creating some form of art.\"",
        "\"What scares you? Write about it, and represent this in your Art Journal by creating some form of art.\"",
        "\"When are you most yourself? Write about it, and represent this in your Art Journal by creating some form of art.\"",
        "\"Who do you miss? What does it feel like to miss them? Write about it, and represent this in your Art Journal by creating some form of art.\"",
        "\"Write about your dream vacation in detail represent this in your Art Journal by creating some form of art.\"",
        "\"How has your hometown shaped the person you are today? Write about it and represent this in your Art Journal by creating some form of art.\"",
        "\"What do you value most in a friendship or relationship? Write about it and represent this in your Art Journal by creating some form of art.\"",
        "\"How do you manage stress? Is there room for improvement? Write about it and represent this in your Art Journal by creating some form of art.\"",
        "\"What would you do if you knew you couldn’t fail? Write about it and represent this in your Art Journal by creating some form of art.\"",
        "\"Describe your favorite place in the world. Write about it and represent this in your Art Journal by creating some form of art.\"",
        "\"Write a poem about your day and represent this in your Art Journal by creating some form of art.\"",
        "\"Describe the room you’re in and represent this in your Art Journal by creating some form of art.\"",
        "\"Draw something that’s in front of you and write a story about it in your Art Journal.\"",
        "\"Write about a time you were in a place or invironment that was unfamiliar to you, and create a visual representation of it in your Art Journal\"",
        "\"When do you feel most alive? Write about it and create a visual representation of it in your Art Journal\"",
        "\"Write a letter to your future self about your hopes for your future self and create a visual representation of it in your Art Journal\"",
        "\"Where do you want to see yourself 5 years from now? Write about it and create a visual representation of it in your Art Journal\"",
        "\"Write about your current morning routine, reflect on how you can benifit from doing morning journaling sessions, if that doesn't work for you, what's the best time of day for your journaling? Write about it and create a visual representation of it in your Art Journal\"",
        "\"Write a letter to your younger self and create a visual representation of it in your Art Journal\"",
        "\"Think about and write down 3 core values you aim to live by and create a visual representation of it in your Art Journal\"",
        "\"Think about and write down 3 core values you aim to live by and create a visual representation of it in your Art Journal\"",
        "\"What's the difference between being committed to something and being too strict on yourself? Write about it and create a visual representation of it in your Art Journal\"",
        "\"Describe something beautiful you saw today and create a visual representation of it in your Art Journal\"",
        "\"When you hear the word ‘gratitude’, what thoughts or images come to mind? Write about it and create a visual representation of it in your Art Journal\"",
        "\"Write about your most cherished childhood memory and create a visual representation of it in your Art Journal\"",
        "\"Write about someone in your life you’re grateful for and create a visual representation of that in your Art Journal\"",
        "\"How do you show your gratitude to your loved ones? Write about it and create a visual representation of that in your Art Journal\"",
        "\"Name some small things in your life that you’re grateful for and why. Write about it and create a visual representation of that in your Art Journal\"",
        "\"Think about one of your hardest moments in life...in what ways can you be grateful for it? Write about it and create a visual representation of that in your Art Journal\"",
        "\"If gratitude were a person, how would you describe this person? Write about it and create a visual representation of that in your Art Journal\"",
        "\"What are you grateful for today? Write about it and create a visual representation of that in your Art Journal\"",
        "\"Write down one thing you enjoy, one thing you want to be, and one thing you want to do and create a visual representation of that in your Art Journal\"",
        "\"What's one thing you've learned today? Write about it and create a visual representation of that in your Art Journal\"",
        "\"Write about your idea of a perfect life set at some point in the future, write about career, relationships, home, and feelings with as much detail as possible and create a visual representation of that in your Art Journal\"",
        "\"From your perspective today, write a letter to your younger self including your wisdom, lessons learned, and advice you would give to your younger self and create a visual representation of that in your Art Journal\"",
        "\"Think about your values as a compass to the life you want to live, write about it, ask yourself if these values are present in your day to day life, and create a visual representation of that in your Art Journal\"",
        "\"Write down 5 words that you think of when you think about yourself, circle 3 of them that speak to you, what messages need to be heard? Write about what that part of you wants to tell you. Create a visual representation of that in your Art Journal\"",
        "\"Write down the lyrics to your favorite song, how does this song speak to you? Create a visual representation of that in your Art Journal\"",
        "\"Do you have a favorite memory? Write about it and how this memory speaks to you. Create a visual representation of that in your Art Journal\"",
        "\"When you hear the word: Water, what do you think of? Write about it and create a visual representation of it in your Art Journal\"",
        "\"Create scribble art, just start scribbling a shape of something in front of you. Write about how it makes you feel and what you take from it.\""
    ],
    "variables": [
        "phraseArray"
    ],
    "comments": [
        "3",
        "4",
        "5",
        "6",
        "7",
        "8",
        "9",
        "10",
        "11",
        "12",
        "13",
        "14",
        "15",
        "16",
        "17",
        "18",
        "19",
        "20",
        "21",
        "22",
        "23",
        "24",
        "25",
        "26",
        "27",
        "28",
        "29",
        "30",
        "31",
        "32",
        "33",
        "34",
        "35",
        "36",
        "37",
        "38",
        "39",
        "40",
        "41",
        "42",
        "43",
        "44",
        "45",
        "46",
        "47",
        "48",
        "49",
        "50",
        "51",
        "52",
        "53",
        "54",
        "55",
        "56",
        "57",
        "58",
        "59",
        "60",
        "61",
        "62",
        "63",
        "64",
        "65",
        "66",
        "67",
        "68",
        "69",
        "70",
        "71",
        "72",
        "73",
        "74",
        "75",
        "76",
        "77",
        "78",
        "79",
        "80",
        "81",
        "82",
        "83",
        "84",
        "85",
        "86",
        "87",
        "88",
        "89",
        "90",
        "91",
        "92",
        "93",
        "94",
        "95",
        "96",
        "97\"",
        "98"
    ],
    "docstrings": [],
    "functions": [
        "randomIndex",
        "completeSentence"
    ],
    "classes": []
}