{
    "identifiers": [
        "$",
        "started",
        "nextSequence",
        "started",
        "started",
        "$",
        "started",
        "nextSequence",
        "started",
        "started",
        "$",
        "started",
        "$",
        "userClickedPattern",
        "userChosenColor",
        "animatePress",
        "userChosenColor",
        "playSound",
        "userChosenColor",
        "checkAnswer",
        "userClickedPattern",
        "buttonColors",
        "randomNumber",
        "gamePattern",
        "randomChosenColor",
        "$",
        "level",
        "setTimeout",
        "$",
        "gamePattern",
        "gamesQty",
        "playSound",
        "gamePattern",
        "gamesQty",
        "gamesQty",
        "gamesQty",
        "gamePattern",
        "myLoop",
        "myLoop",
        "level",
        "userClickedPattern",
        "$",
        "name",
        "Audio",
        "name",
        "audio",
        "Audio",
        "audio",
        "currentColor",
        "$",
        "currentColor",
        "setTimeout",
        "$",
        "currentColor",
        "level",
        "gamePattern",
        "userClickedPattern",
        "started",
        "currentLevel",
        "gamePattern",
        "currentLevel",
        "userClickedPattern",
        "currentLevel",
        "userClickedPattern",
        "gamePattern",
        "setTimeout",
        "nextSequence",
        "level",
        "$",
        "$",
        "level",
        "$",
        "setTimeout",
        "$",
        "gameOverSound",
        "startOver"
    ],
    "literals": [
        "\"red\"",
        "\"blue\"",
        "\"green\"",
        "\"yellow\"",
        "\"The game has already started!\"",
        "\"h1\"",
        "\"The game has already started!\"",
        "\".btn\"",
        "\"Game has not started yet. Keydown not detected.\"",
        "\"id\"",
        "\"#level-title\"",
        "\"Level \"",
        "\"#\"",
        "\"#level-reached\"",
        "\"\"",
        "\"./sounds/\"",
        "\".mp3\"",
        "\"./sounds/wrong.mp3\"",
        "\"#\"",
        "\"pressed\"",
        "\"#\"",
        "\"pressed\"",
        "\"success\"",
        "\"wrong\"",
        "\"#level-title\"",
        "\"Game Over, Press Here or Any Key to Restart.\"",
        "\"#level-reached\"",
        "\"Level Reached: \"",
        "\"body\"",
        "\"game-over\"",
        "\"body\"",
        "\"game-over\""
    ],
    "variables": [
        "level",
        "started",
        "userClickedPattern",
        "gamePattern",
        "buttonColors",
        "userChosenColor",
        "randomNumber",
        "randomChosenColor",
        "gamesQty",
        "audio",
        "audio"
    ],
    "comments": [
        "var level will help us to keep track of which level is the current player.",
        "var started will help us to know if the game already started, if false, the game has not started, if true, the game already started.",
        "var userClickedPattern array will keep track how what buttons the player already pushed.",
        "var gamePattern arrray will help us to keep track of what colors were generated randomly in nextSequence() function, this will help us 1st",
        "to keep track, 2nd to compare with var userClickedPattern and 3rd to repeat each of the stored colors everytime the user push correct buttons.",
        "var buttonColors are the colors of each button, that will help us to generate random selected colors.",
        "when a keydown is detected, the webpage will apply the following, first, the var started is false, so it will call nextSequence() function and apply started = !started, that means started will pass from false to true. If a keydown is again detected, the game  will remain the same because started is already true, so it will pass to the console \"The game has already started!\".",
        "when a button is clicked, it will check if the game has already started, if not, it will console.log \"Game has not started yet. Keydown not detected.\" If started = true, the game will execute the following, first get the color of the clicked button and store it in the var userClickedPattern, as said, to keep track of it. Then it will animate the click over the button and also play a sound, each of the colors have different sounds, so everytime it click a different color, it will reproduce their specific sound. And last, it will call the checkAnswer() fucntion, to verify if the user selected the correct color sequence, comparing var userClickedPattern and var gamePattern.",
        "The nextSequence() function is almost where all the magic happens, here, first, the function will generate a random number and it will help us to selected a random color inside var buttonColors array and store it inside the var gamePattern.",
        "The text of the webpage title will change to \"Level\" + level, the current number of var level is equal to 1, so it will show 1 once nextSequence() function is called.",
        "Then theres the var gamesQty, that will help us to run the next myLoop() function, inside our nextSequence() function. myLoop() function will help us to repeat every color that var gamePatterns has stored inside it, so it will remember the player what colors have already been called.",
        "Inside myLoop() we have a setTimeOut() function will help us to have a delay everytime a color is repeated to the user so it will be more easy to remember. Inside it, it will make every button stored in gamePattern to have a fadeout and reproduce their specific sounds, once executed, it will add +1 to var gamesQty, with the help of var gameQty it will be possible to select every index inside var gamePattern to repeat them.",
        "If the number stored in var gamesQty is less than the var gamePattern length, it will execute myLoop() again, this is very helpful to repeat every color stored inside var gamePattern, once the number of var gamesQty is equal or bigger than var gamePattern length, the function will stop.",
        "At the end, the nextSequence() function will add +1 to var level, increasing it by 1 everytime nextSequence() function is called, and resetting var userClickedPattern array to and empty array, this will help because we need the player to repeat all the colors everytime the the level change.",
        "The playSound() function will help us to reproduce a sound everytime the nextSequence() function generates a new random color and when the player click a button.",
        "Every time the user selects an incorrect color or fails the sequence, it will reproduce a wrong sound.",
        "This function changes the CSS of the clicked button.",
        "This function resets the game to original values.",
        "And our last function, the checkAnswer() function, first it will check and compare indexes between gamePattern and userClickedPattern using level as an input, if the last color generated by the game and the last color selected by the player are the same, it will console.log \"success\" but, thats not all, to call nextSequence() function (that is what keeps running our game), it also need to met another requirement, the userClickedPattern length MUST be exactly the same as gamePattern length, this is obviously because this means that the player repeated the same pattern as gamePattern stored colors.",
        "If none of the above requeriments is met, then else is where the player is heading, where it console.log \"wrong\", it shows in the webpage title that the game is over, also creating a flashing red background, reproducing the gameOverSound() function and calling startOver() function, that resets all the progress already made."
    ],
    "docstrings": [],
    "functions": [
        "nextSequence",
        "myLoop",
        "playSound",
        "gameOverSound",
        "animatePress",
        "startOver",
        "checkAnswer"
    ],
    "classes": []
}