//  string[,] table = new string[2,5];
 // table[0,0] table[0,1] table[0,2] table[0,3] table[0,4]
 // table[1,0] table[1,1] table[1,2] table[1,3] table[1,4]
 // String.Empty  - иницилизация строк 
 
 
//  table [1,2] = "слово";
//  for (int rows =0; rows<2; rows++ )
//  {
//     for (int columns = 0; columns<5; columns++)
//     {
//         Console.WriteLine($"-{table[rows, columns]}-");
//     }
//  }


// void PrintArray (int [,]matr)
// { 
//     for (int i =0 ; i<matr.GetLength(0); i++)
//     {
//         for (int j =0; j<matr.GetLength(1); j++)
//         {
//             Console.Write($"{matr[i,j]} ");
//         }
//     Console.WriteLine();
//     }
// }
// void FillArray (int [,] matr)
// {
//     for (int i =0 ; i<matr.GetLength(0); i++)
//     {
//         for (int j =0; j<matr.GetLength(1); j++)
//         {
//             matr[i,j]= new Random().Next(1,10);
//         }
//     }
// }
// int [,] matrix = new int [3,4];
// PrintArray (matrix);
// FillArray(matrix);
// Console.WriteLine();
// PrintArray (matrix);

//-----------------------------------------------------------------------------

//рекурсия - это метод вызова функций самой себя 

// int [,] pic = new [,]
// {
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0 },
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0 },
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0 },
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0 },
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0 },
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0 },
// {0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0 },
// {0, 0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0 },
// {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0 },
// };

// void PrintImage (int [,]image)
// { 
//     for (int i =0 ; i<image.GetLength(0); i++)
//     {
//         for (int j =0; j<image.GetLength(1); j++)
//         {
//             // Console.Write($"{image[i,j]} ");
//             if (image[i,j]==0) Console.Write(" ");
//             else Console.Write($"+");
//         }
//     Console.WriteLine();
//     }
// }

// void FillImage(int row, int col)
// {
//     if (pic[row,col]==0)
//     {
//         pic[row,col]=1;
//         FillImage(row-1, col);
//         FillImage(row, col-1);
//         FillImage(row+1, col);
//         FillImage(row, col+1);
//     }
// }
// PrintImage (pic);
// FillImage(13,13);
// PrintImage(pic);


//----------------------------------------------------------------

// double  Factorial (int n)
// {
//     if (n==1||n==0) return 1;
//     else return n * Factorial(n-1);

// }
// for (int i =0 ; i<40; i++)
// { 
//     Console.WriteLine($"{i}! = {Factorial(i)}");
// }

// ----------------------------------------------------------------

// Числа фибоначчи - это означает что каждое последующее число задается предыдущем 
// F(n) = F(n-1)+F(n-2)

double Fibonacci (int n) 
{
    if (n==1||n==2) return 1 ; 
    else return Fibonacci(n-1)+ Fibonacci(n-2) ;
}
for (int i =1; i<40; i++)
{
    Console.WriteLine($"{i} = {Fibonacci(i)}");
}