{
    "identifiers": [
        "numpy",
        "np",
        "pandas",
        "pd",
        "streamlit",
        "st",
        "pickle",
        "nltk",
        "open",
        "pickle",
        "load",
        "pickle_a",
        "regressor",
        "predict",
        "prediction",
        "st",
        "tilte",
        "st",
        "markdown",
        "html_temp",
        "unsafe_allow_html",
        "st",
        "text_input",
        "st",
        "text_input",
        "st",
        "button",
        "essay_score",
        "st",
        "success",
        "format",
        "result",
        "main"
    ],
    "literals": [
        "'bagofwords.pkl'",
        "'rb'",
        "\"Welcome to my webapp\"",
        "\"Automated Essay Scorer\"",
        "\"Prompt number\"",
        "\"Input your essay\"",
        "\"\"",
        "\"Predict Score\"",
        "\"The marks out of 5 is:{}\"",
        "\"__main__\""
    ],
    "variables": [
        "pickle_a",
        "regressor",
        "prediction",
        "html_temp",
        "prompt_number",
        "essay",
        "result",
        "result"
    ],
    "comments": [],
    "docstrings": [
        "\"\"\"\n    <h2 style=\"color:red\"> The essay to be written in 500 words only</h2>\n    <h2> Prompt 1</h2> \n    <h3> The tight curriculum of our education system leaves no room for imagination and creativity. Write a response that expresses your thoughts on this statement. \n    To what extent do you agree or disagree? Explain your reasoning.</h3>\n    <h2> Prompt 2</h2>\n    <h3> Our society is disrupted by the ever-widening gap between rich and poor. One percent of the worlds population controls half of all global wealth, while a quarter of the worlds population struggles to feed themselves daily.\n    Write a response describing the causes and consequences of this situation. What remedies might be effective?</h3>\n    <h2> Prompt 3</h2>\n    <h3>Has technology become a new addiction? Have we become slaves to our own creation? \n    Write a response that expresses your thoughts on this statement. To what extent do you agree or disagree? Explain your reasoning.</h3>\n    <h2> Prompt 4</h2>\n    <h3>In the nuclear age, the production and development of weaponry challenge the very existence of humankind. How useful are weapons? Do the benefits outweigh the risks? Write a response explaining the pros and cons of the arms race. Do the benefits outweigh the risks? Provide examples. Global superpowers wish to extend their influence over the entire world. Nuclear weaponry is key to this expansion.\n    Write a response explaining the pros and cons of the arms race. Do the benefits outweigh the risks? Provide examples.</h3>\n    \"\"\""
    ],
    "functions": [
        "welcome",
        "essay_score",
        "main"
    ],
    "classes": []
}