{
    "identifiers": [
        "saveFirstNumber",
        "num",
        "firstNum",
        "parseInt",
        "num",
        "saveSecondNumber",
        "num",
        "secondNum",
        "parseInt",
        "num",
        "add",
        "numA",
        "numB",
        "numA",
        "numB",
        "sum",
        "subtract",
        "numA",
        "numB",
        "numA",
        "numB",
        "difference",
        "multiply",
        "numA",
        "numB",
        "numA",
        "numB",
        "changeOperation",
        "chosenOperation",
        "operation",
        "chosenOperation",
        "operation",
        "putResultInElement",
        "operationResults",
        "operationResults",
        "equals",
        "operation",
        "putResultInElement",
        "add",
        "firstNum",
        "secondNum",
        "putResultInElement",
        "subtract",
        "firstNum",
        "secondNum",
        "multiply",
        "firstNum",
        "secondNum",
        "divide",
        "firstNum",
        "secondNum",
        "modulus",
        "firstNum",
        "secondNum"
    ],
    "literals": [
        "\"result\"",
        "\"Results: \"",
        "\"addition\"",
        "\"subtraction\"",
        "\"multiplication\"",
        "\"division\"",
        "\"modulus\"",
        "\"Choose an operation\""
    ],
    "variables": [
        "firstNum",
        "secondNum",
        "operation",
        "saveFirstNumber",
        "saveSecondNumber",
        "add",
        "sum",
        "subtract",
        "difference",
        "multiply",
        "divide",
        "modulus",
        "changeOperation",
        "putResultInElement",
        "equals"
    ],
    "comments": [
        "These variable hold the numbers we want to do operations on and the name of the operation we want to perform.",
        "They are expected to change so we use the \"let\" keyword.",
        "this function takes in the number you type in the input field and saves it to the \"firstNum\" variable",
        "this function takes in the number you type in the 2nd input field and saves it to the \"secondNum\" variable",
        "\"parseInt\" is a built in function in JS that converts a string/word into a number",
        "this function takes in two argument/numbers and returns the sum of them",
        "this function takes in two argument/numbers and returns the difference of them",
        "These variables are already defined but that don't point to functions. It's up to you to build the functions to complete your calculator use:",
        "Open up the inspector tool in Chrome and select the Console tab to see what this functions is \"logging out\" to the console.",
        "/ to get a quotient,",
        "and % to get a remainder.",
        "This function changes the \"operation\" variable to be equal to the \"id\" of the button we choose on the web page.",
        "Use your Chrome Inspector Tool > Console Tab to see the \"operation\" that's logged",
        "In order to show the user their results we have to access the DOM and stick in the value",
        "access the DOM by writing \"document\" then use the method \"getElementById\" and pass it the id, \"result\".",
        "Remember, each element has built in properties like \"innerHTML\" which we can change to anything we like.",
        "Here we give it a string: \"Results: \" and add the value of the operation to it.",
        "The function uses the value of \"operation\" variable to determine which operation function it should use on the number: add, subtract, multiply, divide, or modulus"
    ],
    "docstrings": [
        "* to get a product then return it"
    ],
    "functions": [],
    "classes": []
}