{
    "identifiers": [
        "options",
        "notification",
        "recipients",
        "payload"
    ],
    "literals": [
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "\"title-loc-key\"",
        "string",
        "\"title-loc-args\"",
        "string",
        "\"action-loc-key\"",
        "string",
        "\"loc-key\"",
        "string",
        "\"loc-args\"",
        "string",
        "\"launch-image\"",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string"
    ],
    "variables": [],
    "comments": [],
    "docstrings": [
        "* The filename of the provider token key (as supplied by Apple) to load from disk, or a Buffer/String containing the key data.",
        "* The ID of the key issued by Apple",
        "* ID of the team associated with the provider token key",
        "* Configuration for Provider Authentication Tokens. (Defaults to: null i.e. fallback to Certificates)",
        "* The filename of the connection certificate to load from disk, or a Buffer/String containing the certificate data. (Defaults to: `cert.pem`)",
        "* The filename of the connection key to load from disk, or a Buffer/String containing the key data. (Defaults to: `key.pem`)",
        "* An array of trusted certificates. Each element should contain either a filename to load, or a Buffer/String (in PEM format) to be used directly. If this is omitted several well known \"root\" CAs will be used. - You may need to use this as some environments don't include the CA used by Apple (entrust_2048).",
        "* File path for private key, certificate and CA certs in PFX or PKCS12 format, or a Buffer containing the PFX data. If supplied will always be used instead of certificate and key above.",
        "* The passphrase for the connection key, if required",
        "* Specifies which environment to connect to: Production (if true) or Sandbox - The hostname will be set automatically. (Defaults to NODE_ENV == \"production\", i.e. false unless the NODE_ENV environment variable is set accordingly)",
        "* Reject Unauthorized property to be passed through to tls.connect() (Defaults to `true`)",
        "* The maximum number of connection failures that will be tolerated before `apn` will \"terminate\". (Defaults to: 3)",
        "* This is main interface for sending notifications. Create a Notification object and pass it in, along with a single recipient or an array of them and node-apn will take care of the rest, delivering a copy of the notification to each recipient.\n\t * \n\t * A \"recipient\" is a String containing the hex-encoded device token.",
        "* Indicate to node-apn that it should close all open connections when the queue of pending notifications is fully drained. This will allow your application to terminate.",
        "* You can optionally pass in an object representing the payload, or configure properties on the returned object.",
        "* Required: The destination topic for the notification.",
        "* A UUID to identify the notification with APNS. If an id is not supplied, APNS will generate one automatically. If an error occurs the response will contain the id. This property populates the apns-id header.",
        "* The UNIX timestamp representing when the notification should expire. This does not contribute to the 2048 byte payload size limit. An expiry of 0 indicates that the notification expires immediately.",
        "* Provide one of the following values:\n\t * \n\t * - 10 - The push message is sent immediately. (Default)\n\t *   > The push notification must trigger an alert, sound, or badge on the device. It is an error use this priority for a push that contains only the content-available key.\n\t * - 5 - The push message is sent at a time that conserves power on the device receiving it.",
        "* This Object is JSON encoded and sent as the notification payload. When properties have been set on notification.aps (either directly or with convenience setters) these are added to the payload just before it is sent. If payload already contains an aps property it is replaced.",
        "* If supplied this payload will be encoded and transmitted as-is. The convenience setters will have no effect on the JSON output.",
        "* The value to specify for `payload.aps.badge`",
        "* The value to specify for `payload.aps.sound`",
        "* The value to specify for `payload.aps.alert` can be either a `String` or an `Object` as outlined by the payload documentation.",
        "* Setting this to true will specify \"content-available\" in the payload when it is compiled.",
        "*",
        "* The value to specify for the `mdm` field where applicable.",
        "* The value to specify for `payload.aps['url-args']`. This used for Safari Push NOtifications and should be an array of values in accordance with the Web Payload Documentation."
    ],
    "functions": [],
    "classes": [
        "Provider",
        "Notification"
    ]
}