import java.io.IOException;
import java.util.ArrayList;

public class FromFileSetProp {

    /* Sort file принемает данные искомых значений из класса Мануал сет проп
    Надо переработать все заново разбить на методы  и сократить колличество классов
    Подумать над новой структурой
    1) меню
    2) файлы приема данных в ручную и через файл надо объеденить и сделать ретерном
    3) подумать над структурой переменных и статических массивов и аррей листов (их колличество
    4) пересмотреть структуру классов
    */
    static ArrayList<String> ArraListSetPropFromFile = new ArrayList<>();



}