

# -*- coding: utf-8 -*-
"""
Created on Tue Aug 20 13:52:13 2019

@author: user1
"""

''''
股價
----------------
'ssp_free': ['日期','股票名稱','開盤價','最高價','最低價','收盤價','漲跌','成交筆數','成交金額(千)','成交量(股)']
        
'ssp_pay': ['日期','股票名稱','漲幅(%)','成交量','均張','均價']
   
     
'msp_free': ['股票代號','股票名稱','日期','開盤價','最高價','最低價','收盤價','漲跌','成交筆數','成交金額(千)','成交量(股)']
        
'msp_pay': ['股票代號','股票名稱','日期','漲幅(%)','成交量','均張','均價']

財務簡表
---------------        
'fis_free': ['年度', '年季','流動資產', '非流動資產', '資產總計', '流動負債', 
           '非流動負債', '負債總計', '權益總計', '公告每股淨值', 
           '營業收入(千)', '營業成本(千)', '營業毛利(千)', '營業費用(千)', 
           '營業利益(千)', '營業外收入及支出(千)', '稅前純益(千)', '所得稅(千)',
           '稅後純益歸屬(千)', '每股盈餘(元)']
        
'fis_pay': ['年度', '年季','營業活動現金流量(千)','投資活動現金流量(千)', '籌資活動現金流量(千)', 
           '本期現金及約當現金增減數(千)', '期末現金及約當現金餘額(千)','自由現金流量(千)']

營收狀況表
------------
'Revenue': []


'''