{
    "identifiers": [
        "sublime",
        "sublime_plugin",
        "os",
        "path",
        "subprocess",
        "os",
        "name",
        "subprocess",
        "STARTUPINFO",
        "startupinfo",
        "dwFlags",
        "subprocess",
        "STARTF_USESHOWWINDOW",
        "subprocess",
        "Popen",
        "_subl_path",
        "path",
        "startupinfo",
        "startupinfo",
        "sublime_plugin",
        "WindowCommand",
        "add_path",
        "get_current_path",
        "get_current_path",
        "path",
        "path",
        "folders",
        "active_view",
        "file_name",
        "os",
        "path",
        "dirname",
        "active_view",
        "file_name",
        "path",
        "sublime",
        "version",
        "project_data",
        "project_data",
        "get",
        "folders",
        "append",
        "path",
        "folders",
        "set_project_data",
        "project_data",
        "run_subl",
        "path"
    ],
    "literals": [
        "\"/home/tmartin/local/sublime_text_2_2221/sublime_text\"",
        "\"nt\"",
        "\"-a\"",
        "\"folders\"",
        "\"path\"",
        "\"folders\""
    ],
    "variables": [
        "_subl_path",
        "startupinfo",
        "startupinfo",
        "path",
        "project_data",
        "folders",
        "project_data"
    ],
    "comments": [
        "Related reading:",
        "https://stackoverflow.com/q/71255440/814803",
        "",
        "This plugin is based on a request made in the above stack overflow question",
        "for a method by which you can add the path of the current file to the side",
        "bar.",
        "",
        "This plugin will allow for that, and supports versions of Sublime Text all",
        "the way back to version 2 (which is the version the question asker uses). It",
        "defines a command that will examine the path of the currently active file and",
        "then, if it's not already open in the side bar, add it.",
        "",
        "To use this in Sublime Text 2, you need to adjust the value of the _subl_path",
        "variable to point to your Sublime Text 2 executable; for ST3 and above the",
        "plugin will use the native plugin API instead.",
        "",
        "To use the plugin from the context menu, create a file named",
        "Context.sublime-menu in your User package and give it the following content",
        "(or add the command to an existing file, if you have one).",
        "",
        "[",
        "{ \"caption\": \"-\", \"id\": \"file\" },",
        "{ \"command\": \"add_file_folder_to_side_bar\", \"caption\": \"Add Folder to Side Bar\",}",
        "]",
        "",
        "If you prefer a key binding, you can add one such as the following:",
        "",
        "{ \"keys\": [\"ctrl+alt+a\"], \"command\": \"add_file_folder_to_side_bar\"},",
        "This needs to point to the \"sublime_text\" executable for your platform; if",
        "you have the location for this in your PATH, this can just be the name of the",
        "executable; otherwise it needs to be a fully qualified path to the",
        "executable.",
        "",
        "Note that this is only required if you use Sublime Text 2. If you are using",
        "Sublime Text 3 or later, this will be ignored because the plugin API can do",
        "the work directly.",
        "Hide the console window on Windows; otherwise it will flash a window",
        "while the task runs.",
        "Get the path to the current file and add it to the window",
        "Get the project data out of the window, and then the list of",
        "folders out of the project data; either could be missing if this",
        "is the first project data/folders in this window.",
        "Add in a folder entry for the current file path and update the",
        "project information in the window; this will also update the",
        "project file on disk, if there is one.",
        "Run the Sublime executable and ask it to add this file."
    ],
    "docstrings": [
        "\"\"\"\n    Run the configured Sublime Text executable, asking it to add the path that\n    is provided to the side bar of the current window.\n\n    This is only needed for Sublime Text 2; newer versions of Sublime Text have\n    an enhanced API that can adjust the project contents directly.\n    \"\"\"",
        "\"\"\"\n    This command will add the path of the currently focused file in the window\n    to the side bar; the command will disable itself if the current file does\n    not have a name on disk, or if it's path is already open in the side bar.\n    \"\"\"",
        "\"\"\"\n        The command should only be enabled if the current file has a filename\n        on disk, and the path to that file isn't already in the list of folders\n        that are open in this window.\n        \"\"\"",
        "\"\"\"\n        Gather the path of the file that is currently focused in the window;\n        will return None if the current file doesn't have a name on disk yet.\n        \"\"\"",
        "\"\"\"\n        Add the provided path to the side bar of this window; if this is a\n        version of Sublime Text 3 or beyond, this will directly adjust the\n        contents of the project data to include the path. On Sublime Text 2 it\n        is required to execute the Sublime executable to ask it to adjust the\n        window's folder list.\n        \"\"\""
    ],
    "functions": [
        "run_subl",
        "run",
        "is_enabled",
        "get_current_path",
        "add_path"
    ],
    "classes": [
        "AddFileFolderToSideBarCommand"
    ]
}