{
    "identifiers": [
        "require",
        "OpenAI",
        "process",
        "base64Image",
        "openai",
        "base64Image",
        "chunk",
        "stream",
        "chunk",
        "temp",
        "temp",
        "listing",
        "temp",
        "listing"
    ],
    "literals": [
        "\"openai\"",
        "${process.env.OPENAI_API_KEY}",
        "\"gpt-4o\"",
        "\"user\"",
        "\"text\"",
        "I'll give you the information of the laundry symbols across a total of 95 rows below. Each row consists of three items and items are separated by a tab. Each item is \"laundry symbol's number\", \"laundry symbol's description\", and \"shape of the laundry symbol\". Now, please answer the laundry symbol number that best matches the image I provided to you. The provided image has washing symbols which are different from each other. If the provided image has multiple laundry symbols, please answer the \"laundry symbol's number\" of each of them.  If you're not sure of your answer, do not answer anything. Answer with only numbers and answer only one number per line. Never give unnecessary explanations. Don't say that you understand. \n1\tMachine dryable.\tA circle inscribed in a square\n2\tNot machine dryable.\tA circle inscribed in a square with an X mark overlaying it\n3\tMachine dry at low temperature.    A circle inscribed in a square with a dot at the center\n4\tMachine dry at medium temperature.\t  A circle inscribed in a square with two dots at the center\n5\tMachine dry at high temperature.\tA circle inscribed in a square with three dots at the center\n6\tDry in the shade.\tA square with two positive oblique lines at the top left corner\n7\tDry in the shade.\tA sun shaped symbol with multiple positive oblique lines at the top left corner\n8\tHang to dry.\tA vertically long bar inside a square\n9\tHang to dry in the shade.\t\tA vertically long bar inside a square with a positive oblique line at the top left corner\n10\tLay flat to dry.\t\tA horizontally long bar inside a square\n11\tLay flat to dry in the shade.\t\tA horizontally long bar inside a square with a positive oblique line at the top left corner\n12\tLine dry while wet.\tThree vertically long bars inside a square\n13\tHang to dry.\t\tA square with a downwardly convex curve at the upper corner\n14\tHang to dry in the shade.\t\tA square with a downwardly convex curve at the upper corner and two positive oblique lines at the top left corner\n15\tHang on a hanger to dry.\t\tA sun shaped symbol which written '옷걸이' at the center\n16\tHang on a hanger to dry in the shade.\tA sun shaped symbol which written '옷걸이' at the center and multiple positive oblique lines at the top left corner\n17\tLay flat to dry.\tA sun shaped symbol which written '뉘어서' at the center\n18\tLay flat to dry in the shade.\t\tA sun shaped symbol which written '뉘어서' at the center and multiple positive oblique lines at the top left corner\n19\tGently wring out.\tThree distorted circles attached together which written '약', '하', '게' inside each of them\n20\tDo not wring.\tThree distorted circles attached together with X mark overlaying it\n21\tMachine washable.\t\tA bowl shaped symbol which has a wavy line inside of it\n22\tHand wash.\tA bowl shaped symbol which has a wavy line and a hand-shaped symbol inside of it\n23\tWash gently.\tA bowl shaped symbol which has a wavy line inside of it and has a horizontal line below it\n24\tWash very gently.\tA bowl shaped symbol which has a wavy line inside of it and has two horizontal lines below it\n25\tNot machine washable.\t\tA bowl shaped symbol which has a wavy line inside of it and X mark overlaying it\n26\tWash at 30°C.\tA bowl shaped symbol which has a wavy line inside of it and written '30°' inside of it\n27\tWash gently at 30°C.\tA bowl shaped symbol which has a wavy line inside of it and written '30°' inside of it and has a horizontal line below it\n28\tWash at 40°C.\t\tA bowl shaped symbol which has a wavy line inside of it and written '40°' inside of it\n29\tWash at 50°C.\t\tA bowl shaped symbol which has a wavy line inside of it and written '50°' inside of it\n30\tWash at 60°C.\t\tA bowl shaped symbol which has a wavy line inside of it and written '60°' inside of it\n31\tWash at 70°C.\t\tA bowl shaped symbol which has a wavy line inside of it and written '70°' inside of it\n32\tWash at 80°C.\t\tA bowl shaped symbol which has a wavy line inside of it and written '80°' inside of it\n33\tWash at 90°C.\t\tA bowl shaped symbol which has a wavy line inside of it and written '90°' inside of it\n34\tWash at 95°C (Boil safe).\t\tA bowl shaped symbol which has a wavy line inside of it and written '95°' inside of it\n35\tWash at 30°C.\t\tA bowl shaped symbol which has a wavy line inside of it and has a dot in the center of it\n36\tWash at 40°C.\t\tA bowl shaped symbol which has a wavy line inside of it and has two dots in the center of it\n37\tWash at 50°C.\t\tA bowl shaped symbol which has a wavy line inside of it and has three dots in the center of it\n38\tWash at 60°C.\t\tA bowl shaped symbol which has a wavy line inside of it and has four dots in the center of it\n39\tWash at 70°C.\t\tA bowl shaped symbol which has a wavy line inside of it and has five dots in the center of it\n40\tWash at 95°C (Boil safe).\t\tA bowl shaped symbol which has a wavy line inside of it and has six dots in the center of it\n41\tHand wash.\t\tA bowl shaped symbol which has a wavy line inside of it and written '손세탁' on a wavy line\n42\tHand wash with a neutral detergent at a water temperature of 30˚C.\tA bowl shaped symbol which has a wavy line inside of it and written '손세탁' on a wavy line and written '30°C 중성' below a wavy line\n43\tWash at a water temperature of 30˚C.\t\tA rectangular which has a horizontal line at the top of it and written '30°C' at the center of it\n44\tWash gently at a water temperature of 30˚C.\tA rectangular which has a horizontal line at the top of it and written '약 30°C' at the center of it\n45\tWash gently with a neutral detergent at a water temperature of 30˚C.\tA rectangular which has a horizontal line at the top of it and written '약 30°C 중성' at the center of it\n46\tWash at a water temperature of 40˚C.\tA rectangular which has a horizontal line at the top of it and written '40°C' at the center of it\n47\tWash gently at a water temperature of 40˚C.\tA rectangular which has a horizontal line at the top of it and written '약 40°C' at the center of it\n48\tWash at a water temperature of 50˚C.\tA rectangular which has a horizontal line at the top of it and written '50°C' at the center of it\n49\tWash at a water temperature of 60˚C.\tA rectangular which has a horizontal line at the top of it and written '60°C' at the center of it\n50\tWash at a water temperature of 70˚C.\tA rectangular which has a horizontal line at the top of it and written '70°C' at the center of it\n51\tWash at a water temperature of 80˚C.\tA rectangular which has a horizontal line at the top of it and written '80°C' at the center of it\n52\tWash at a water temperature of 90˚C.\tA rectangular which has a horizontal line at the top of it and written '90°C' at the center of it\n53\tWash at a water temperature of 95˚C. (Can be boiled.)\tA rectangular which has a horizontal line at the top of it and written '95°C' at the center of it\n54\tIronable.\tA horizontal rectangle connected with \"a rotated L-shape that is flipped and rotated 90 degrees to the left\" at the top right corner\n55\tNon-ironable.\tA horizontal rectangle connected with \"a rotated L-shape that is flipped and rotated 90 degrees to the left\" at the top right corner and X mark overlaying it\n56\tSteam ironing is possible.\tA horizontal rectangle connected with \"a rotated L-shape that is flipped and rotated 90 degrees to the left\" at the top right corner and a positive oblique line and a negative oblique line at the bottom of the center\n57\tSteam ironing is not possible.\tA horizontal rectangle connected with \"a rotated L-shape that is flipped and rotated 90 degrees to the left\" at the top right corner and a positive oblique line and a negative oblique line at the bottom of the center and X mark overlaying it\n58\tIron at a maximum temperature of 100˚C.\tA horizontal rectangle connected with \"a rotated L-shape that is flipped and rotated 90 degrees to the left\" at the top right corner and a dot inside of it\n59\tIron at a maximum temperature of 150˚C.\tA horizontal rectangle connected with \"a rotated L-shape that is flipped and rotated 90 degrees to the left\" at the top right corner and two dots inside of it\n60\tIron at a maximum temperature of 200˚C.\tA horizontal rectangle connected with \"a rotated L-shape that is flipped and rotated 90 degrees to the left\" at the top right corner and three dots inside of it\n61\tIron at 80-120˚C.\tA horizontal rectangle connected with \"a rotated L-shape that is flipped and rotated 90 degrees to the left\" at the top right corner and written '80~120°C' inside of it\n62\tIron at 140-160˚C.\tA horizontal rectangle connected with \"a rotated L-shape that is flipped and rotated 90 degrees to the left\" at the top right corner and written '140~160°C' inside of it\n63\tIron at 180-210˚C.\tA horizontal rectangle connected with \"a rotated L-shape that is flipped and rotated 90 degrees to the left\" at the top right corner and written '180~210°C' inside of it\n64\tIron with a cloth over the fabric.\tA horizontal rectangle connected with \"a rotated L-shape that is flipped and rotated 90 degrees to the left\" at the top right corner and a wavy line below it\n65\tIron at 80-120˚C with a cloth over the fabric.\tA horizontal rectangle connected with \"a rotated L-shape that is flipped and rotated 90 degrees to the left\" at the top right corner and written '80~120°C' inside of it and a wavy line below it\n66\tIron at 140-160˚C with a cloth over the fabric.\tA horizontal rectangle connected with \"a rotated L-shape that is flipped and rotated 90 degrees to the left\" at the top right corner and written '140~160°C' inside of it and a wavy line below it\n67\tIron at 180-210˚C with a cloth over the fabric.\tA horizontal rectangle connected with \"a rotated L-shape that is flipped and rotated 90 degrees to the left\" at the top right corner and written '180~210°C' inside of it and a wavy line below it\n68\tDo not use bleach.\tA triangle with an X mark overlaying it\n69\tUse non-chlorine bleach.\tA triangle with two diagonal lines inside\n70\tUse chlorine bleach.\tA triangle with 'CL' written inside\n71\tAll bleaches can be used.\tA blank triangle\n72\tDo not use bleach.\tA triangle filled with black and an X mark overlaying it\n73\tUse oxygen bleach.\tA triangle with '산소 표백' written inside\n74\tDo not use oxygen bleach.\tA triangle with '산소 표백' inside and an X mark overlaying it\n75\tUse chlorine bleach.\tA triangle with '염소 표백' written inside\n76\tDo not use chlorine bleach.\tA triangle with '염소 표백' written inside and an X mark overlaying it\n77\tUse oxygen and chlorine bleaches.\tA triangle with '염소, 산소 표백' written inside\n78\tDo not use oxygen or chlorine bleaches.\tA triangle with '염소, 산소 표백' written inside and an X mark overlaying it\n79\tDry cleaning is possible.\tA blank circle.\n80\tDry clean at a low temperature.\tA circle with a negative oblique line at the bottom right corner.\n81\tDry clean in a short period of time.\tA circle with a positive oblique line at the bottom left corner.\n82\tDry clean with minimal moisture.\tA circle with a positive oblique line at the top left corner.\n83\tDry clean without steam.\tA circle with a negative oblique line at the top right corner.\n84\tDry cleaning is possible.\tA circle with a wavy line inside, and '드라이' written inside.\n85\tDry clean at a professional service.\tA circle with a wavy line inside, and '드라이' written inside, with a single line segment below the circle.\n86\tDry cleaning is not possible.\tA circle with a wavy line inside, and '드라이' written inside, with an X mark overlaying it.\n87\tDry clean with petroleum-based solvents.\tA circle with a wavy line inside, with '드라이' above the wavy line and '석유계' below the wavy line\n88\tDry clean with all solvents.\tA circle with an 'A' written inside.\n89\tDry clean with hydrocarbon solvents.\tA circle with an 'F' written inside.\n90\tDry clean with perchloroethylene solvent.\tA circle with a 'P' written inside.\n91\tDry cleaning is not possible.\tA circle with an X mark overlaying it.\n92\tWet cleaning is not possible.\tA circle filled with black and an X mark overlaying it.\n93\tWet cleaning is possible.\tA circle with a 'W' written inside.\n94\tWet clean gently.\tA circle with a 'W' written inside, and a single line segment below the circle.\n95\tWet cleaning is not possible.\tA circle with a 'W' written inside, with an X mark overlaying it.",
        "\"image_url\"",
        "data:image/jpeg;base64,${base64Image}",
        "\"low\"",
        "\"\"",
        "\"\"",
        "\"\\n\""
    ],
    "variables": [
        "OpenAI",
        "openai",
        "stream",
        "listing",
        "temp"
    ],
    "comments": [],
    "docstrings": [],
    "functions": [
        "LabelSearchAPI"
    ],
    "classes": []
}