#1
user_name = "матвей"
print(user_name)
#2
title = "Grade 1. Этап 1: Задание 1"
print(title)
#3
content = "Сегодня мы начнём работу над проектом, который продлится 8 модулей, каждый модуль будет состоять из 5 независимых практических заданий, и 6ого - результирующего, объединяющий предыдущие 5 в одну осмысленную программу. По итогу каждого модуля у Вас будет мини проект, имеющий практическое применение. И в конце, из 8 мини проектов, мы получим один большой проект."
print(content)
#4
status = "issue_date"
print(status)
#5
created_date = "10-1-2025"
print(created_date)
#6
issue_date = "10-2-2025"
print(issue_date)