import { z } from 'zod'


export const addTestimonialsValidation = z.object({
  nameUa: z
    .string()
    .nonempty('Поле повинно бути заповнене')
    .min(2, 'Текст має містити мінімум 2 символи')
    .max(25, 'Текст має містити максимум 25 символи'),
    nameEn: z
    .string()
    .nonempty('Поле повинно бути заповнене')
    .min(2, 'Текст має містити мінімум 2 символи')
    .max(25, 'Текст має містити максимум 25 символи'),
    messageUa: z
    .string()
    .nonempty('Поле повинно бути заповнене')
    .min(2, 'Текст має містити мінімум 2 символи')
    .max(350, 'Текст має містити максимум 350 символи'),
    messageEn: z
    .string()
    .nonempty('Поле повинно бути заповнене')
    .min(2, 'Текст має містити мінімум 2 символи')
    .max(350, 'Текст має містити максимум 350 символи'),
    color: z
    .string()
    .nonempty('Поле повинно бути заповнене')
    .min(2, 'Текст має містити мінімум 2 символи')
    .max(25, 'Текст має містити максимум 25 символи'),
})