{
    "identifiers": [],
    "literals": [
        "'第1章 你被开除了'",
        "' <p>　　“你被开除了。”</p><p>　　医务科长说这句话时，声音并不大，可到江寒耳朵里如同晴天霹雳一般，轰地一声，眼前一黑，差点站立不稳了。</p><p>　　脑袋乱哄哄的，连江寒自己都不知道是怎么走出办公室的。</p><p>　　本来，堂堂苏南医科大学的学生，被分配到这苏江市第八医院实习，已经十分不爽了，江寒本以为凭他的才能，在这里随便都能够混得风生水起，最后拿到写着漂亮评价的实习证明毕业，之后到省医院谋求一份不赖的职业，在自己的岗位上做出点不平凡的业绩，步步攀升……</p><p>　　可为什么，投注的美梦还不等享受就已经先醒了过来。</p><p>　　他只是来这个医院实习的学生，医院甚至都没有给他提供一个宿舍，硕大一个医院里，除了需要脱下一身白大褂，可笑他竟没有什么可以收拾带走的东西。</p><p>　　当他狠狠把手上白大褂摔在科室地板上的时候，就意味着他的实践课程已经结束了，实习彻底的不及格，这是对一个学生最严厉地惩罚，等同于给他判了死刑。</p><p>　　志比天高，江寒也只是最普通的大学生之一，在校期间的履历漂亮得令人惊叹，但眼下也不能够改变他实习不及格的现状，那些荣誉到底抵不过医务科长那一句“你被开除了”。</p><p>　　站在医院大门，他觉得门外是一片灰蒙蒙的世界，看不到接下来要走的方向，江寒停下了脚步，他回头看了一眼身后大楼上“为人民服务”，嘴角牵强的一扯。</p><p>　　“后悔吗？后悔吗？后悔吗？……”心中一个声音不断在重复。</p><p>　　苏医大学学生实习一般都是到省立医院，极少分配到市级医院，尤其是第八医院这种垫底的医院，更为特别的是，江寒在校期间学习成绩优异，各种荣誉不少，这种医科的学霸，竟然没有被重用，他自己都闹心了很久。</p><p>　　可这有什么办法，医科学生实习，门路很不好找，很多医院是不接收的，即便接受，别说没有实习工资这种东西，还需要给医院交不少票子。</p><p>　　这些江寒自然都有耳闻，但是他却没有像平常学生那般，按照规矩行事，他自信凭借自己的能力，能够有例外，只是实习通知拿在手中的时候，他才知道，可能他也只是所谓的“例外”之一，原来那只是他以为的例外，哪怕包括这次被开除，既是例外，却也是意料之中的事。</p><p>　　江寒家境贫寒，因为没有给医院足够的“诚意”，一个普通员工宿舍都没有他一席之地，他咬牙，并没有把情况跟父母说，而家里每月给他的生活费就刚好只够租房。</p><p>　　不管如何，饭还是要吃，迫于生计，他不得不找份工作，说到这个他还得再感谢一次老爸老妈，他对人天生便有一种难言的亲和力，因此谋到了一份工作，每天下班后负责几个科室的卫生。</p><p>　　因此江寒得以糊口，不至于活不下去。</p><p>　　前几天下班后在小儿科拖地，天色已经转暗，但灯还没亮起来，转过了一个角落，他发现昏暗的墙角，有个中年妇女抱着一个孩子在哭泣。</p><p>　　“阿姨，请问下有什么我能帮你的吗？”江寒停下手中的工作走到那妇女身边蹲下。</p><p>　　那妇女只是低声啜泣，一只手不住摸着眼泪。</p><p>　　被无视了，江寒却没有恼怒，继续柔声开口，“阿姨，有什么事你先说说看，说不定我能帮上些忙呢。”</p><p>　　闻言那妇女缓缓抬起头看向江寒，这个普通的小伙子，外表并不出众，但听到他说话的时候，她竟然有种安心的感觉，可能是因为绝望看的太多，一点点温暖都让她安心。</p><p>　　之后那妇女告诉江寒，她儿子患上了败血症，已经住了半个月院了，每天一千多的费用，她家里本就贫困，所有的积蓄早就耗尽，来到市里求医又没有什么朋友。</p><p>　　能够借钱的人已经走访了一遍，如今早已负债累累，由于欠了医药费，今天医院下了最后通牒，明天再不补上费用便要停药。</p><p>　　听到这里江寒有些恼怒，医者父母心，如此作为实在是不应该，因为小儿败血症一旦停药，如果复发，细菌产生耐药性，是十分麻烦的。</p><p>　　也许是同病相怜，江寒只身一人来到这里，没有什么亲朋好友，人情冷暖他这些日子也渐渐体会到，而身为一个医生，即便还只是个实习生，但对于病人，就不能置之不理。</p><p>　　他马上对这个小孩的病情进行深入了解，病案显示，小孩为粪肠球菌感染，经过细菌培养和药敏实验显示，该球菌最为敏感的药为庆大霉素，其次为万古霉素。</p><p>　　“奇怪了，庆大霉素只有几毛钱一支，怎么会要一千多一天呢？”手上拿着一份报告，江寒皱着眉头，这件事情怎么也说不通，没有理由的。</p><p>　　“其中肯定有蹊跷。”最后江寒放下了报告，下了定论。</p><p>　　为了弄清楚这件事情的猫腻江寒赶忙仔细查看了用药记录，发现医院用的是次选药万古霉素。</p><p>　　怎么会用万古霉素呢？难道是考虑庆大霉素的毒副作用？也不对呀？十岁的小孩完全可以耐受了，不会产生耳肾毒性呀？</p><p>　　“我明白了。”江寒离开了药房，走到一个诊室，那妇女抱着儿子坐在里面。</p><p>　　一看到江寒进来，那妇女很激动，连忙开口询问事情怎么样了，江寒看着妇女一笑，“李阿姨，不用担心，明天你八点之前来到这里就行了，带着所有的药单。”</p><p>　　妇女心中还是很不安，她不知道这样的一个年轻人能不能信任，但她没有了别的选择，只能相信老天开一回眼。</p><p>　　连声道谢，之后这妇女抱着儿子离开，诊室里又只剩下了江寒。</p><p>　　“哼，竟然做这种事情，不可原谅。”江寒重重哼了一声，把所有记录都拍了照，这才收拾离开。</p><p>　　有些事情他自然是知道的，当他看到万古霉素的时候，心中已经大概有数了。</p><p>　　万古霉素每一支单价要一百二十元，医生每开一支可拿三十元促销费，按照小孩的用量，一天六支，光回扣就有一百八十元，难怪主治医生舍不得换药，这相当于白得的钱，谁会嫌多。</p><p>　　第二天上班，江寒直接带着那对母子到了院领导办公室，向上反映此事，并陈列了所有证据，医院被迫为患者换了药，因为此事，小儿科主任和万古霉素的医药代表都免不了受到责罚，对江寒恨之入骨。</p><p>　　之后两人联合几个主任到院委会告了一状，说江寒目无领导，狂妄自大，挑起医患矛盾，院里对开除一个实习生这种小事，自然也不会追根究底，便同意了。</p><p>　　“难道我错了吗？”</p><p>　　“后悔吗？后悔吗？........”</p><p>　　“我不后悔!”江寒走出了医院大门。 </p>'",
        "'第2章 奇怪的老道人'",
        "'<p>　　漫无目的地走在大街上，江寒自己也不知道他该往哪走，楼房虽高，没有自己的家，街道繁华，但没有一处是自己的归宿。</p><p>　　抬头看去，路灯下是出双入对的影子，整个城市，好像只有江寒一个人是孤单的，心情本来就很低落，这时候又身处这样的环境下，他不免想的更多了些。</p><p>　　叹了口气，江寒干抹了一把脸，想要提起一点精神来，事实已经是这样了，而人总是要往前看的，只是想要看开一件事情，又哪有那么简单。</p><p>　　步履有几分蹒跚，江寒准备回到自己租的小屋，他是医科大学的高材生，心中很清楚，现在他这样的精神状态是什么事都干不了的。</p><p>　　在医院的工资肯定是拿不到了，江寒一掏口袋，货真价实的身无分文，晚饭在哪都还不知道，脸上满是苦涩，现实和理想总是有差距的。</p><p>　　他越是想要看开，想到的就越是绝望，这件事要是让家里人知道了，虽说公道在人心，他父母肯定会支持他的决定，但事实是，他实习不及格，大有可能多年的大学就白上了，拿不到学位证，一切都白费。</p><p>　　事情变成了这样，他怎么对得起含辛茹苦的二老，再者，以后自己又该怎么办？别说什么攻克疑难杂症的梦想，就连前途温饱都可能堪忧了。</p><p>　　一句不后悔，只是让良心走上了坦然大道，而现实中躯壳的路则要到了尽头，值不值得，应不应该，江寒迟疑了。</p><p>　　长叹了一口气，江寒听到耳边传来的流水声，原来不知不觉间，他已经走到了城中一条大河边，河面反射着灯光，看不到的地方黑暗一片。</p><p>　　“除了给爸妈增加负担，我活着还有什么用？”江寒心中压抑，竟然想到了寻短见，越想就越是觉得真是如此，只怕自己在这个世界上已经是个多余的人了，倒不如一死了之。</p><p>　　“你就这么想死吗？”一个声音突兀传入江寒耳中。</p><p>　　心里一惊，江寒回头一看，一个山羊胡子老道，手持一面白布幡上面写着“算命看相”，似乎是对他说话，可眼睛却明明没有看他。</p><p>　　“您是说我吗？”江寒转身走上前去。</p><p>　　“这里还有别人吗？”老道扭头给了江寒一个白眼。</p><p>　　江寒心中疑惑，觉得很奇怪，他只是刚刚生出一死了之的想法，马上就被人一语道出，打破了他的思绪，他此刻想起也是一阵后怕。</p><p>　　如果没有这老道士开口打断，他在那种思绪中出不来，现在可能真的已经付诸行动了，此刻清醒过来他是想给自己一巴掌，怎么会有那种无稽的想法，实在不该。</p><p>　　只是这老道，也未免太神了一点，难道这是一个有真才实学的奇人，江寒也只有这么想了，不然没法解释，他疑惑地打量着老道。</p><p>　　江寒漫无目的，如同丢了魂一般在在街上游荡，早被这老道看在眼里，老道看到了江寒的第一眼就觉得他有些不同，有种气质，无形中让人觉得亲近，便多看了几眼。</p><p>　　这一看，让老道瞬间来了精神，大喜过望，却没有声张，只是跟着他，走了一路，见江寒停下，他才开口说话。</p><p>　　老头没有说话，江寒也沉默了少顷。</p><p>　　“老先生，您叫我有事吗？”江寒有礼开口，一个素不相识的人他都能够出手相助，这怎么说也算是救他一命的人，他自然不会失礼。</p><p>　　“自然有事。”老道笑眯眯开口，不住点头，越看他越觉得顺眼。</p><p>　　这老道是个真有本事的人，看到江寒不凡的时候便已掐指给他来了一卦，事情原委他早了然于胸，那种情况下，江寒还能够这般待人，只能说他心地就是这般善良。</p><p>　　“老先生有事您就说吧，能帮忙的我不会推辞。”江寒没想到老道会这么直白应声，不过话已经出口，就没有收回来的道理。</p><p>　　“跪下磕头，老夫送你一场大造化。”老道开口，声音中全是傲然。</p><p>　　“啊？”江寒吃惊出声，以为自己听错了。“老先生，您，您说什么？”</p><p>　　老道摇摇头，一脸笑意，看上去心情很不错，“年轻人果然就是年轻，沉不住气，先别得意太早，这只是开始……”</p><p>　　“老先生，您别拿我寻开心了，要是没事我就先走了。”老道话没说完，江寒已经开口打断，他确信自己没听错，就没有必要听下去了。</p><p>　　这老道士说的，简直就跟电视剧看多了没区别，接下来的话他都能够脑补出来，那大造化无非就是十块钱的如来神掌或者葵花宝典什么的。</p><p>　　如果是平时的话，江寒到不介意慷慨解囊，不过现在他就算翻出裤兜也掏不出一块钱给他，这事他有心无力，只能抱歉离开。</p><p>　　“站住。”江寒说完转身要走，老道却一声大喝叫住了他。</p><p>　　慢慢绕到了江寒前面，背着手打量着他，“感情你把我当骗子了，是不是？”</p><p>　　心中或多或少就是这么想的，但是嘴上却是不能挑明的，太伤人，江寒一笑连忙摆手，“老先生您多虑了，我只是心情很不好，怕说下去影响到您的兴致，只能先走了。”</p><p>　　“少给我装蒜，别以为我不知道你小子在想什么，老夫这里没有什么如来神掌，只有现成巫医道的传承，你小子运气好，有了一点巫灵根，才能有资格接受这传承，别人想都不能想。”老道声音变了个腔调，江寒在他面前和透明的没什么区别，心中所想完全暴露无遗。</p><p>　　又是一惊，江寒对于老道这本事还是有些叹服的，不过他口中的话，他是绝对不会相信的，这再说下去就能成一部小说了。</p><p>　　“老先生，我真的没心情，抱歉，我要走了。”江寒一点也不把老道士说的放在心上，随便换个人也都不会相信，他实在没心情跟老道调笑。</p><p>　　“你这小子，这大造化连神仙都难求，你竟然不相信？你你你……你是要气死我啊。”老道吹胡子瞪眼，本来以为此事手到擒来，只要说出了这大造化，江寒不得马上高兴得跪地磕头。</p><p>　　但事实却并非如此，江寒竟然完全没有一丁点相信，这让老道感觉很奇怪。 </p>'",
        "'第3章 巫道传承'",
        "'<p>　　老道疑惑，江寒同样摇头，本来以为只是个找错人的骗子，可现在看来，明显就是来消遣他的，脑子多半有病，要是骗子还好点，随他怎么折腾，他现在身上是没有什么可骗的东西。</p><p>　　但要是一个脑子有病的人抓着他不放，或者就跟着他的话，江寒还真没有什么办法，总不能对一个老人家动拳脚吧。</p><p>　　这件事让他更揪心，祸不单行果然就不是说说而已，江寒现在正在思考要怎么处理，可这老道却不会静静等着他。</p><p>　　江寒心中想法尽数被老道洞悉，此刻老道被气得着实不轻，看着这个年轻人，他是想要一巴掌拍死他，又下不去手，也有些迟疑，正考虑要不要动用一点手段让他信服。</p><p>　　这老道本不简单，游荡在人群中已经不知道多久了，只是为了寻找一个适合的人，天知道他花了多长时间才找到了江寒，要是这么拍死就可惜了。</p><p>　　修行灵根数十万人都不一定能够找到一个拥有的，更别说这五行之外的巫灵根，更是举世难求，如今好不容易逮到一个，品行又上佳，各个方面都是上上之选，老道不想轻易错过了。</p><p>　　不过眼下问题是对方压根就不信，此刻想的是如何打发自己滚蛋，这就很尴尬了，若是动用一点手段的话，自然轻易就能够让他信服，不过那不是老道想要的结果。</p><p>　　越是站得高的人，就是越是明白世间事，强求最无果，缘之一字贯彻了一切。</p><p>　　“唉，罢了，老夫也不多说了，这东西你收下就是。”思来想去，想要一个人相信他说的，最直接的办法就是把这造化先送出去，看到了妙处之后，由不得他不相信。</p><p>　　想到便做了，老道把一块卷起来的兽皮递给了江寒，之后也不管他什么反应，自顾走回，拿起白幡，摇摇晃晃走开。</p><p>　　江寒看了一眼被塞到自己手中的兽皮卷，再抬头的时候哪里还看得到老道的踪迹，他整个人就像是凭空消失了一般。</p><p>　　他没有多想，现在天已经黑了，这里灯光又不是很亮，可能他走得比较快吧，没有往心里去，江寒把这事当成了一个小小的插曲，也好，他现在心情也比之前好多了。</p><p>　　把手中兽皮卷拿到了眼前，借着不大明亮的光，江寒解开了束缚住它的一根皮绳，把这兽皮卷展开来，上面空空如也。</p><p>　　“果然是来消遣我的。”江寒自语道，见前方有个垃圾桶，就要走过去把它扔了，可没成想刚一迈步他身体一个趔趄，整个人突然扑倒在地。</p><p>　　情急慌乱他伸手要撑住，但手中拿着兽皮卷在地上一滑，没能够撑住身体，他磕在了地上，砸得眼冒金星，爬起来的时候，鼻子更是鲜血直流。</p><p>　　身上没有带纸，江寒只能把那兽皮卷拿过来当纸先用，凑到了鼻子下面堵住了鲜血。</p><p>　　兽皮沾血，立马活了起来，一时间金光大盛，不过却是一闪而逝，江寒隐约间看到了一个不知道是什么怪兽的虚影，一晃之下钻入了自己眉心，他手中兽皮卷已经消失不见。</p><p>　　海量的信息涌入了他的脑中，就像是一个优盘插进他脑中，正在往里面导入数据一般，只是他的人脑的配置有些不够，承受不住这种信息的冲击，感受到了巨大的痛苦。</p><p>　　江寒抱着脑袋蹲在一旁，炸裂一般的疼痛，搜尽脑海他也没有能够找到能够匹配地病症，虽然不想承认，但这恐怕就是那消失的兽皮卷造成的。</p><p>　　已经没有多余的心思去分析，江寒头疼欲裂，渐渐连意识都已经有些不清晰，只觉得眼皮越来越重，他闭眼倒在了一旁。</p><p>　　“小样，竟敢想丢了老夫给的东西，这下知道厉害了吧？”隐身在一旁的老道见兽皮卷飞入江寒脑中，这传承就算是完成一小半了，偷偷地笑道。</p><p>　　说完老道随手一指，江寒消失在原地，之后他自己也不见了踪影。</p><p>　　“老子化盘古开天地，生阴阳而演五行。”</p><p>　　“天之道损其有余而补其不足，巫之道亦然，医之道亦然，巫医道亦然也。”</p><p>　　“巫道属于太上老君的道教传承分支，传承包括：巫术、医术、符箓、炼丹、修炼功法。”</p><p>　　“巫术包括祭祀和诅咒，可以吸收功德和信仰之力化为自己的法力。”</p><p>　　“医术主要是继承黄帝内经和黄帝外经，以及上古医法。”</p><p>　　“修炼功法为老子的太上洞玄诀和道德经。”</p><p>　　“巫、医相辅相成，修为高低直接决定巫、医境界。”</p><p>　　“……”</p><p>　　江寒失去了意识，但是这些相关的知识在不断地融入他脑中，跟他的记忆相结合，一切像是他本来就知道一般，一点没有突兀。</p><p>　　江寒发现自己变成了一个光点，此刻正游离在一个神秘的地方，这里没有光，但不影响视线，不过他看到的只是一片混沌，眼前只有一个完全被雾气遮掩的虚影，看不清是什么。</p><p>　　“给你超越凡人百倍的力量，你打算怎么用？”虚影中传来朦胧地声音，表达的意思却是很清楚。</p><p>　　“是问我吗？”江寒听到了这个声音，但他很疑惑。</p><p>　　半天没有回应，这里也看不到别的东西，江寒确定，多半就是问自己了，这个问题看似很简单，谁都想过如果有一天会飞，或者能够一拳打死牛什么的，要是有了这种力量，就可以怎么怎么样。</p><p>　　可若是真切往下一想，如果力量被放大了无数倍，那心底欲望就有了实现的可能，而人的欲望，无穷。</p><p>　　如何控制强大的力量，似乎比拥有力量更加困难，江寒沉思，之后开口：“不伤天害理的情况下，尽可能多的得到自己想要的一切。”</p><p>　　“很真诚，但你要记住，说过的话，就是许下的诺，都是债，若是没能做到，自有还债之日。”虚影中声音传来，“且问你，这巫道传承，你想不想要。”</p><p>　　“要了便从此走上一条与世人都不同的路，要了能得到很多，但失去的可能更多，要了你可能不再是你，要了你便是巫道中人，你，要还是不要？给你三息时间考虑。”</p><p>　　虚影中声音咄咄逼人，容不得江寒思索周全，必须要在三息，也就是五六秒之内做出决定，他心念电转，一时间想了超乎意料多的东西，最后他下了决定。 </p>'",
        "'第4章 苏雨歆'",
        "'<p>　　“要！”</p><p>　　江寒几乎没有多想，稍作权衡之后，直接答应了下来。</p><p>　　“却不是这么简单的，若是一年时间还没法入门，到时候你想要也不行，而且后果很严重。”虚影中声音传来。</p><p>　　“后果？”江寒疑惑，他没有想到，一般小说里遇到这种好事不是只有成功没有失败的吗，怎么到了自己这里就有严重后果了。</p><p>　　“巫道传承之人，只允许有一个存在，现在你已经符合了一半的要求，自然算是半个传承者，若是一年后无法入门，为了能够让巫道继续传承下去，只有一个办法，那就是你死。”虚影中传出的声音吗，江寒可不会当他开玩笑。</p><p>　　“我知道了。”江寒低声开口，即便如此，这巫道传承他也是志在必得，这种机缘，一旦错过了，一辈子不可能再有，关键现在他也没有说不要的资格，因为他现在已经是半个传承者，他回答要不要，实际上没有多大作用，他其实是没有选择的。</p><p>　　江寒不懂，但那虚影不会不懂，他看似是没有选择，可实际上他是有的，他可以选择接受，或者选择死亡，意义大不一样。</p><p>　　“妙在其中，不需多问。”听到了这个声音之后，江寒只感觉眼前非常刺眼，渐渐他什么都看不清，意识再次失去。</p><p>　　“喂，你没事吧？”一个悦耳女声在江寒耳旁响起。</p><p>　　江寒努力想把眼皮抬起，发现很沉，费了好大的力气才眯起了一条缝，眼神更是飘忽了好几次才聚焦，他看到了一个女生站在他前方不远处，弯腰正看着自己，但他视线模糊看不清楚。</p><p>　　脑袋还是有些发昏，不过已经不痛了，江寒抬起脸，轻轻摇摇头，把眼睛紧紧一闭，下一刻彻底睁开，看清楚了眼前的人。</p><p>　　“咦？”</p><p>　　“嗯？”</p><p>　　“怎么是你？”江寒和那女生同时惊奇，之后异口同声发问。</p><p>　　说完之后两人都一愣，都笑了起来。</p><p>　　这学期开学的时候，江寒在火车上看到一个女孩吃力的举着行李箱，想要放进行李架力气却稍有些不足，他伸手帮了她一把。</p><p>　　这本是稀松平常的举手之劳，江寒做完一笑，这一分神他到忘了刚刚才看到的座位号，低头看了一眼，发现这就是自己的座位。</p><p>　　抬头的时候发现那女孩子已经在一旁坐下了，“竟然这么巧？”江寒心理嘀咕，在那女孩旁边坐了下来，那女孩看到江寒坐下冲他甜甜一笑。</p><p>　　“好巧。”江寒身为一个大四的老油条，自然不会见到女生还发怵害羞，很自然地打了个招呼。</p><p>　　“刚才多谢了。”</p><p>　　旅途是很容易产生感情，两人一路少不了的就是交谈，江寒了解到这女孩跟自己是同一个校区，仅仅一墙之隔，不过她是刚去报到的新生，这么一来两人的话题就说不完了。</p><p>　　女孩告诉江寒，她叫苏雨歆，想要体验一次坐火车出远门，之后把她从出门到上车的艰辛都给江寒说了一遍，期间听得江寒好几次发笑。</p><p>　　不知道为什么，苏雨歆见到江寒第一眼的时候就感觉有种莫名的感觉，相处一段时间之后她发现那果然不是错觉，这个男生天生就有一种很特别的气质，让人一不小心就容易相信他。</p><p>　　几个小时的颠簸，苏雨歆第一次这么奔波，到底熬不住，上下眼皮开始打架，头一点一点，终于是睡着了，不知不觉间，她依在了江寒肩膀。</p><p>　　这活脱就是能上头条的经历，标题没准还是“丧心病狂！火车上趁新生睡着，学长竟然……”，点进去的正文江寒也自己脑补了，“学长竟然什么都没干。”一定是这样。</p><p>　　闻着淡淡的体香和清新的洗发水香味，看着女孩脸上雾状的绒毛，眼睛，鼻子，嘴巴搭配的恰到好处，还有领口处雪白的风景，江寒才算知道坐怀不乱的分量。</p><p>　　下车之后江寒带她到学校，陪着办完了所有手续，之后由于他马上要实习，生活很忙，和苏雨歆再无联系，没想到今天又遇到了。</p><p>　　“学长，你怎么了，发生了什么？”苏雨歆柔声开口，之前江寒低头坐在花坛边，她没能认出来，虽然想帮忙，却又不敢冒然接近。</p><p>　　“不小心跌倒了，没事。”对于发生的一切，江寒自然不会随便对人说起，这种大秘密，不用谁叮嘱他也知道不能传到别人耳中。</p><p>　　说完之后江寒挣扎着站起来，感觉脑袋有些重，稍微有些吃力，不过还不至于站不起来。</p><p>　　江寒站起来接近一米八的身高还是比苏雨歆高了一些，看着苏雨歆也很奇怪，“学妹你怎么会在这？”</p><p>　　“我家就在这边，我在这很正常呀。”苏雨歆俏皮一笑。</p><p>　　“啊，这样啊，我不知道你家在这边，不好意思。”江寒有些尴尬，接着神色一黯，是啊，别人家在这里，当然不奇怪，奇怪的是自己才对吧。</p><p>　　“没事，我也没给你说过，你不知道也很正常。”可能灯光不够亮，苏雨歆似乎没有发现江寒神色变化。</p><p>　　“走吧，学长，请你吃饭。”不等江寒回应，苏雨歆再次开口。</p><p>　　“那怎么行，我请……”江寒想都没想就一口回绝了，让学妹请吃饭，这可不行，太没面子了。</p><p>　　可想到空空如也的口袋，江寒底气不足让他说完后半句话，这种无力，非常烧心。</p><p>　　“来到我的地盘，当然是东家请客，学长莫非嫌弃啊？”苏雨歆一笑，把话说的很绝对，不容江寒拒绝。</p><p>　　从医院离开后江寒滴水粒米未进，漫无目的走了许久，现在已经是饥肠辘辘，很不争气地答应了，江寒紧紧握了握拳头，今天这种情况，一辈子都不想再经历。</p><p>　　苏雨歆带着江寒来到了一家中等装修，但氛围特别不错的饭店，点上了一桌子菜，苏雨歆告诉江寒，这些都是这家饭店超级好吃的菜品，一定要他全都尝尝。</p><p>　　陌生的城市，多少还是感受到了一点温馨，原来只要活着，总会有希望。 </p>'",
        "'第5章 引气入体'",
        "'<p>　　两人聊着，江寒提到了自己一些经历，包括实习和被开除的事情，苏雨歆并没有表现出什么，只是静静听着，吃完饭，两人离开了饭店。</p><p>　　时间已经不早，苏雨歆家中有门禁，分别之际，她从包里取出了一张银行卡递向江寒，“密码一会我发给你，别误会，借你，得还的。”</p><p>　　“这怎么行，我不能要。”江寒断然拒绝，君子不食嗟来之食，这种钱他饿死都不能要，可能没注意，刚才不就已经吃了……</p><p>　　“好了，就这样，我回去了，拜拜。”说完苏雨歆把银行卡硬塞给了江寒，自己快速转身离开。</p><p>　　紧紧攥着手中银行卡，“这钱我一分都不会动。”江寒很想大声咆哮，但最终只是暗暗下了一个决定，人活一世，为什么都这么难。</p><p>　　痛苦绝望时候的难过他体验过了，他再不想有那种经历，太痛苦了，可没有想到，这绝望中看到的希望，似乎比那痛苦更令人难以接受，更加不想再有这样的体验。</p><p>　　回到了自己租来小屋，江寒今天一天的经历，让他感觉到成长了不少，眼下他不是没有机会，相反，现在接受了所谓巫道传承，比一般人可是多了太大的优势，如果利用好了，有什么是不能实现的？</p><p>　　静下来心来，搜索着自己脑中的那些信息，江寒渐渐沉浸在了其中。</p><p>　　太上洞玄诀，第一篇章是引气入体，传闻老子化盘古，开天辟地，清浊二气升降，成了天地，而天地之间，同样还有气，此为灵气。</p><p>　　灵气并不是虚无缥缈的存在，就是寻常人有时候也能够感受到的，只不过他们不明白那是什么罢了，越是山灵泽秀的地方，灵气越是充沛，人们在大自然中往往会感到神清气爽就是因为灵气比较充沛。</p><p>　　这引气的修炼，实际上很简单，就是把天地之间的灵气用特殊的方法引进自己体内存起来，变为己用，但这是有条件的。</p><p>　　想要引气入体，需要先感受到灵气，而只有具备灵根的人才能够真切的感受到灵力存在，所以说白了，必须具备灵根才能够利用灵气修炼。</p><p>　　完成了引气入体的人，就能称为修士。</p><p>　　江寒也是今天才知道自己竟然具备这种条件，还是更为独特和稀有的巫灵根，具备了这种灵根，不但能够利用灵气修炼，还能够接受巫道传承，而这传承似乎非常了不起的样子。</p><p>　　感受灵气的方法在江寒脑中浮现，这一步不算很困难，只需要按照太上洞玄诀记载的方法，慢慢磨合，就像是给广播调频那样，配对成功了，就能够感受到灵气。</p><p>　　而接下来的步骤则要难了不少，把灵气引入体内，需要存在丹田之中，而一个初步开始修行的人，需要开辟丹田位置的气海，用来存储灵气。</p><p>　　引入的灵气是需要经过压缩的，最终存到丹田叫做灵力，灵力是使用法术，驾驭法宝等等一切手段的根本，对于修士来说，是重中之重。</p><p>　　按着功法记载，江寒开始感受游离在天地之间的灵气，起初他并没有感受到半点不同的地方，渐渐地江寒脑门开始出现汗珠。</p><p>　　功法中所言，第一步很简单才是，怎么到了自己这里却一直没法成功感受到那灵气了，这其中肯定有什么原因。</p><p>　　江寒睁开了眼，有种头晕的感觉，感受灵气的过程对于寻常人来说，也不是个轻松的事，心神消耗很大，现在江寒头晕便是因为如此。</p><p>　　稍微休息了一会，江寒再次开始了感受灵气的过程，按照功法上所说的，江寒这次更加细心和缓慢，不知道多久，他浑身都被汗水浸湿，心神消耗太大，注意力都很难集中起来，终于心中出现了一丝奇异的感觉。</p><p>　　感受到了灵气了，这个发现让江寒精神大震，这没法让他不激动，感受到了这灵气的存在，意义重大，说明脑中的这些信息很大可能全部都是真的，那他，真的可能成仙。</p><p>　　江寒一激动，心情马上不平静，刚才心底的那种感觉马上又消失了，心头一惊，他睁开了眼，此时的江寒没有办法平静，只有小说电影里存在的事发生在自己身上的时候，谁表现都不会好到哪去。</p><p>　　久久之后，江寒终于平定了心情，如此一来，所有的一切都有了实现的可能，医学上至今无法解决的疑难杂症，美好的未来生活，一切都不是问题。</p><p>　　看了一眼不远处放在桌上的银行卡和银行卡旁边的手机，显</p><p>　　示的还是一条短信提醒，自然就是苏雨歆给他发的银行卡密码。</p><p>　　无论如何，一切都建立在能够成功引气入体，这个道理江寒很清楚，理了理思绪，继续进入状态，有了之前一次成功的体验，再次进行顺利了很多，没费什么力气就再次感受到了灵气的存在。</p><p>　　越来越多，可这时候江寒有些疑惑，按照太上洞玄诀记载，只有这种程度灵气的话，算是最下乘的地方了，果然穷人居住的地方连灵气都要稀薄一些吗？</p><p>　　这么想着，江寒还是开始尝试把感受到的灵气引入自己体内，这个过程很难，但是必要的一步，想要成为修士，这一步必须要先迈出去。</p><p>　　一整夜的不断尝试，江寒终于还是成功了，那感觉好极了，他成功开辟了丹田气海，引入了压缩之后的灵力，从今日开始，江寒便算是一个修士了。</p><p>　　迈出了人生中全新的一大步，江寒精神大震，在成功完成引气之后他近乎耗尽的心神恢复如常，一宿没睡也没有一点困意。</p><p>　　不过除了丹田部位有点不同，他也并没有感受到自己身体有多大的变化，也不意外，这这是开启修炼的第一步，功法中也明确提到，引气入体之后便是炼气，开始炼气的修行才会改造修士的身体，甚至精气神。</p><p>　　修行讲究一步一个脚印，半点马虎不得，每一步都需要夯实基础，日后才不会有入魔的风险，贪功冒进只会后患无穷，前人经验，江寒铭记在心。</p><p>　　正要继续探究，桌上手机铃声响了起来。 </p>'",
        "'第6章 实习'",
        "'<p>　　思绪被打断，江寒正疑惑这个时候谁会给他打电话，想着他伸手拿过桌上手机，一看是一个陌生的来电，归属地却是苏江市，脸上疑惑更深。</p><p>　　在苏江市，自己貌似只认识一个苏雨歆，存过她的号码才是，那这又是谁？</p><p>　　江寒还是接通了电话，那头传来的是一个女声，听声音应该是个中年妇女，“喂，你好，请问是苏南医科大学江寒同学吗？”</p><p>　　“你好，我是江寒。”</p><p>　　“嗯，是这样，我们接到了相关通知，请你带好所需材料，今天中午十一点来省人民医院报道，下午就正式开始实习。”</p><p>　　“嗯，啊？什么？”江寒有些吃惊，不明白发生了什么，不可能是找错人了，刚才已经确认了身份。</p><p>　　“没听清楚吗？还是有什么困难？”</p><p>　　“没，没有，我一定准时到。”又惊又喜，江寒急忙回答，之后那边就挂断了电话。</p><p>　　手中握着手机，江寒有种不真实的感觉，这突如其来的好消息，可算是解决了他眼下所有的烦恼，这个让他产生了寻死念头的大事，就这么被解决了？</p><p>　　江寒决定到医院的时候一定要把这个事好好问一问，到底是什么情况，眼下他心中欢喜，关于修炼的事也没法集中注意力再去探寻。</p><p>　　一看时间已经是九点多，自己住的地方距离省人民医院不近，现在收拾一下就得跨出门了，江寒从床上下来，昨晚一夜没睡，身上衣服也没有脱。</p><p>　　这一站起来，他才发现，浑身都有种粘稠的感觉，和平时出汗不大一样，低头一看，身上全是一道一道的痕迹，像是墨水干在身上一般。</p><p>　　江寒取了一套干净衣服，提着洗澡的篮子就开门往公共浴室走去，不彻底清洗一番是没法出门的，得抓紧时间才行了。</p><p>　　这个时间点基本是没有什么人的，工作的都早已经出门，其它人也不会选择这个时间洗澡，不用排队，轻松就走进了浴室。</p><p>　　脱下衣服后江寒在镜子中看到了自己身上的状况，实在是污秽不堪，这些东西不可能是从外面沾上的，难道都是从体内排出来的？</p><p>　　此类修仙小说江寒也看过一些，修炼的第一步一般都是改造身体，要把一具身体改造得适合一名修士身份，简单说就是一步一步排出体内积攒的污秽。</p><p>　　这需要不短的时间，是一个循序渐进的过程，江寒自知现在的情况，应该是初步阶段，以后想来还会有这样的经历，这个时代的国人活到他这把年纪，天知道体内已经积攒了多少毒素。</p><p>　　想要全部排出的话，应该比功法中记载的要难一些，清洗完毕换上了干净衣服，江寒抓起桌上的手机和银行卡，锁好房门就急忙往楼道走去，得抓紧时间了。</p><p>　　可能是因为太着急的缘故，楼梯没有下几阶他脚下一个没踩实，整个人重心不稳立马就要摔下去，这一下要摔实了，没准直接要滚到底，一身伤怎么也免不了。</p><p>　　江寒来不及后悔应该慢些，下意识的想要平衡身体避免受伤，这个时候他在狭小的楼道内完成了一个不可思议的侧身旋转前空翻，之后整个人蹲在一阶楼梯上，而他只有两个脚尖着力，安稳如山。</p><p>　　“我擦勒，这么扯淡？”江寒下意识的举动把自己也吓了一条，这简直就像在做梦，他不明白为什么自己身体协调性突然这么好了。</p><p>　　想来应该是完成了引气入体的功劳，竟然还有这种功效，江寒激动之下把去医院报道一事都抛到了脑后，又尝试了几次，果然不是做梦，他的身体比以前强了太多，不光是气力，各种柔韧和协调性都是。</p><p>　　只能存在动作大片里那些高难度动作现在江寒可以轻松就做出，楼梯扶手上滑行，踏墙后空翻，左右横跳什么的，完全都不在话下。</p><p>　　花式下完楼梯，他才想起来为什么下楼，可怜身上没有一分钱，只能跑步前往医院报到，大学生涯里，作为一个学霸的江寒，几乎把所有时间都投身到了学业中，身体锻炼可就落下了很多。</p><p>　　而现在跑起步来，他竟然一点都没感觉到吃力，速度达到了他平时能够跑到的极限速度，甚至不能让他心跳加快，更没有半点喘息，他现在的心肺功能有多强，他没法估计。</p><p>　　保持着超高的移动速度，又能走一些汽车没法走的近道，江寒没有花多少时间就来到了医院，一看时间，还早到了半个小时。</p><p>　　放慢脚步，他缓缓走进了医院大门。</p><p>　　之前走出的也是这样的大门，现在再走进的，却不是昨天的地方，级别也不可相提并论，这是省内最好的医院，也是江寒梦寐以求的地方，他原本就是打算进入这里，实现理想，只是没想到会在这种情况下走进这里。</p><p>　　大厅咨询台询问了相关位置，江寒走进了一个实习生的接待室，所有来医院实习的学生，都会在这里办理所有的手续，离开的时候也需要来这里。</p><p>　　江寒敲门进去的时候里面并没有人，他找了个位置坐下，静静等待着通知他的人前来，闲来无事，他开始消化脑中那传承的各种信息。</p><p>　　里面内容可谓博大精深，但各种说法又很容易让人接受和理解，如果写成医书的话，这价值不可考量。</p><p>　　江寒沉浸在脑海知识中，丝毫没有察觉到时间的流逝，到了十一点十几分的时候，走进来了一个中年男子，看到江寒闭着眼，他也没有说话，拿起了桌上江寒带来的材料看了看。</p><p>　　江寒闭着眼看不到东西，但他能感觉到附近有人，立马睁开眼，看到了中年男子，他赶紧起身问好。</p><p>　　“你就是江寒同学吧，我看你在校读的是普外科，今天开始就到急诊外科实习，没有问题吧？”那中年男子放下了手中材料看着江寒。</p><p>　　“没有问题。”江寒果断回答，这是他的强项，通过实践学习，一定能够增强。</p><p>　　“没问题的话，就把你东西放到职工公寓，下午上班找陶主任报到，别迟到了。去吧。”说完那中年男子递给了江寒一把钥匙，上面贴着一个编号。</p><p>　　离开了那办公室，江寒再次来到咨询台询问了一些信息，之后离开了门诊大楼。 </p>'",
        "'第7章 接风'",
        "'<p>　　时间过得很快，转眼就到了下午，江寒按照规定提前来到了急诊科室，里面已经有两人，一人坐在办公桌后，是一个三十多岁的妇女，她板着脸，没有什么表情，江寒趁上班之前的空闲时间了解过，这人就是急诊科的主任，负责整个急诊科的全盘调度。</p><p>　　至于旁边一人，他就不知道身份了，想来也是这里领导吧，看到了江寒进来，陶主任抬头看了他一眼，知道他是来实习的，在校履历很漂亮，应该是名好学生。</p><p>　　“这是张主任，急诊科主治医生，既然来到了这里，就虚心跟着好好学，不要以为是实习就敷衍了事，急诊科责任重大，不分岗位，肩上甚至担负着生命，我希望你从第一天就能够重视这个问题。”没有多余的废话，陶蕾直接明说了要求。</p><p>　　“急诊科要求电话二十四小时开机，非休假时间能随叫随到，可能会有很多加班，如果接受不了，现在走还来得及。”</p><p>　　江寒听完之后肃然起敬，他现在算是明白了，这已经不是学校的实验室，更不是教室，而是真正的生命战场，而他有幸成为了这战场上的一名士兵。</p><p>　　这不就正是自己想要的吗？江寒内心欢喜，这才是他想要的实习，这才是能够实现自己价值的地方。</p><p>　　“我保证做到。”江寒回答斩钉截铁，面色从容严肃，这是他擅长的领域，这个岗位上，他一定能够出色的完成实训学习。</p><p>　　急诊科的门被打开，走进了一个年轻的男子，张主任看到他之后笑着说，“老周，又来了个你校友，你说怪不怪。”</p><p>　　刚进来那人闻言转脸看向江寒，这里一共就三个人，张天宇说的自然只能是这人了，咧嘴一笑，“学弟，你也是仰慕老哥威名才来到咱们急诊科的吧，懂，都懂，人格魅力。”</p><p>　　江寒闻言神色有些古怪，尴尬地笑了笑，“学长你也是苏南医科大学的？”</p><p>　　“没错，我就是周伟，你肯定听过我名头了，太响亮也是没有办法的事，好好干，我这有事就先走了。”说完周伟把一份材料放在了办公桌上就离开了科室。</p><p>　　“真是个奇怪的学长。”江寒心中嘀咕，不过他到觉得这学长挺有意思的。</p><p>　　正式上班的时间到了，这时候科室里有说有笑走进两人，他们看到江寒后和江寒看到他们时做出了同样的表情，那就是意外和一丝喜悦。</p><p>　　“江寒？你也来了这里，怎么都没听说，之前还有人传闻你……”</p><p>　　“别乱说，那些传言怎么能信，是吧，江大学霸。”男生话没说完，已经被旁边女生打断。</p><p>　　这两人都是江寒的同班同学，男的叫刘星，和他平日里关系还不错，女的来头就不小了，是昔日的时尚班花，就是这花名不大时尚，她叫杨梦娇。</p><p>　　江寒知道刘星说的是什么传闻，他尴尬的笑笑没有说话，总不能说不光是真的，还被那第八医院开除了吧，人人都有虚荣心，这种事，能避免他也不会想提起。</p><p>　　在学校的时候江寒跟这两人关系都不错，能在一起实习上班，那也是喜事一件，关键是他实习的难题得到了解决，他心情极好。</p><p>　　趁着换衣服的时机，他了解到刘星在急诊科消化内科，而杨梦娇则是在急诊科护理部，自己则是急诊外科。</p><p>　　一天时间在工作中很快逝去，江寒体验到了真正的生命战场是什么样子，跟之前那个医院的实习相比，简直有天壤之别，这里的工作一分钟都不能松懈。</p><p>　　到了下班时间，今天没有他们实习生的晚班，作为实习生，他们都自己的自觉，能够多学到东西才是正经的，所以都选择了自己加班。</p><p>　　晚上的时候急诊科人很少，流星说什么也要给江寒接风，江寒一开始是想拒绝的，口袋没有自己的半毛钱，实在尴尬，不过刘星盛情难却，他还是没拒绝。</p><p>　　出去吃饭这种事，怎么说也不能少了邀请领导，作为直系领导的周伟不必多言，另外一名值班副主任张天宇自然也是要邀请的，只是被他拒绝了，最后四名校友同去。</p><p>　　不能离医院太远，有事的话才能赶回来，四人年纪相差不是很大，随意地选择一家附近的大排档，点了菜，要了几瓶冰啤酒，几个校友很惬意的谈论着过往和医院的种种，氛围很融洽，无形中新来江寒和几人的一丝间隙也渐渐消失。</p><p>　　“我离开一下。”杨梦娇内急，不好意思一笑。</p><p>　　“第一个离开的，回来记得罚一杯。”众人自然知道她离开要去干嘛，只是起哄，杨梦娇拿着手包就走开了，露天的大排档，最近厕所也在几百米外。</p><p>　　几人继续喝酒，正在兴头上却听到了一声惊呼，江寒立马判断出，那是杨梦娇的声音，肯定发生了什么，他放下酒杯，“应该是梦娇，我去看看。”</p><p>　　一声惊呼几人也听到了，但隔得太远，他们没法像江寒一样判断声音的主人，此刻听闻江寒开口，他们自然也放下酒杯离开桌子。</p><p>　　“哎哎哎，没给钱呢。”摊主见几人都要走，赶紧阻拦。</p><p>　　“哎呀，真是麻烦，还会少你还是怎么了。”刘星被迫留下，跟那老板算账。</p><p>　　以江寒现在的速度，马上就赶到了现场，他看到几个人对着杨梦娇推推搡搡，爱美之心人皆有之，这班花也不是白叫的，再说，抛开这个江寒也不会看着一个女孩子在眼皮子底下被欺负。</p><p>　　话不多说，他选择先下手为强，直接跳起一脚踢开一人，他根本不知道现在自己的力量有多强，全力一脚竟然把那人踹飞老远落在了花坛中。</p><p>　　那几名小混混见有人坏自己好事，似乎没发现有一人已经被踹飞，同时要向江寒动手。</p><p>　　英雄救美，虽然烂俗，但这可是俘获芳心的不二法门，美女面前江寒动手，宛如一部动作大片，江寒脑中所有动作他想到都做了出来，出手几个瞬间就把一众小混混全部放倒在地。</p><p>　　看他们样子，受伤可是不轻，江寒震撼自己的力量，一旁目睹全部过程的杨梦娇更是吃惊，都忘了捡起掉在地上的手包。 </p>'",
        "'第8章 派出所'",
        "'<p>　　这个时候周伟也来到了江寒跟杨梦娇这边，看到满地乱滚的小混混，他看了看江寒和杨梦娇，两人都没什么事，这里发生了什么他没能看到。</p><p>　　“学弟，这是什么情况？”周伟震惊，难道江寒还有这种手段？</p><p>　　“一个不小心，就……”江寒摸了摸后脑勺，笑得很不自然。</p><p>　　闻言周围看热闹的人神情古怪，这种说法也太打击人了，从他离开座位到现在才过了一分钟不到，放倒了这么多人，还说一个不小心，那要是小心一点，是不是得把胳膊大腿全卸了。</p><p>　　江寒四人都是正经良好市民，知识分子，并不愿意和这些地痞流氓扯上什么关系，既然大家都没什么事，也没有打算报警，就要离开，而此刻警察却一反常态，不请自来。</p><p>　　一辆警车停在道旁，车门打开后下来了几名身穿制服的民警，带头一人直接走向了几人，“把打架伤人的带走。”</p><p>　　一声令下剩下几人走到江寒面前，面色不善地看着他，意思很明显如果不自己走，那他们就要动手。</p><p>　　“喂，你们讲不讲道理，明明是这些人为非作歹，凭什么抓好人。”杨梦娇上前几步，她有些愤怒，这些人民战士就是这般办事的吗？让人心寒。</p><p>　　“哼，受害者明明躺在地上，我们又不是瞎子，带走。”带头那人不由杨梦娇一行人多说，直接把江寒推上了警车。</p><p>　　江寒这个时候倒也没有冲动，虽说要对付这几个警察应该也不会比对付一般混混费力，不过这举动代表的可不是小事，拒捕还袭警，这罪名要是落实了，虽说国家没有独立为这罪名立法，不过绝对轻饶不了就是了。</p><p>　　看着江寒被警车带走，周伟几人非常气氛，不过这个时候他们也没有什么办法，只有掏出手机看看能不能找点什么关系帮江寒脱身，尤其是杨梦娇，这件事因为她而起，她倒是没有受到伤害，要是江寒却因此入狱的话，她良心难安。</p><p>　　“哼，我们大哥黑白两道都吃得死死的，这小子这回不死也得脱两层皮，你们不用费事了。”躺地上的小混混到现在还不知悔改，还在开口放狠话。</p><p>　　几人本就气愤，特别是刘星，身为刚入社会的年轻人，血气方刚，正愁没地方发火，这人在这个节骨眼上还敢这样，他过去就是一顿拳打脚踢，对方全部被江寒打伤，没有半点反抗余地。</p><p>　　坐在警车上，江寒思索着对策，如果这个时候破窗逃走，他们应该不会为了这种小事满世界调监控找自己才是，不过一想还是不妥，现在他不知道自己身体力量达到一种什么地步，不能冒险。</p><p>　　那就只能乖乖被带进警局了，怎么办，想来想去，他只能想到一个人，苏雨歆，经他的分析，自己能够到省人民医院实习，有百分之九十的可能就是因为她的关系，事先就只接触过她，别人可不会无端帮助自己。</p><p>　　如果她有这种手段，那多半现在也能够帮到自己，或者她身后的势力，处理这件事应该不会费什么力，眼下如果想要通过常规途径，他只能求助苏雨歆。</p><p>　　“警察同志，我能接个电话吗？”江寒心中叹气，现在也只能这么做了。</p><p>　　“可以，不过可别想耍什么花样，不然有你好果子吃。”坐在副驾驶位置的那人头也没转。</p><p>　　江寒侧着身体从口袋中掏出手机，但可不是接电话，而是悄悄拨通了苏雨歆电话，放在耳边，很快那头传来的动听的女声。</p><p>　　“学长，你，你竟然给我打电话？”苏雨歆接到电话一看是江寒的时候，她很是吃惊，认识了这么久了，还是他第一次主动联系，电话也好，短信QQ微信也罢，真正的第一次。</p><p>　　听到苏雨歆的话江寒也有点尴尬，这不就是传说中有事了才联系的“朋友”吗，一想是不应该，不过眼下哪是纠结这个的时候，江寒赶紧把自己位置和面临处境快速讲了一遍。</p><p>　　那边好一阵没有声音，江寒神色一黯，果然是让对方为难了吗，正要说句抱歉挂了电话，那边苏雨歆先开口了，“你别冲动，什么都听他们的就好，我知道你会被带去哪了，一会就到。”</p><p>　　挂了电话，江寒怎么想都觉得这事有点不对头，这警察来的也太赶巧了吧。</p><p>　　果然，到了派出所，两名民警直接把江寒带进了审讯室，中队长亲自上阵，毫不客气的对江寒进行审讯，但却根本不听他的辩解。</p><p>　　江寒从来没有经历过这种事，现在一时间也不知道怎么办才好，不过之前苏雨歆让他听他们的，此刻难道真要认这莫须有的罪名，江寒可是做不到。</p><p>　　大丈夫怎么活都要仰不愧天才是，江寒见辩解无用，索性不再开口，把中队长的所有言词都当成耳旁风。</p><p>　　这个时候中队长手机响起，中队长一拍桌子站了起来，“你不说话，是吧，别以为不说话就拿你没办法。”之后接通了电话。</p><p>　　此刻江寒忽然发现他印堂阴晦，脑中突然涌现一段相关信息，是巫术传承，而医道讲究望闻问切，这一传承竟然跟望气之术有几分相似，江寒根据这信息仔细推敲了一番。</p><p>　　这种面相可谓不善，显示他或者他至亲之人将有大灾，通过听他打电话，得知他儿子晚自习后即将放学回家，他因为要审讯，不能去接儿子，让他儿子自己回家。</p><p>　　通话时，江寒发现队长印堂居然带黑色了，这种情况的话，已经能够确定了，这一个电话引起他面相变化，那通电话之人便是应灾的人，这种事不能开玩笑，虽然不喜，但江寒还是好心开口。</p><p>　　“警察同志，今天不能让你儿子自己单独回家，必须在学校等你。”</p><p>　　江寒突然这样说，让中队长非常疑惑，好奇地问他为什么，不过这种事江寒总不能告诉他因为自己能够通过面相看出来吧。</p><p>　　不好解释，江寒只好说这是直觉，并告诉他自己的直觉从来没有错过。</p><p>　　中队长冷哼一声，自然以为江寒是为了脱身，故意忽悠，更加不客气了，加上审讯也得不到什么结果，直接把他关进了看守处。 </p>'",
        "'第9章 巫术'",
        "'<p>　　进入了看守处，江寒摇摇头，既然不听，他也没有什么办法，要怪的话，就只能怪自己没有足够让人信服的能力吧。</p><p>　　时间已经很晚，苏雨歆还没有来，这时却又有几个混混被带进了派出所，直接关进了看守处，江寒从这几人脸上看不到担忧的神色，心中对这件事有了一定判断。</p><p>　　这几人只怕是冲着自己来的，这件事果然很不公，害自己被抓了，暗中那人还不甘心，接着马上又派人来对付自己，也不知道自己是什么地方得罪了他。</p><p>　　这时候，之前江寒动手的大排档那里，来了一辆小车，后面跟着一辆金杯大面包，小车上的人下来，耸了耸肩膀，旁边花坛中钻出了一人，正是最开始被江寒踢飞的人。</p><p>　　“老大，那小子邪门，几下就把我们全放倒了，你要为我们做主啊。”那人哭诉，说的自己才是无辜一样。</p><p>　　“得了，你们也不是什么好东西，尽给我惹事，不过动了我的人，自然是要付出代价的，已经安排好了。”说完一挥手，金杯上下来两人，把地上躺着的全都搬进了车里，两辆车都离开。</p><p>　　派出所看守处，门口看守人员把几个混混管好，锁上了门，之后竟然离开了，这一切看在江寒眼中，心中冷笑，不用说这就是那混混们大哥安排进来的人，只是这官匪一家也太明显了。</p><p>　　所料半点不错，几个混混进来之后径直走向了江寒，为首的是一个光头，直接就准备动手收拾江寒，刚提起了拳头，江寒突然大喝一声“慢”。</p><p>　　光头一愣，嘴角露出了笑容，他还以为江寒是怕了，要求饶，他最享受的就是这种情景了。</p><p>　　“你晚上吃了野生菌，是不是？”江寒急声开口，神色严肃。</p><p>　　光头一惊：“你怎么知道的？”</p><p>　　“你现在马上进院抢救，否则有生命危险。”江寒没有多解释，直接扼明要点。</p><p>　　几名混混哈哈大笑，嘲讽江寒这玩笑开得跟真的一样，更夸张的是那光头，笑着直接倒在地上打滚。</p><p>　　见状几名混混笑得更欢了，这个时候江寒大喝：“你们还笑，好好看看他，他已经快不行了。”</p><p>　　众人闻声低头一瞥光头，他竟然口吐白沫，手脚开始抽搐，顿时大惊停下了笑声，对着外面大喊救命。</p><p>　　先不说这几名混混是有人安排进来的，就是一般真犯了点事的，警察也不能看着有人死在派出所，立马派车把光头送往了医院。</p><p>　　这个时候中队长接到了儿子的电话，那头传来的却不是儿子声音，一个女生告诉他，他儿子被车撞了，重伤，正在抢救，让他务必快点赶到医院。</p><p>　　手机掉在了地上，中队长听到这个消息心情凝重自然不用说，这个时候他心中还充满了懊悔，转身看向看守处，那年轻人刚刚还提醒他，很郑重地提醒了他。</p><p>　　如果当时听了的话，那现在……唉，长叹了一声，中队长急忙赶往医院。</p><p>　　刚刚送走一个突然发病的人，现在中队长又出了事，派出所一时间有点混乱，这个时候苏雨歆也来到了这里。</p><p>　　陪同他一起来的还有一个中年男子，驾车的也是他，门口的民警一看到这车牌照，立马端正的三分，客客气气迎接着苏雨歆两人进去。</p><p>　　不久，江寒顺利离开了派出所，坐在一辆商务车上，正往他实习的医院行去，他心中满是疑惑，看向苏雨歆，只是还不待他开口，苏雨歆先做了一个噤声的动作，他只能强忍着疑惑。</p><p>　　不一会汽车来到了医院门口，江寒下车跟苏雨歆告别，一路上他们一句话都没有说。</p><p>　　周伟从窗口看到了江寒下车，带着急诊科几人喜出望外走出来的时候车已经开走，看着牌照，周伟眉头微微一皱，有几分思索之色。</p><p>　　这是政府的二号车啊，江寒怎么会从这车上下来呢，他跟苏江市二把手也有关系？这事瞒不住，很快就在急诊科传开了，大家对江寒多了种别的目光。</p><p>　　一场风波就算是这么过去了，江寒回到了自己宿舍，这宿舍地方不大，但该有的东西基本都齐全了，因为是医院提供，卫生自然不用多虑。</p><p>　　奔波了一整天，江寒甚至没有来得及探索一下获得的巫道传承，竟然就这么睡了过去。</p><p>　　次日午休时间，两名主任都还没有到办公室，刘星则是接到了一名腹痛厉害的病人，实习的江寒自然也在一旁，这病人看上去十分痛苦，全身直冒冷汗，脸色苍白得没有一点血色。</p><p>　　急诊内科初步诊断为胃溃疡，刘星为了尽快减轻病人受到的痛苦，立刻给他注射了6542，并开了处方，主要是一些碱性药应急，用来中和胃酸，防止胃穿孔，若还不行，只有等主任来了再详细定夺。</p><p>　　只是一针下去，并没有起到多大作用，药也不是仙丹，就算是马上服下到发挥作用也需要时间，更何况这病人一副不行的样子，牙咬得死死的，怎么可能吃药。</p><p>　　江寒看着这病人，只觉得好像眼中能够看到一些平时看不到的东西，不知为何他马上确定，这可能不是胃痛，上前一步，江寒弯腰仔细询问病人，发现他有“钻顶样”疼痛，加上冷汗不止，呕吐物也并非酸水，而是苦水，是了，应该错不了，就是胆道蛔虫。</p><p>　　成人胆道蛔虫是十分罕见的，江寒眼中看到的那景象这时候清晰了，他发现病人少阳胆经阻塞，结合脑中传承和多年学习积累的知识，胆道蛔虫无疑。</p><p>　　确定了病状，就能对症下药，黄帝内经对这疾病的治疗，居然是酸梅汤，脑中原文：虫遇酸乃伏，遇辛乃退。</p><p>　　脑中传承的东西绝对可信，江寒不会怀疑，而刘星开的药以碱性为主和治疗原理正好相反，要是真的服下，必将引起更严重的后果。</p><p>　　“这是外科病，属于腹外科范畴，马上送到我们急诊外科来吧，刘医生的药也先不用拿了。”人命最大，不能放任不管，江寒急忙开口。 </p>'",
        "'第10章 胆道蛔虫'",
        "'<p>　　刘星当然愿意，现在本是中午休息时间，如果能够避开，谁愿意招呼这大吵大闹的病人。</p><p>　　急诊外科众人见这个实习生居然把这么个麻烦揽在自己身上，不解的同时也有些不快，这种白白自找麻烦的事，他们是不愿意接受。</p><p>　　病人送到了外科，转移病人的时间江寒已经买来了两包无糖的酸梅汤，一包重庆火锅底料，回到科室之后立马打开混在一起调开，满满一大杯。</p><p>　　“你快喝下这个。”江寒端着那一大杯饮料走到病人面前。</p><p>　　这病人还没有反应，倒是吓了跟来的刘星一跳，“哎哟我的大学霸，你这是唱哪出啊？”</p><p>　　这病人已经被初步诊断为胃溃疡，胃溃疡主要是胃酸过多引起，必须马上用小苏打一类的碱性药中和胃酸，而江寒的酸梅汤加上麻辣火锅，对于这种病无异于火上浇油，喝下去多半要引起胃穿孔，后果更严重。</p><p>　　这里有也不少经验老道的医生，知道江寒只是来实习的，毕竟经验和学识都太少，马上站出来阻止，医院中可不是理论课，不能乱来，后果需要他们也一同承担的。</p><p>　　江寒并不退缩，选择相信自己脑中传承，中医是老祖宗无数年的心血结晶，其博大精深的程度，怎么说都是西医无法企及万一的，只是现在这个时代，因为某段时期破坏太严重，真正精髓的东西都毁了，数千年传承没有留下多少。</p><p>　　真正有本事的老前辈又不断辞世，根本来不及培养自己的接班人，加上现在天地环境之下，中医术需要的很多药物早就无处可寻，又有小人打着幌子招摇撞骗，没落也是没有办法的事。</p><p>　　但如果谁要说中医术本身不行，那绝对是在扯犊子，无数前贤用几千年来完善的东西，是最珍贵的人类智慧结晶，江寒有幸得到近乎完整甚至超越这个世界医术极限的巫医道传承，他自然不会退缩。</p><p>　　这个时候，有老医生不顾大庭广众之下严声责骂江寒不知死活，只是江寒并不为所动，比起救治病人，他受些责骂和怀疑，又有什么关系。</p><p>　　这种地步江寒都不退让半步，这病人看着递到了眼前的“饮料”，又看了江寒一眼，江寒对他一笑，这病人莫名心中一安，他选择相信江寒。</p><p>　　强忍着痛苦，他抓过江寒手中“饮料”，不管到底有多美味，一口气喝了个精光。</p><p>　　“天，真的喝下去了。”旁边有人惊讶。</p><p>　　“完了，要出大事了，唉，年轻人，刚来就闯祸。”</p><p>　　然而事实更是让所有人惊掉了眼球，这病人不断哈气，只怕是火锅料太辣，但比起之前已经是好了很多，不到两分钟的时间，这病人一喜，不顾口舌的辛辣，笑了起来，肚子已经真的不疼了。</p><p>　　这病人看着江寒刚要说话，但此刻江寒摆摆手，按照脑中医术，运起了一丝灵力，在病人右上腹日月、期门两处揉按了一会。</p><p>　　病人体内发生着常人看不到的变化，胆道收缩，蛔虫被排出了胆道进入小肠，最麻烦的问题解决了，病人很快就能痊愈，连声称赞和道谢中，病人交费离开了医院。</p><p>　　病人是离开了，不过剩下江寒被四周惊诧的目光淹没，面对同事异样的眼光，江寒只是一笑，并没有多说什么，从此酸辣汤治胃疼的事却在这医院流传开了，只是到底没有一个人敢效仿。</p><p>　　两名主任上班的时候也听到了这个消息，自然震动，叫来了江寒询问，当江寒提起胆道蛔虫的时候，两人都明悟了，他们暗中对江寒的评价却是高了几分。</p><p>　　快到了下班时间，江寒找到了陶蕾，他现在实习的问题是解决了，不过生计上的难题还在，打工赚钱仍然是有必要的，当他跟陶蕾讲明的时候，主任也没多说什么，安排他到住院部打扫卫生，嘱咐他不能耽误了正经工作。</p><p>　　对于江寒来说，这是大好地消息，现在所有问题都解决了，他心情大好。</p><p>　　对于江寒来说，他只是做自己该做和必须要做的事情，但对于同事们来说，就不是这么回事了，江寒是一个实习生，但跟市里二号人物有关，却又需要打工来赚生活费。</p><p>　　这种事发生在一个人身上，谁都会被关注，有好事的人稍微查看了下他的履历，发现一个更耐人寻味的事，江寒竟然是被苏江市第八医院开除了，才到的这里，大家看江寒，倒是多了一层神秘面纱。</p><p>　　通过对传承的研究，江寒越发震惊，就目前他能够接触到的那些知识而言，已经堪称惊世，如果发表成医学论文，必将震惊世界医学界，这是他没有想到过的。</p><p>　　这种事不能声张，不然等待他的可能不是什么荣誉，而是切片研究，在修为没有强大到一定程度的时候，这种秘密谁也不能说。</p><p>　　另外就是修行了，除了医术，这传承主要还是需要提升修为，达到相应的境界才能了解更多的知识，才能施展更多的手段，最终可能成仙。这是谁都无法漠视的造化，江寒一样眼馋。</p><p>　　不管怎么说，这回是赚大了，这种传承，说什么都不能丢了，自己必须要通过考验，获得完整地传承资格，就这样，他的实习生活也算是步入了正轨。</p><p>　　负责了住院部的卫生，江寒每天下班都有工作要做，没过了多久，他也认识了几个保洁的阿姨，这天正好其中一个有事不能来，让江寒代班。</p><p>　　这个阿姨负责的房间其中一个是医院豪华病房，因为第一医院的特殊性，这种病房可不是有点钱就能住进去的，对于这种病房的卫生也需要格外上心才行。</p><p>　　推开了其中一个病室房门，江寒轻轻走进了这个病室，里面地面干净，桌面整洁，垃圾桶里只放着一些废纸，这样的房间实际上根本就不需要打扫，不过医院的规定不能不完全弄一遍。</p><p>　　江寒手拿抹布轻轻擦拭桌面，把花瓶中水也换了新的，整理了下窗帘，弯腰要收拾垃圾桶的时候发现内室病床上的病人向他轻轻招了招手。</p><p>　　江寒走过去，病人是一个中年妇女，虽然有疾在身，但不影响她的气质，这些日子江寒对巫术多了些了解，面相之术也稍微有了点心得，能够看出她的不凡。</p><p>　　照顾她的人暂时不在，她又有些口渴，正好看到江寒就招呼他帮忙倒杯水，江寒很有医者的心，一点也不觉得麻烦，小心把水递过去，发现这妇女好像眼神不大好使，差点碰洒了。 </p>'",
        "'第11章 省长夫人'",
        "'<p>　　江寒稍微有些诧异，怎么看这妇人眼睛有神，怎么看都不像是有疾的样子，莫非？</p><p>　　想着江寒运用所掌握的知识和之前那种因传承巫医道而获得的特殊眼力，仔细重新看了看这妇女，发现她上身有点偏胖，秀气的玉足伸在外面，几个暗疮有点醒目，上眼皮下垂得厉害。</p><p>　　难道是糖尿病引发的并发症？</p><p>　　“阿姨，您眼睛，是因为糖尿病吗？”江寒稳住了水杯，停滞了一下，之后才送到了妇女手中，轻声开口询问。</p><p>　　妇女惊疑，这第一医院这么强吗，一个搞保洁的都能轻易看出这种事，不免有些好奇，她发现这个年轻人给他感觉很好，莫名的，没有什么根据和原因。</p><p>　　妇女告诉江寒，她昨天夜里糖尿病发病，这次更是伴随着并发症，折磨得她几乎双目失明，到现在也没有好转多少。</p><p>　　江寒一听，稍加思索心中已经有数，像这些稍微上了点年纪的人，如果患有这么重的糖尿病的话，平日生活肯定还有其它烦恼，难眠，失眠，精神衰弱基本都是跑不了的。</p><p>　　具体根治的办法，他脑中偶尔瞥见过，但他还没有掌握，不过治标的方法到是现成，“阿姨，我学过专业的中医按摩，如果您放心的话，我给你稍微试试，应该有助于您的睡眠。”</p><p>　　“我这把老骨头，也没什么多的可以指望了，就试试吧。”妇女看着江寒，答应了，自己这把年纪了，这年轻人总不会想着占便宜，而且，也没人敢对她这乱来。</p><p>　　扶妇女坐好，江寒调动体内不多的一丝灵力，加上正宗的中医手法，开始在她头上按摩起来，一丝灵力透过江寒的指尖，从发际、百会、天柱、风池一路下来，又沿两侧听宫、太阳到睛明，攒竹、丝竹空一个完整的循环。轻柔到位的动作慢慢发挥着作用，妇女感到了一阵宁静，渐渐的困意来袭。</p><p>　　没用了多长时间，江寒按摩完毕，此刻妇女已经熟睡，给她拉上了被子，他悄悄离开了病房。</p><p>　　当服侍妇女的人回来之后，惊喜地发现多日失眠的夫人竟然睡着了，怎么敢发出半点声音，这是好事，她轻轻掩上了门，疑惑之色倒没少半点。</p><p>　　这妇女名为姜佩琪，可是苏南省的第二夫人，同时她也并不是花瓶，身系省政协副主席，分管文教卫生，无怪有着足够的自信。</p><p>　　第二天早上，姜佩琪从熟睡中醒来，精神头格外的好，已经很久没有这种感觉了，她稍微活动了下腰身，想起了昨晚的事，对了，是一个搞保洁的年轻人给她做了一会按摩，抱着一试的想法接受了，没想到效果会这么好。</p><p>　　她赶紧吩咐手下人去打探，不过她视力有问题，连江寒长相都说不出来，只知道是一个搞保洁的年轻人。</p><p>　　实际上这信息也足够了，因为医院里搞保洁的大多多事中年妇女，年轻男子的话很少，要打探的话也没有多困难，一个省的第二夫人，想找这么个人更不是问题。</p><p>　　很快手下就给她答案，了解到江寒是急诊外科的实习生，搞保洁是为了赚取一点生活费，这一发现让姜佩琪有些意外，这年轻人有这种神效的按摩手段，还会缺一点生活费？</p><p>　　不过她并没有多说什么，每个人有自己的生活方式，不过江寒的技术对她来说，无异于雪中送炭，她派人给院长带话，让江寒晚上有时间的话都来帮她做次按摩，有偿。</p><p>　　江寒昨晚离开病室回到了宿舍，他开始重点关注有关糖尿病的信息，包括治疗，实际上治疗糖尿病的理论是有的，只是没法实现，而这巫医道的传承，使得这种可能，能够实现。</p><p>　　喜出望外，如果真的能够就此只好糖尿病，那简直是医疗史里程碑，江寒学医，自然想过攻克人类身上无法根治的一些疾病。</p><p>　　“江寒，你小子可是不得了啊，原本以为你已经够拽了，没想到还能更拽，省长夫人你都认识了。”这天在科室里，刘星拍了拍江寒，阴阳怪气地说道。</p><p>　　“嗯？什么省长夫人？”江寒自然还不知道姜佩琪的身份，这个时候是真疑惑。</p><p>　　“得，你就装吧，我到要看看你小子还有多少秘密藏着掖着。”看江寒那表情，跟真的一样，刘星手指在空中连点，脸上尽是无奈，他人却转身离开。</p><p>　　“莫名其妙。”江寒整理着手上工作，嘀咕了一句。</p><p>　　没过几分钟，有人给江寒传话，说主任找他，江寒马上赶到了陶蕾办公室。</p><p>　　“江寒，以后卫生你是不用打扫了，给住院部二十三病室零零一床病房姜主席做一次按摩，奖金少不了你的。”江寒正疑惑，陶蕾轻叹了一声，接着开口，“你这孩子，你说你认识姜主席也不跟大家说一声，要是有多疑的人，还不以为你是看不起我们了。”</p><p>　　江寒苦笑着说了句抱歉，这件事是他疏忽了，之后离开了病房，根据刘星和陶蕾的话来看，昨晚那人九成就是刘星口中的省长夫人。 </p>'",
        "'第12章 削个苹果'",
        "'<p>　　下班时间，江寒按照主任吩咐来到了住院部二十三病室001病房，这是姜佩琪的房间，看到敲门进来的人是江寒，夫人脸上立马笑开了花，之前连日失眠加上病痛折磨，还有一堆烦心事，让她半点心情也没有。</p><p>　　昨晚因为江寒的按摩，她才久违睡了个安稳觉，醒来发现视力居然恢复了一些。对于江寒她是说不完的感谢，现在看到他来了，竟然要起身下床亲自相迎。</p><p>　　别说已经知道了她的身份，就算不知道，江寒也不会让一个病人真的下床来迎接，他赶忙加快步子，在姜佩琪动身之前来到了她床前。</p><p>　　“阿姨，昨晚看您睡着了，我没打招呼就离开了，您休息的还好吗？”江寒对人很有礼貌，语气并没有因为得知了姜佩琪的身份之后有什么改变。</p><p>　　姜佩琪心中暗许，她那样寻找江寒，而他也来了，他应该是已经知道了她的身份，而他的表现却没有任何改变，这种不卑不亢的年轻人，实属难得。</p><p>　　“好，很好，我很久都没有睡过这么好的觉了，小伙子，真的是很感谢你。”姜佩琪满脸笑容，看着江寒继续开口，“小伙子，你叫什么名字啊。”</p><p>　　“阿姨，我叫江寒，大江东去，寒来暑往。”江寒轻声开口，也是面带微笑，这种天生的亲和力，让所有接触到江寒的人都对他莫名的不会讨厌。</p><p>　　“江寒啊，行，阿姨记住了，这样，阿姨能麻烦你再做一次按摩吗，不会占用你太多时间吧？”不得不说，身份越高的人涵养越高，姜佩琪如此开口，只会让江寒在做这必须要做的事之时，心里更舒服。</p><p>　　“当然不会，我是实习生，听我们主任说那按摩对阿姨很有效果，以后应该每天都会来，能够看到病人好转，是我们当医生最大的心愿了。”江寒开口。</p><p>　　之后江寒跟昨晚一样，给姜佩琪做了一次按摩，自然用上了体内那一丝灵力，效果自然同样神奇，不过这次姜佩琪没有睡着，完了之后她躺在床上，江寒坐在一旁陪她有一句没一句地聊天。</p><p>　　“小江，你给我削个苹果吧。”姜佩琪半倚在床头对着江寒说道。</p><p>　　江寒一愣，“啊，削……削苹果？”</p><p>　　“是啊，怎么了，我这病不能吃苹果？”看到江寒的反应姜佩琪也是一愣。</p><p>　　“这倒不是，睡前吃点青苹果很有好处的，能够一定程度上刺激胰岛素，不会对您病状有什么坏的影响。”江寒连忙摆摆手。</p><p>　　不是姜佩琪不能吃苹果，而是因为他，不会削苹果。</p><p>　　小时候吃水果，他都是连皮带籽一点不浪费。</p><p>　　他曾经也削过几次苹果，一个苹果削完，险些就剩下了个苹果核，这种水平，怎么给削，所以他迟疑。</p><p>　　这些姜佩琪自然不会知道，她眼中的期望，像一个孩子，江寒看到之后强行咬牙拿起了一个苹果，顺势抄起了桌子上的水果刀。</p><p>　　一手持刀，一手拿苹果，对于江寒来说这是一场恶战，如果有选择，他宁可啃着馒头解剖人体脏器，也不愿意杀这苹果一刀，太难下手了，他紧紧握着水果刀的手，竟然有一点颤抖。</p><p>　　“拼了。”江寒最终还是动手了，对着苹果柄处下刀，水果刀在他手中灵活转变了几个角度，之后一只手不断旋转苹果，另一手压着果皮动作行云流水，迅捷无比。</p><p>　　几秒钟的时间一个去皮的苹果完美的出现在了江寒手中，果皮没有一处断裂，所有地方厚度和宽度没有半点误差，轻轻一摇果皮完整落下，堆在垃圾桶底部，严丝合缝堆起来，看上去就像是扔了个苹果进去。</p><p>　　姜佩琪看的有些呆，削果皮手艺好她不是没见过，但好成这样的，她还就真的没见过，太不真实了，到底是怎么做到的，现在算是明白了江寒之前为什么迟疑了，肯定是怕这技艺太惊人，不愿意在人前施展。</p><p>　　可怜江寒完全被误解，他此刻拿着手上的苹果，也是不断眨眼睛，发生的一切他自己的都不清楚是怎么回事，难道自己原来不是不会削苹果，反而是削苹果的天才，只是后天觉醒的才能？</p><p>　　那是胡扯，肯定是因为巫医道的传承，他成功引气入体，之前也尝试过，他身体的各种能力都强悍了很多，协调性和掌控程度都比以前强大，这才是根本原因。</p><p>　　现在不是发呆的时候，江寒把手中苹果切开放在果盘中，整盘都送到了姜佩琪面前，她现在都还沉浸在刚才看到的震撼中，以至于没有发现江寒也在发呆，此刻看到面前的苹果她才缓过神来。</p><p>　　两人都没有说话，吃完苹果之后江寒告诉姜佩琪，他对糖尿病有些研究，最近就要取得一些成果了，虽说不能根治，但对病情恢复肯定有很大的好处，等差不多完善了之后可以对其进行治疗。</p><p>　　这话姜佩琪到也没有过多的放在心上，糖尿病基本上已经被确认为不可根治的疾病之一，不出意外的话她一生都会伴随着这种痛苦，江寒的话无非就是让她宽心，这是医生对病人一贯的手法，当然在她看来完全是江寒年轻志气高，哪个有抱负的医生年轻时候没想过攻克人类病史的一些不治之症呢？</p><p>　　结束之后江寒回到了宿舍，最近一直都很忙，只有晚上才有空闲时间用在修炼上，他发现太上洞玄诀实际上晦涩难懂，如果不配合道德经修行篇一起看，根本没有办法下手。</p><p>　　即便配合着能够看懂，江寒进境也不是很快，现在也还没能够引入足够的灵力，开启炼气更是遥遥无期，不过这件事偏偏急不来，修行一步一个脚印，差一点都不行。</p><p>　　好在再过几天便是国庆黄金周，他也将迎来假期，到时候他就能够小小的闭关一次，说不定能够有所突破，那就太好了，境界提升，他能够了解到更多的知识，也能学到更多的技巧，灵力壮大之后很多手段都能够展开，对于现在存在的很多疾病，都能够更高效解决。 </p>'",
        "'第13章 约会（上）'",
        "'<p>　　“江寒，你真的不跟我们去吗？”杨梦娇叫住了快要出门的江寒。</p><p>　　“嗯，我有些事要处理，抱歉了。”江寒转身一笑，说完离开了科室。</p><p>　　已经是下班时分，刘星挂好了白大褂之后走过来，看着江寒离开，他嘀咕了句，“这家伙每天一下班就消失了，也不见有什么娱乐活动，你说他是去干嘛了。”</p><p>　　“那可是苏医大学霸，肯定跟大学一样，埋头钻研什么吧，果然学霸的世界我们还是不懂。”杨梦娇叹了口气，今天下班就正式放假了。</p><p>　　他们初入社会，进入了第一医院这种地方，天天都是高强度的工作，终于能够痛快的放松几天，两个实习生兴致都很高，他们商量着来一次远足，可惜邀请江寒的时候他拒绝了，不是矫情，是真的直接拒绝了。</p><p>　　这个黄金周江寒已经计划好了，先不说他还要为姜佩琪按摩，而且他想要趁着这个机会来一次小小的闭关，还有就是他必须得找苏雨歆一次，当面谢谢她才行。</p><p>　　之前一直很忙，承蒙她的帮助，他却再一次的，事后再没联系过对方，这种行为不用谁说都是很要不得的，不过江寒到不会忘记了，他一直都记在心里，现在有假期，这件事他放在了第一优先级。</p><p>　　然后除了修炼也就没有别的事了，回宿舍收拾了下，江寒走出了医院，之前租的小屋还没有到期，这几天他还能继续住，半个多月没有回来，那租金算是白花了大半。</p><p>　　不过江寒也不是很计较，钱嘛，花了才是自己的，更主要的原因是，放假之前主任给江寒发了所谓的奖金，数目还不小，拿到手上的时候江寒一度怀疑主任是不是弄错了。</p><p>　　不过主任一句“你以为那是什么人？”让江寒不得不苦笑接受，说的也是，这笔对他来说数额不小的奖金，在对方眼中确实根本不算什么。</p><p>　　每人都有自己标准，江寒看来这就是很大一笔钱，现在他再次体会到，金钱烂俗，却人人喜欢，这东西拿在手中，确实能让人变自信，比如没钱的时候他都不好意思联系苏雨歆。</p><p>　　不是无聊的自尊心，或许也是，管他呢，这就是江寒心里想的，这小屋地段本来就不是很好，环境自然也一般，半个多月没回来屋里已经落了不少灰尘，放好不多的行礼，简单的打扫了一下。</p><p>　　江寒躺倒了那张硬邦邦的小床上取出手机，给苏雨歆发了条微信，没过多久那边给回了一条语音信息，点击播放，苏雨歆动听的声音传来。</p><p>　　“我可是天天在日历上划着勾呢，这次还不错，不到二十天就联系我了，很有进步。”</p><p>　　江寒听着这语音消息，怪不好意思的，他是没想过苏雨歆会这么记着，让他汗颜程度更提升了一些。</p><p>　　江寒不习惯发语音，他在聊天框输入了信息，“学妹，明天你有空吗？请你吃好吃的。”</p><p>　　点击发送之后没多久，苏雨歆给了回复，“学长怎么突然来了雅兴，竟然想到请我吃好吃的了。”</p><p>　　“最近学长发了笔横财，不花了浑身难受，怕睡不着。”</p><p>　　“哈哈，没想到学长也会讲笑话，还真是让人意外啊。”苏雨歆那边明显是笑出了声。</p><p>　　“怎么样，学妹有空吗？”</p><p>　　“当然没问题啊。”苏雨歆俏皮的声音传来。</p><p>　　“好，那等我想想去哪，一会给你发信息，或者你想去哪直接告诉我也行。”</p><p>　　之后短暂道别，江寒放下了手机，盘坐到床上，他在研究脑中传承的那些信息，另一边苏雨歆放下了手机，她原本就趴在床上，放下手机之后把头埋进了枕头里，心情很好的样子。</p><p>　　没过多久她起身走出了房间，穿过了长长的走廊下到了一楼大厅中，宽阔的大厅里灯全亮着，只有一个单人沙发上坐着一个中年男子。</p><p>　　“爸，我明天不跟你们一起去了，你们先去，晚一天自己来找你们好不好？”苏雨歆趴在沙发旁边扶手上，用手托着下巴，看着父亲眼睛一直眨。</p><p>　　“怎么，之前不是已经说好了吗？”中年男子放下了手中一份东西，侧脸看着旁边女儿。</p><p>　　“计划赶不上变化，现在临时有事了，没办法啊。”苏雨歆盯着父亲眯着眼咧嘴说道。</p><p>　　“女大不中留，你都好意思开口说了，我还能好意思不答应吗，到时候你叫着那小子一起来也行。”中年男子一笑，摇摇头，人前他是叱咤风云的人物，回到家中他同样对女儿没有什么办法。</p><p>　　说话的时候眼中全是慈爱，苏雨歆开口的时候他就猜到了个大概，不得不说，他对自己女儿还是十分了解。</p><p>　　“爸，你说什么呢，我们……我们才没不是你想的那样。”苏雨歆一听直接站直了身子瞪着眼开口。</p><p>　　“还是太年轻，一试就马上暴露了，还真是那小子。”中年男子笑盈盈开口。</p><p>　　“太狡猾了，太狡猾了，自己女儿都不放过。”苏雨歆现在也明白过来发生了什么，不过已经晚了，她自己已经招了。</p><p>　　“得了，上次派出所事件我听说了，你谈什么朋友我都是不反对的，但你要记得，只有‘配得上’你的人，你们在一起才可能幸福。”中年男子也不再抓着话题不放，他本来也没有打算限制女儿。</p><p>　　“好好好，我知道了，都听了一万回了。”苏雨歆闭着眼不断点头，她跟父亲关系特别好，两人更像是交心的朋友，这种关系难得可贵，说完之后她跑回了房间。</p><p>　　实际情况也不像是父亲说的那样，苏雨歆对江寒印象是很不错，不过要说是那种喜欢，大概还是差了不少，她从来都没有想过，只是每次见到这个学长都觉得很宁静，一种很不错的感觉。</p><p>　　没过了多久，苏雨歆手机屏幕亮起，是江寒发来了信息，内容却是让她有点苦笑不得。</p><p>　　不能不说，这个看起来很正经的学长，有时候还真是挺萌的，或者说那是种反差萌，这种更是少见。 </p>'",
        "'第14章 约会（下）'",
        "'<p>　　之前，江寒研究了那些传承信息没有多久，就决定先放一放，入门的知识已经学得差不多了，现在接触到都是一些需要时间和经历琢磨和研究的，短时间内不可能有什么突破，江寒打算之后再潜心研究。</p><p>　　答应了苏雨歆要给她消息，他躺在床上翻弄着手机，想要寻找些有用的信息，不过事实证明，这方面他就是个彻底的门外汉，这种找好吃的本领，本来应该是大学生最擅长的，不过江寒大学时期的大部分青春都奉献给各种实验和医书了。</p><p>　　现在用到这种技能的时候他才发现自己根本没有点过，拿着手机翻来覆去也没有确定下来，最后只能选择缴械投降，最后他给苏雨歆了消息。</p><p>　　“学妹，我看还是你这个本地人说了算吧，原谅我实在不知道去哪……”</p><p>　　“我一猜就是这样，哈哈，不如你告诉我想吃什么，我给你推荐吧，说到吃，我可是行家了。”苏雨歆笑着发的语音，一句话分成了好几次说完。</p><p>　　江寒有些尴尬，他不知道苏雨歆在笑什么，有那么好笑吗，好像没有吧。</p><p>　　“明天主角是你，我当个跟班，你说什么就是什么。”江寒想要感谢苏雨歆，自然想尽可能的满足她要求。</p><p>　　“好吧好吧，那明天中心街口见，让你见识下跟女生上街的场面。”</p><p>　　两人互动了一会之后结束了话题，江寒早就已经习惯了不睡觉，用冥想和修炼心法来代替，效果很不错，第二天精神比睡了一宿还要足。</p><p>　　结束了跟苏雨歆的聊天，他开始修炼，入门之后便能够学习一些简单的法术，虽然不像小说中那些仙法，动辄便是煮海焚天，但也能够开碑裂石。</p><p>　　其中一种便是隔空取物，这是江寒最先选择学习的法术，因为对于一个医生来说，这种法术意义重大，最简单的一个例子，如果喉咙里卡了一根鱼刺，不用镊子之类的东西就几乎不能够取出来，一个道理，有不少病痛只需要取出某些东西，但往往因为取不出，所以大费周章。</p><p>　　此外，隔空取物这种能力妙用无穷，学会之后一定能够打开一扇发现新世界的大门，具体怎么用，需要用到的时候就知道了。</p><p>　　电视剧中那种一抬手就把别人宝剑抢走，挥手间草木皆可为剑，说着是以气御剑的高阶境界，实际上还不就是能够隔空取物，而巫医道传承中的，是法术，是仙家手段，肯定比那些要强。</p><p>　　江寒并不是现在才开始修炼，注意到这个法术的时候他已经惦记上，到现在已经摸索得差不多了，按照他的预计，再过一两天也就能够成功使用，接下来就是熟练度的问题。</p><p>　　一夜时间很快级已经过去了，江寒不喜欢别人迟到，自然自己也不会有迟到的习惯，早早的起床，他想要翻出一身新点的衣服，但找遍自己行李箱也没能够发现所谓的新衣服。</p><p>　　他现在已经知道了苏雨歆身份非凡，自己跟她出去，虽然不觉得她会计较他的穿着，不过难免别人会指点，人活着不只是在自己的世界，别人眼中的自己，同样是自己的一部分。</p><p>　　江寒比约好的时间早了很久出门，他想要先去给自己购置一身行头，因为家境贫寒，江寒很少有出去逛街买衣服的时候，常年就那么几套衣服分成寒暑季穿，多年来也习惯了。</p><p>　　如今他自己出门去挑一身衣服，他才发现原来买衣服不是件容易的事，他跟苏雨歆约好了在中心接口碰头，他索性就在中心街逛了起来。</p><p>　　久久没有下决定，因为江寒每走进一家店，看着吊牌上的价格他都犯愁，很震惊，一件薄薄的短袖T恤标价最少都是四五百，打个9.9折还不是跟没折一样。</p><p>　　裤子更是夸张的贵，最后他只是想要找一条三位数能买的，出了这家店又进那家，这里是中心街，是苏江市最黄金的地段，一般小品牌根本没有资格在这里开店，考虑到性价比，也不会有一般品牌会选择这里。</p><p>　　每一家几乎都是中端以上的品牌，价格自然不菲，江寒想要在这里找到低价的衣服，还是有些不可能，加上他对这里又不熟，即便有便宜一些的，他也是找不到的。</p><p>　　比预料中花费了很多时间，他最终还是找到了一家名为“H&amp;amp;amp;amp;amp;W”的店，总算是购置了一身还算过得去的装备，起码看上去是还行，价格他也能够接受。</p><p>　　他特地穿了一身旧的几乎不能再穿的衣服来，换上新的之后不能再穿的旧衣服他叠好放在了垃圾桶旁边，一看时间，已经快到了约好的时刻，江寒加快脚步往中心街口走去。</p><p>　　他来到没超过五分钟，苏雨歆从出租车上下来，看到江寒之后她明显一愣，从小父亲就教自己，宁可多等几分钟也不要迟到，不管什么场合。</p><p>　　所以苏雨歆也从来没有迟到的习惯，反而都会提前一些到，还好江寒加快了脚步，最终还是在苏雨歆之前来到了街口。</p><p>　　“哎，学妹，你怎么来这么早？”江寒迎上去，笑着打招呼。</p><p>　　“我一猜你就会来很早，不好意思让你等太久了。”苏雨歆一笑，虽然已经是金秋十月，但秋老虎的余威尚在，天气很热，她穿的是分体长裙，上身是一件印大花的彩色衬衫，长裙是白色，头上戴着大帽檐的巴拿马帽，装备很齐全。</p><p>　　“哈哈，学长，你过来。”看到江寒走了过来，苏雨歆突然掩嘴笑了起来，因为她看到了江寒裤子侧面，竟然还有一处吊牌没有剪下来。</p><p>　　江寒自己并没有发现不妥，疑惑地走到了苏雨歆面前，苏雨歆一只手掩着嘴，另一只提着小包的手指向那吊牌。</p><p>　　江寒目光看了过去，发现了之后尴尬一下，伸手便要扯下。</p><p>　　“哎，学长别。”苏雨歆见状急忙开口想要阻止他，动作快了点，伸手拉住了江寒了，即便之后很快又放开，可脸色还是一红。 </p>'",
        "'第15章 隔空取物'",
        "'<p>　　江寒也稍微一愣，他没有跟女生相处的经验，面对这种情况自己也不知道该怎么处理，只能尴尬的笑笑，不动声色地把旁边吊牌扯下来。</p><p>　　苏雨歆脸红一愣的时候没有注意到江寒动作，当她看到的时候江寒已经把那吊牌给扯下来了，她皱了皱眉头，“学长你是不是傻？”</p><p>　　这一问让江寒更愣了，一般来说，面对这种回答怎么也不可能有人回答“是”吧。</p><p>　　他疑惑看向苏雨歆，满脸不解。</p><p>　　“吊牌线细，又坚固，这么扯肯定要割到手，你没事吧？”苏雨歆无奈说道。</p><p>　　“啊，这个啊，没事没事。”江寒慌乱地伸出手，刚才撤线的地方连痕迹都没有，确实没有受伤。</p><p>　　苏雨歆看到江寒无恙的时候也放下心来，暗想白白出丑了。</p><p>　　“现在吃饭还早，我们去逛街吧。”苏雨歆见江寒的样子就知道他根本不是司机，指望他是没戏了，只有自己主动提一下。</p><p>　　苏雨歆走在前面，江寒突然想起了什么，出声叫住了她，“哎，学妹，等下。”</p><p>　　苏雨歆闻言停下脚步转身看向江寒，江寒伸手把一张卡取出来，双手拿着递到了苏雨歆面前，“本来早就该还给你的，一直没有机会，现在物归原主了。”</p><p>　　苏雨歆一笑，伸手接过银行卡放进小包里，“放心放心，我可不会忘记了，以后你叫我雨歆就好了，走吧。”</p><p>　　说完她走了出去，江寒也快步跟上，两人算是朋友，但严格说来并没有多少交集，这样出来逛街更是第一次，也是江寒人生的第一次，他之前从来没有跟女生逛过街，即使是那个人，也到底没有机会。</p><p>　　比起江寒束手束脚，苏雨歆要轻松得多，完全放开的享受时光，街边小吃，小店玩物，她都会尝试一下，江寒可能是没有经历过这种场面，一路闲得有些手足无措，在苏雨歆看来，到成了别样的风景。</p><p>　　路过一个电玩城，江寒一样慢步走了过去，不过没走几步他就发现苏雨歆没有跟上来，转身发现苏雨歆站在了电玩城面前，眼睛看着里面都发直。</p><p>　　江寒走回到电玩城前，顺着苏雨歆目光看了过去，门口是几排娃娃机，里面放着各式各样的毛绒玩具，从小到大不一而足，而苏雨歆正是盯着这些娃娃。</p><p>　　“学长~我们去抓娃娃吧，好不好？”苏雨歆眼睛发光，伸手扯着江寒袖子。</p><p>　　“这个啊，这个我不会啊。”江寒尴尬，这种消费场所对于一个正常日子都要精打细算才过得走的学生来说，还是奢侈了。</p><p>　　“没事，我会啊，我跟你讲，我玩这个可厉害了。”苏雨歆转脸看向江寒，但眼中的光显然是还没有消失。</p><p>　　怀着这种热情提出来的要求，要是江寒敢拒绝的话，说不定苏雨歆在街上就要掐他，这种风险江寒不想冒，而且今天他本来就是陪苏雨歆的，更没有拒绝的理由。</p><p>　　两人走进了电玩城，不等江寒去买游戏币，苏雨歆已经玩上了，她是有备而来，往里走的时候就已经取出了会员卡，直接刷卡抓娃娃。</p><p>　　江寒站在苏雨歆旁边，看了不到五分钟，他终于明白了，苏雨歆真的很厉害，刷卡，抓，刷卡，抓，没有任何一点多余的动作，连瞄都不带瞄一下的，一套操作行云流水，似乎很熟练的样子。</p><p>　　只是，别说有没有抓出来一个，连抓起的次数都屈指可数，说白了她实际上就是一顿乱抓，虽然自己没玩过，不过这游戏机怎么也不该是这么玩的吧。</p><p>　　江寒有些吃惊，不过苏雨歆完全不管他的反应，自己疯狂地抓着娃娃，电玩城里抓娃娃的人不在少数，不过能够达到苏雨歆这种境界的就真没几个，不一会就吸引了不少人围观。</p><p>　　众人看着苏雨歆动作，有人笑了起来，有人表示震惊，有的由衷说着六六六，当然，也有人看着江寒露出了同情的目光，这种就是传说中的花钱如流水了吧。</p><p>　　“咳咳，雨歆，要不，给我玩一次？”江寒上前一步。</p><p>　　苏雨歆停下了动作，稍微有些喘息，“好吧，就给你玩一次。”</p><p>　　江寒学着苏雨歆的动作，开始无尽抓娃娃生涯的第一次，操控着机械臂移动，拍下按钮抓下去，稳稳命中了一个娃娃，收上来的时候那机械臂一抖，娃娃又掉了回去。</p><p>　　果然是这样，这机器设定是有猫腻的，应该是每多少次就会有一次机械臂力量特别大，只有赶上那次，加上正确的抓取方式，才能够抓到娃娃。</p><p>　　这么一来的话，商家是永远也不会亏的，别说苏雨歆这样的玩家，一月多遇到几个就已经绝对不会赔了。</p><p>　　“对，算是无良商家欺骗消费者了，那就不能怪我我讲规矩了，正好检测一下这几天修炼隔空取物的成果。”江寒心中嘀咕，这么下去的话，不知道什么时候才能够抓到娃娃，于是他决定试试自己新法术。</p><p>　　“刚才是试探，雨歆你看我一次性把它们全抓出来。”江寒嘿嘿一笑，夸下了海口。</p><p>　　“切，你们听听，也就是吹牛不上税了。”</p><p>　　“哈哈，这人真幽默。”</p><p>　　“装出去的逼，泼出去的水，看他怎么圆。”</p><p>　　江寒的话很多人都听到了，他们对此表示不屑一顾，这是绝对不可能的事，任他技术日天，这种事还是做不到。</p><p>　　苏雨歆也尴尬地一笑，江寒这话是说的有点不可信了……</p><p>　　不过接下来的发展可以用一个峰回路转来形容，江寒双目凝视着娃娃机里面的所有娃娃，意念锁定，隔空取物之术发动，他把所有的娃娃连在了一起，而明面上则是用机械臂不断放下来掩饰。</p><p>　　外人看上去就像是在瞎搅弄一般，最后一次，江寒控制着机械臂抓住了一个娃娃，隔空取物之术发动，那娃娃看上去就是紧紧被抓住。</p><p>　　而这娃娃某些突起的部分则挂着另一个娃娃，以此类推，整个娃娃机里的娃娃竟然被全都被取了出来，这个时候已经没有人在意这事科不科学，因为他们现在只能下意识地作出一个目瞪口呆的表情。 </p>'",
        "'第16章 祖传抓娃娃技术'",
        "'<p>　　江寒早就料到了会有这种结果出现，不过他也不在意，就算调出监控让再专业的侦探来看多少遍，也不能找出他半点的违规操作。</p><p>　　低身一个又一个的取出娃娃，江寒冲着苏雨歆一笑，让她挑个喜欢的，苏雨歆愣愣看着江寒，有点不敢相信，进门之前他还说自己不会玩，这要是算不会玩的，那这游戏还有会玩的人吗？</p><p>　　苏雨歆自问纵横抓娃娃界十几年，抓过的娃娃比很多人见过的都多，虽然没怎么抓起来过，但江寒这样一次下钩子就把一个柜子里娃娃全部抓走的，她同样也是第一次见。</p><p>　　在场不少人都使劲眨了眨眼睛，但遗憾的是他们必须要相信，这一切都是真的，苏雨歆走过去从江寒抱着的一大堆娃娃中挑了一个史迪仔，不得不说，只是里面最萌的一个。</p><p>　　接下来江寒抱着一堆娃娃转身走开，让在场的每个女孩子都自己挑一个，完了之后发现粥多僧少，还有剩余，干脆再送了一遍，把娃娃全部都送了出去。</p><p>　　电玩城的经营者看着这一幕，脸色隐隐有些发绿，不过作为围观苏雨歆暴力抓娃娃的人员之一，发生的一切他也同样看到了，江寒没有任何的违规操作。</p><p>　　“我的乖乖，这要是每天来守着抓娃娃，这些娃娃机谁还敢摆出来。”那经营者一脸苦瓜相的看着江寒两人离开。</p><p>　　没有回头去看，不过身为修士，江寒灵觉敏锐还是感受到了两种不同的气息，那是他身后女生和她们旁边男生看向江寒的不同眼神。</p><p>　　在这些女生眼中，那些什么直播抓娃娃飞钩甩钩的，跟眼前江寒相比那简直差了不知道多少个档次，而男生心中则是不爽，本来是一起装的逼，这倒好，让你小子一个人全装了。</p><p>　　江寒如今还没有修成他心通，不能得悉这些人心中想法，这也不是他关注的重点，这个时候他已经跟漂亮学妹离开电玩城很远一段距离。</p><p>　　“学长，想不到你才是真正的深藏不露啊，还说没玩过，这种水平都不是光练习就能成的了，一定是有什么秘诀，是不是，是不是，你快教我。”苏雨歆一只手抱着史迪仔，一只手拽着江寒的袖子不断摇动，两个大眼睛里满是星星。</p><p>　　江寒有些发怵，刚才一时技痒，没能忍住，现在才发觉还是太冲动，做的太过了，只是现在才想起来已经晚了，光是眼前一个苏雨歆就不知道该怎么处理，总不能真的教她隔空取物吧。</p><p>　　江寒敢保证，他要敢这么说的话，苏雨歆一定跟遇到神经病一样避开他，拉黑是肯定的。</p><p>　　“这个啊，这个，这个是祖传的技术，传男不传女，雨歆你就不要惦记了。”江寒一笑，只能找借口搪塞，说完他先向前走去。</p><p>　　“江寒，你是真当我傻了是不是，抓娃娃还能祖传了？”苏雨歆气得跺脚，江寒那番说辞连小孩子都骗不了，她当然不会相信。</p><p>　　“哼，不想教我，我还不学了。”苏雨歆一撇嘴，快步跟上了江寒。</p><p>　　她倒不是真的生气了，这种神乎其技的技术，就算江寒教她她自知也不一定学得会，只是江寒那一句“祖传的”实在太没水平了，明显就是敷衍，让她有点气恼。</p><p>　　“走，陪我去买衣服。”苏雨歆是典型的生气了就买买买那种女生，江寒给她找的气恼，她虽然不会真的计较，不过就这么算了也不大可能。</p><p>　　跟江寒不同，苏雨歆进的也是中心街那些豪华的商店，不过她试衣服却跟江寒大不一样，看中了就直接试，从不见她看吊牌或者价签。</p><p>　　这些都看在江寒眼中，他神色免不了有几分黯淡，倒不是说苏雨歆方式有什么不对，有钱人就过有钱人的生活，怎么花都是自己的钱，这些行为本来就正常。</p><p>　　江寒只是想到自己，如果不是有一笔奖金，他连到这些地方看看的想法都不会有，更别说买东西，人和人还是不一样的。</p><p>　　当然，如果要说是不公平，那也不对，没什么不公平的，世界那么大，人又那么多，有富人自然就会有穷人，只是恰好现在这个时间段，自己当了穷人。</p><p>　　真正重要的还是心吧，如果心甘情愿了，那就真的没有什么可以期待的未来，而江寒，从不愿意低头，心中有信念，才能真正走很远。</p><p>　　“学长，你看这两件衣服哪件比较好看？”江寒神色已经恢复如常，正好苏雨歆拿着两套衣服比划着走到他面前。</p><p>　　这种号称几千万叼丝最大难题之一的问题，江寒同样是没什么做题经验的，刚想要开口说那个只要是问这个问题的人都不想听的答案。</p><p>　　“你要说了，保准你后悔。”一个很细的声音传入江寒耳中，打断了他将要出口的话，他疑惑，还不等开口，那声音再次响起，“别愣着，你就说左边那个好看。”</p><p>　　来不及细想，苏雨歆等在一旁，他不能失态很久，不知道怎么的，也不管声源在哪，他就信了那个声音的话，脱口就说左边那个。</p><p>　　苏雨歆一听脸上笑容更灿烂了几分，“学长眼光就是不错，我也觉得这个好看，你等我一会啊。”</p><p>　　说完之后苏雨歆拿着衣服转身走开，江寒心中暗暗赞叹，刚才教他的人，不错啊，现在苏雨歆走远，他也想起来找那人。</p><p>　　不过江寒转身四顾，他附近哪有什么人影，就他自己一个人，以他现在的灵觉，总不能有人接近又离开了他都发现不了吧，那基本不可能。</p><p>　　“别找了，现在还不是给你看到我的时候，总之想要把妹，你听我的就是了。”江寒正在疑惑，那个声音再次响起，已经确定，绝对不是正常人。</p><p>　　“好吧，你刚才是怎么判断的？”自己都已经算是个修士了，这些超乎常理的东西他接受起来也没什么障碍，既然对方不想让他看到，那不看就是了，但他还是好奇刚才是怎么判断的。</p><p>　　“单身久了的糙汉子，怎么会懂女人心，就你那样的，这国家还有几千万。”那声音完全是不屑，说的江寒有些发愣。 </p>'",
        "'第17章 金链子大哥'",
        "'<p>　　这话江寒自问没法接，完全戳中了死穴，虽然不是完全没有谈过恋爱，但大二开始就一直单身的他，还真的算是“单身久了的糙汉子”。</p><p>　　“那我这不是请教你了吗？”江寒到也坦诚，一点不做作直接就问了，他虽然是个有理想的好青年，但能搏得妹子欢心的技能，他同样很有兴趣。</p><p>　　网络新起的词汇“撩妹”，说的神乎其神，实际上就是能猜到女生心中的大概想法，然后采取一系列心理战术之类的，而刚才开口那人，只怕不是侥幸猜到，功力应该相当深厚了。</p><p>　　“既然你诚心诚意请教了，那我就大发慈悲告诉你，听好了，以后这种问题，根本不用脑子，用脚想就行了，一个女人拿着两样东西问你哪个好的时候。</p><p>　　‘两个都好看’或者‘你穿什么都好看’这种看似风情满满的话，却是她最不想听到的回答，你要是说了，印象立刻减分。</p><p>　　如果你能真的看出来她更喜欢哪个，那是最好的，但所谓女人心，海底针，想要猜透难度跟猜彩票一样，不过不用着急，最正确的方式之一，就是随便指一个就行。</p><p>　　不用问为什么，因为她拿两个东西让你挑的时候，实际上她心里已经有底了，这两个她要哪个都行，只不过因为心里的一些想法，礼貌性的问你一下，你说哪个都不会错，就是不能全选或者全不选。”</p><p>　　从理论依据到正确打开方式，那声音严格的说明了一遍，头头是道，听得江寒不得不服，他第一次知道，还有这种学问。</p><p>　　“这也行？”江寒心里是有些吃惊的，他现在因为修炼太上洞玄诀的缘故，不光是灵觉强了很多，感觉大脑的脑域开发度也在被提升，把那番话分析一下，果然是完全符合女人的逻辑。</p><p>　　“什么叫这也行，小子学着点，想要抱得美人归，我看你是不行，得我帮你。”那声音满是不屑，这种态度不像是装出来的。</p><p>　　江寒正要说话，发现苏雨歆已经提着一个手提袋向他走来。</p><p>　　“接过来，动作快，还要自然。”</p><p>　　江寒耳中传来那个声音，稍微一愣马上知道那是什么意思了，虽然有点迟疑，不过还是照做了，他上前一步迎向苏雨歆伸手想要帮她拿买好的衣服。</p><p>　　可毕竟只有理论支持，实际操作并没有被训练过，江寒动作非常僵硬也不自然，看上去根本不像是要帮苏雨歆提东西，反而像是打劫的。</p><p>　　“唉，给个包子狗都会干的事情，怎么到你这就这么困难呢。”那个声音透露出一种痛心疾首的感觉。</p><p>　　江寒很想回嘴，不过似乎也发现了自己动作僵硬，苏雨歆自然也察觉到了，她看着江寒突然笑了起来，自己把衣服放到了他手中。</p><p>　　“学长，你原来这么有意思啊，哈哈。”苏雨歆说着，江寒脸色一红，不知道怎么回答，只有尴尬地笑笑。</p><p>　　“还有脸笑，哎哟我的妈呀，有这种脸皮却只有这种水平，真是丢人，丢人。”那不知名的声音传出，似乎在不断咂嘴。</p><p>　　江寒在这一方面本就是个门外汉，被那声音一直挤兑，现在更加不知所错，苏雨歆看着江寒尴尬，她也没有再继续调笑他。</p><p>　　“我们去吃饭吧，我知道附近有家牛扒，超级好吃。”苏雨歆叉开了话题。</p><p>　　“时间也差不多了，走吧。”江寒自然不会说不，欣然答应下来。</p><p>　　两人正好要走出服装店，这个时候两人走了进来，一个装扮奢华，摸着浓妆的年轻女子挽着旁边男人的手臂。</p><p>　　这个男人顶上光滑，好像还打了蜡，铮亮得像个大灯泡，身形极为富态，脖子上更是挂着一根拇指粗的金链子，浑身珠光宝气，一眼看上去很俗。</p><p>　　这种打扮，不是恶趣味就是暴发户，对于这类人，不用说江寒讨厌，苏雨歆这样的大家闺秀更是很反感，不过人各有志，不管如何架不住人家喜欢。</p><p>　　不论是江寒还是苏雨歆，他们都不是稚嫩愤青，也知道走过人来人往，不喜欢也得欣赏，避开就是，没必要闹什么纠纷。</p><p>　　不过走进来的这个金链子大哥看到苏雨歆的一刻开始，眼神就移不开了，也不管旁边佳人不断皱眉，他一直盯着苏雨歆。</p><p>　　这种目光让苏雨歆非常不自在，但看看又不犯哪家的王法，她也没有什么办法，江寒自然看到了这种情况，只是他接受了巫医道传承没有多久，还没有完全转换成修士的角色，面对这种情况没第一时间站在修士角度来思索解决方法。</p><p>　　似乎是发现了苏雨歆不喜的样子，这金链子大哥干笑一声，带着旁边年轻女人走进店里，“这排，这排，全包起来。”</p><p>　　闻言店员很吃惊，像是听错了一样，疑惑看着金链子大哥。</p><p>　　“愣着干嘛，快去啊。”金链子大哥眉头一皱，对待这些普通店员他就没什么好脾气了。</p><p>　　“门口这位小姐，常言道，相逢便是有，有啥来着了，忘了，总之见到你很高兴，你随便挑一排吧，大哥都送你了。”接着他在远处对着快要离开服装店的苏雨歆开口。</p><p>　　也不顾旁边年轻女人的脸色，这金链子大哥说完又盯上了苏雨歆，那年轻女子虽然很不开心的样子，不过到底还是没有说什么，至于为什么，这买大牌衣服轮排买的金主可不是那么好找的。</p><p>　　“小子，上啊，该你动手了，把这店买下来送你那小妹子。”如果能够看到那人的话，他真的会一巴掌拍过去。</p><p>　　苏雨歆身体有些颤抖，显然是被气得不轻，她转过身来，不经意用余光扫了江寒一眼，心中有几分叹息，不得不说，她对江寒的表现不满意，不过她很快就释然了，江寒的出身和身份就摆在那，这种情况又能怎么样。</p><p>　　狠狠瞪了那金链子大哥一眼，“我们走。”</p><p>　　说完大步走出了服装店，江寒担心她，赶紧跟了上去。</p><p>　　“哼，穷逼一个。”金链子大哥鼻哼一声，声音虽小，但江寒还是清楚地听在了耳中。</p><p>　　江寒摇了摇头，没有说话，就算是竞争，也要分清楚对象，比如跟一头猪比哪个能吃？比的结果还重要吗？ </p>'",
        "'第18章 世态最炎凉'",
        "'<p>　　大话西游中有一段台词，“我知道有一天，他会在一个万众瞩目的情况下出现，身披金甲圣衣，脚踏七彩祥云来娶我”，再往下还有一句，“这不是神经病！是理想”。</p><p>　　这不是紫霞一个人的梦，大概所有的女生都有过这么一个梦，而江寒的表现在苏雨歆眼中，真的算不得是盖世英雄，即便她很想理解他，但她也只是个普通的女孩子，那种情况下江寒选择沉默，她又怎么能轻易释怀。</p><p>　　之后苏雨歆都有些闷闷不乐，而江寒这个木讷的糙汉子，显然没有发现真正的原因，两人好好的一次“约会”就蒙上了一层阴影，这显然是谁都不愿意看到的。</p><p>　　不过苏雨歆只是个女生，就算她机灵一些，但很多事情是不能由女生来主动的，而现在江寒则是个不解风情的糙汉子，不是不想调节气氛，而是他根本不知道怎么做。</p><p>　　两人的一餐饭味同嚼蜡，两人兴致都不高，如果这样下去的话，这约会只怕要不欢而散了，这不是江寒的意思，他约苏雨歆出来是想要感谢她两次帮忙的，至于她的身份，江寒觉得到没什么，她不愿意多说，他也不会主动去问。</p><p>　　快要吃完的时候，江寒收到了一条信息，一看是陶主任，信息的内容就是告诉江寒，晚上不用去给姜主席做按摩了，她临时有事提前出院了。</p><p>　　江寒蹙眉，糖尿病发病不是闹着玩的，没有稳定下来怎么能够轻易出院，要是再犯的话，后果不堪设想，医院肯定把这个告知了姜佩琪，她还是出院了，江寒没想通，到底有什么大事，犯得着如此冒险。</p><p>　　看到江寒的举动，苏雨歆开口询问了一句，总算是打开了话题，江寒把这件事的缘由从头给她说了一遍，两人开始有一句没一句的聊着天。</p><p>　　这个时候江寒是很想找之前教他个声音求助的，不过事与愿违，他根本不知道怎么沟通那人，甚至他还在不在江寒也不能确定。</p><p>　　那家伙最后一句话，但是江寒觉得是胡扯，可现在一想，一点毛病没有，如果他足够有钱，就买了那服装店，不为什么，就为搏红颜一笑。</p><p>　　想到这里，江寒似乎有些理解，为什么古代有君王愿为佳人一笑倾城，因为这种感觉实在太难受，而对于帝王来说，可能还是丢一城比较容易接受吧。</p><p>　　嘿，说到底，还是权钱，世人都说烂俗，却世人都不能逃得过。</p><p>　　“前两次，多谢雨歆你帮忙了，有什么我能效劳的，决不推辞。”江寒提起了之前实习和派出所的事，郑重道谢。</p><p>　　苏雨歆从服装店出来之后难得的一笑，“也不是什么大事，没关系了，不过学长执意要谢我嘛，我也不能推辞了，送我个礼物吧。”</p><p>　　“我整个人都在这里了，你看能拿去换个什么，尽管动手就是了。”江寒也开了个玩笑，满口答应。</p><p>　　“不吹不黑，学长，你区区一个男人，肯定没人要的。”说完苏雨歆掩嘴笑了起来。</p><p>　　两人吃完饭走在中心街道，苏雨歆说要的礼物还没想好，边走边想，正午时分，阳光有些刺眼，走在没有遮挡的地方还有些晒。</p><p>　　两人手中捧着“bobo”冷饮，气氛也恢复了很多，走到一处商业广场的时候，他们发现那里围了不少人，以国人喜欢看热闹的特性来说，肯定有什么值得驻足的事发生。</p><p>　　江寒本来是不想过去搀和的，但苏雨歆兴致很高，这个节骨眼上他可不想再惹他了，一句话也没有说，两人走了过去。</p><p>　　这是广场一楼的大厅中，人群中间有一个光头胖子躺在地上，江寒跟苏雨歆围上来的时候第一眼就认出了那人，正是刚才的金链子大哥，刚刚还好端端的，怎么一会不见就躺在这了。</p><p>　　旁边那年轻女人不断抽泣，显然是刚才哭过，他们在这里等着救护车，旁边的人没有一个敢上前的，这种事谁敢管，一个不好好心只会害了自己下半生。</p><p>　　如果没见到也就算了，既然被江寒撞见了，这种事情他绝对不会看着不管，他一直都有觉悟，他是一个医生，如果有健康的生命在自己眼前受到威胁，那是对他的挑战，他不会逃避。</p><p>　　走出人群，江寒向着中间两人走了过去，苏雨歆有些侧目，她父亲是副市长，整个苏江市发生的事，她基本都能够摆平，所以不会像普通民众那样担忧被“碰瓷”，可他没想到，之前在服装店一言不发的江寒，这种时候却没有一点犹豫走了上去。</p><p>　　看到他接下来的举动，苏雨歆突然发现心里出现了一个影子，这个影子形象就是江寒，她看到江寒快步走到那两人面前迅速俯下身子查看那金链子大哥。</p><p>　　之前服装店中，金链子大哥嘲讽江寒，江寒不会这么快忘记，不过当人命和自己面子放在天平上的时候，他永远只会选择人命。</p><p>　　经过江寒探查，他发现这金链子大哥在发烧，整个人陷入了休克状态，严格来说的话到不是很严重，稍微做下应急处理，修养一些时间就能够无恙，重点是昏迷的原因。</p><p>　　江寒向年轻女子询问，年轻女子告诉他，他们中午在一家很高档的餐厅吃完饭，下午是打算包场看电影的，可来到这商业广场的时候，金链子大哥突然倒地，浑身烫地厉害，周围人只有打了120，没人敢帮忙，她一个人也挪不他，只有在这里等待救援。</p><p>　　病了的，又何止金链子大哥，周围人心的病，只怕才是无药可医。</p><p>　　越听江寒越觉得不对劲，突然发烧倒地，这种症状他想不到有什么病症符合，不检查的话没法确定，不过让发烧的人一直躺在地上是大为不妥的，他也不管旁人议论，把金链子大哥扶起来，搀着放到了一旁供游人休息的长凳上。</p><p>　　你们在这等着救护车吧，尽快到医院检查一下，我也不知道他到底怎么了，说完之后江寒转身走向了苏雨歆。</p><p>　　刚刚才见过的人，年轻女子不会忘记，她认出了江寒，没想到在这种时候站出来帮他们的，是他身边的人刚刚嘲笑过的，世间事，谁能说得清呢。 </p>'",
        "'第19章 终结和起始之地'",
        "'<p>　　看着江寒向自己走来，苏雨歆心中五味杂成，没错，她看到江寒没有半点犹豫就做了这件事，没身份，没地位，也没钱，面对这种情况的时候，他想都没想就去帮助了别人。</p><p>　　那人还是让他们都很反感讨厌的人，这种行为本身就代表了一种人格和道德的极高境界，如果不是发自内心的善良，又怎么可能有这种行为。</p><p>　　苏雨歆现在已经完全原谅了之前江寒没有站出来的行为，她终于是说服了自己，他不会表现，只能说是他根本没想过要表现，只能说他本来就是这样的人，而一个人，又怎么能做“不是自己”的事呢。</p><p>　　有种情绪叫“莫名”，苏雨歆现在就莫名有种想要流泪的冲动，但看着江寒她却笑了起来，他就是他，跟一开始认识的时候并没有什么不一样的，不是吗？</p><p>　　没有了心结，下午时光两人过得很愉快，就像是两个亲密的老友，没有什么尴尬地气氛，江寒在这一天也尝试了很多人生中的第一次，不得不说，这么多第一次堆积在人的记忆中，足够产生很大的影响。</p><p>　　而陪他经历那么多第一次的人，也势必会深深印在他的脑海深处，也许日后分离太久，谁都忘了谁的名字，但只要再次触碰这些记忆中的东西，只怕也会第一时间想起。</p><p>　　不然怎么会说：不管爱还是恨，女生都会记住给了第一次的那个男人一辈子。</p><p>　　因为不用再给姜佩琪做按摩，两人晚上也安排了活动，VR风潮掀起已经有一段时间了，不过江寒还从没有体验过，苏雨歆对这种东西的热情也很高，他们去了一家不错的体验馆。</p><p>　　VR游戏，想要玩好和一般的还是有点区别，除了游戏意识之外，更多还需要身体和控制设备的同步、配合能力，也就是俗话说的眼手反应能力。</p><p>　　尝试几次，江寒迅速上手，凭借过人神经和肌肉协调反应能力，他了解规则之后玩起这些游戏简直太轻松，接连不断地刷新了最高分。</p><p>　　最后苏雨歆把头盔一摘，“不玩了，你以后都别我约我玩游戏，太伤自尊了，你怎么那么可恶啊？”</p><p>　　“哎，学妹，讲道理啊，我刚才可没耍赖。”江寒冤枉。</p><p>　　“还叫没耍赖，你把每次攻击的地方，我能够预判手都够不到防御，还不算？”江寒提起这个，苏雨歆就来气。</p><p>　　“我这是合理利用自己优势，我学外科的，还不能让我发挥知识了啊？”江寒摸摸头，没想通为什么苏雨歆这么暴躁。</p><p>　　之前两人玩对打游戏的时候，江寒每次攻击的地方都是人体难以回防的极限，游戏中的虚拟人物倒是没什么条件限制，只要操作能跟上，又有这个设定，就算让他两个手臂打个结都行。</p><p>　　不过这种虚拟现实游戏需要人体相应操控，虚拟人物是能做到，但不代表苏雨歆也能，所以，十几场对战，她一场也没赢，机会都是被满血KO，换谁不得急啊。</p><p>　　苏雨歆心中暗怒，这个白痴学长真的太不解风情了，竟然玩个游戏都跟女生认真，还一把都没让！</p><p>　　天色已经暗了下来，江寒拿着一堆破纪录的奖品跟苏雨歆走在街上，这些东西到不是很值钱，想买的话也容易，不过这跟娃娃机里的娃娃一样，抓来的和买来的，区别很大，因为前者还代表了一种“荣誉”。</p><p>　　江寒执意要是送她回家，苏雨歆没有拒绝，两人叫了出租车，苏雨歆说了个地址，没过了多久，两人下车，江寒意外的发现，他们下车的地点，就是他跟苏雨歆在这个城市第一次见面的地方。</p><p>　　也是在这里，江寒遇到了那位老道，得到了天仙难求的巫医道传承，说这里是他结束和起始的地方，一点不为过。</p><p>　　结束了平凡的前半生。</p><p>　　开始修行路上的生涯。</p><p>　　“我家在前面不远的地方了，就到这里吧，你一会回去的时候自己小心。”苏雨歆手上只抱着一个史迪仔，那一堆东西江寒也不想要，干脆直接送给了出租车司机，司机大叔也正好免了他们的车费，算是他大赚一笔。</p><p>　　“好，那你快回家吧。”江寒把手中一袋衣服给了苏雨歆，摆摆手，并没有多说什么。</p><p>　　“今天很开心，谢谢学长。”苏雨歆接过衣服，甜甜一笑之后转身离开。</p><p>　　“我叫江寒，你就叫我江寒吧。”</p><p>　　看着苏雨歆消失在夜空下，江寒并没有着急回家，他走到了遇到老道的地方，回想起这不到半个月的经历，大起大落，他也因此成长了不少。</p><p>　　假设没有获得巫医道的传承，自己如今会是什么模样？江寒随便一想就得出了答案，必然是跟众多梦想破碎的青年一样，开始为生活的奔波，什么梦想，什么抱负，空着肚子的时候，还不抵一碗汤面。</p><p>　　“巫医道的传承，必须要全部获得！”江寒咬牙，之前那虚影告诉他，有考验期，如果没能达到要求的话，他将失去资格，经历不少，江寒发现，自己不能缺了这种传承，一定要成功。</p><p>　　“嘿，我还以为你再不会回到这里呢。”一个熟悉的声音响起，江寒看到了老道，白幡和以前一样，他神态也半点没有改变。</p><p>　　可他之前明明看到这里什么都没有，想到这个的时候江寒自嘲地笑笑，这个时候了还讲什么科学。</p><p>　　“老先生，之前您一声不响就消失了，我想感谢都没机会。”江寒微笑着点了点头，很有礼貌。</p><p>　　“哟嚯，稀奇了，现在怎么不叫我老骗子了？”老道一撇嘴。</p><p>　　“我也没那么叫过啊……”江寒心虚，不敢真的说出来。</p><p>　　“不管你叫没叫过，你就是那么想的，别以为老夫不知道。”老道有这识人心的能力，哪能让江寒有狡辩的机会。</p><p>　　“算了，懒得跟你计较，我一直在等你，你还不错，比我预想来的早，也算是你小子的福气。”老道摸着胡子，笑盈盈开口。</p><p>　　“老先生，您的意思是？”江寒不解老道是什么意思。</p><p>　　“嗨，你难道还想单靠自己就成功踏入炼气之境。”老道冷哼了一声，到不是生气。 </p>'",
        "'第20章 炼气就是炼体'",
        "'<p>　　江寒明显不解老道所说的意思，“炼气之境，还需要别人协助才行吗？”</p><p>　　“哼哼，寻常修炼功法自然是不需要的，不过巫医道得天独厚，如果没有人从旁协助，别说能不能炼成，妄自尝试只怕你自己小命都堪忧。”老道哼哼说道，不像是开玩笑的样子。</p><p>　　江寒听到这里心中一颤，竟然还有这种隐患，如果今天不是恰好送苏雨歆回家，如果不是恰好在这里下车，他不知道自己什么时候才会再次来到这个地方。</p><p>　　而老道之前分明说在他一直在这里等江寒，也就是说，如果江寒不来，老道可能也不会主动去找他，之前他并不知道这有什么意义，不过现在他接触到的世界不一样了。</p><p>　　冥冥之中存在着缘分这种说法，强求而来的，最不能有结果，老道绝非凡人，他如此行事必然有很大的道理，不过是江寒想不到而已。</p><p>　　“老先生，那我该怎么做？”江寒谦逊开口询问。</p><p>　　“现在时候还不到，你怎么做都行，不过有个原理你必须明白，炼气就是炼体，看似毫不相干，实际上息息相关，多的我不能再说，那些规则很麻烦。”老道难得做了个严肃的表情。</p><p>　　“炼气就是炼体。”江寒小声嘀咕，他现在还是引气入体的境界，连炼气的功法都不知道，更别说能够理解其真意。</p><p>　　“巫医道修炼需要具备巫灵根，而这巫灵根实际上和普通的五行灵根是不一样的，所以巫医道的修炼之法，虽同样是炼气修真，但也有很多不一样，其中妙处众多，至于到底如何，你日后若有机会获得完整地传承，自然会知晓。”老道边说一边拿起了一旁的白幡。</p><p>　　“老先生，这功法修炼极致，真的能成仙吗？”江寒不知道该说什么，对于修炼一途的事，他只是初窥门径，并很多东西都不了解，老道所说的不同他也并不知道，只是这个疑惑他还非说不可，困惑他很久了。</p><p>　　“我就站在你面前，你觉得那是真是假？”老道并没有正面回答，说完之后看着江寒笑得有些玩味。</p><p>　　江寒脸上疑惑之色更甚，老道这回答相当于没有回答，反倒是让他更不明白了，这是什么意思，难道这老头是仙人，或者是别的什么，江寒不明白，还想要再问。</p><p>　　“小伙子，你要知道天机不可泄露，就算老夫我天纵神武，但还是不能说太多，麻烦啊，很麻烦，所以你也就不用再多问了，时候到了自然会知道，或者可以自己猜着玩。”老道能够得悉别人心中想法，不待江寒发问他已经先开口阻止。</p><p>　　江寒低头沉吟少许，眼下确实是没什么好问的，就像是一门学科，连入门知识都没有掌握，便向大师请教难题如何解答，显然即便大师解答了，自己还是不懂，踏踏实实先学好基础才是真的。</p><p>　　再次抬头的时候，那老道跟上次一样，完全不见了踪影，江寒也没有寻找，对方如果不想让他看到，那他做什么都是徒劳。</p><p>　　时间还早，江寒没有着急坐车回去，他慢慢走在街头，行人渐行渐少，华灯盏盏，灯红酒绿，白天的城市在人声噪杂中喧嚣，夜里则是对酒当歌的吵闹。</p><p>　　江寒一人走在回家的路上，思绪飘忽，跟苏雨歆有关，她是个机灵的小学妹，江寒不知道对她到底是什么样的感觉，是喜欢吗，嗯，应该是喜欢的，只是没法确定这喜欢的程度，难道是那种喜欢？</p><p>　　江寒没法确定，摇摇头，暗叹自己到底在想什么，她肯定只是当自己是个印象还不错的学长，虽然没问，但江寒对于苏雨歆的身份已经猜测到了个大概，必然是富贵家庭，自己还是趁早绝了那种心思比较好。</p><p>　　乱七八糟，江寒最后都不知道想到了什么地方去，不知不觉他已经走了很远一段路，即便在这个城市孤身一人，不过现在的江寒已经不觉得生活难熬了，好同事，好朋友，好工作，一切都向着好的方向发展。</p><p>　　第二天，苏雨歆一早就离开了家门，按照跟父亲的约定，她今天要到之前说好的地方去，要不是江寒约她，她昨天就已经跟父母一起前往了。</p><p>　　那是一个度假圣地，但不是一般人能够去的，先不说消费高得可怕，那地方只对少数人开放，如果没有足够的身份，有钱也不能去。</p><p>　　这种地方自然不可能跟大众经典一样，想自拍一个，结果却变成了跟一群人的合照。</p><p>　　昨天她很开心，先是见识到了江寒抓娃娃的技术，简直绝了，虽然后来因为服装店的事让他对江寒表现很失望，心情也不好，不过在商业广场见到江寒行为之后，她已经放下了所有的芥蒂，并且江寒在她心里的形象也高大了很多。</p><p>　　坐在车上，她想起了之前父亲跟她说的话，一时间不免有些脸红，跟江寒不一样，苏雨歆自己能够确定，她是对他是挺有好感的，不过还不能上升到那种喜欢的层面。</p><p>　　父亲一直很忙，平时连回家吃饭的时间都很少，加上她有没在本市上学，只有周末的时候偶尔回来一趟，要不就得等到有学校有假期，这么一来跟父母相聚的时间就更少了。</p><p>　　这次难得父亲假期能休息，她早就答应了陪着父母一整个的黄金周，虽然因为江寒的事耽误了一天，不过也没多大关系，倒是说明了江寒在她心中分量不轻。</p><p>　　度假的那处地方距离苏江市并不是很远，离开市区之后不到一百公里的路程，坐着舒适的商务车，车内放着的音乐是一首《早开的长途班》，超级歌王的作品，苏雨歆疯狂迷恋着他。</p><p>　　这首歌不是当红的歌曲，不过她觉得很有味道，听了很多遍都不会厌烦，而这位超级歌王能够让世界上这么多为他着迷，大概原因之一就是不管什么样的心情，总有一首歌让你看到了自己。 </p>'",
        "'第21章 小虫子'",
        "'<p>　　江寒回到了出租小屋之中，谢过了苏雨歆之后他打算把剩下的时间都全投入到巫医道传承的修炼中去，经过这短时间的观察和体验，江寒有了不少的感悟。</p><p>　　他出生贫寒，虽然被成为大学霸，然而实际上他自己更清楚，实际上他并不是天纵奇才，他学习成绩优异跟天赋甚至没有多大关系，都是用汗水堆积出来的。</p><p>　　有句话：天才是百分之九十九的汗水加百分之一的天赋造就的，但江寒真的非常努力过，所以他更明白那百分之一的天赋的重要性，远远超过了汗水。</p><p>　　很遗憾，他就没有那百分之一的天赋，于是百分之百的努力也没有让他享有天才的称号，只是通过学习前人留下来的东西，学的较为不错罢了，这和天才的意义，完全不同。</p><p>　　正是因为如此，如果没有了巫医道的传承，那他的一生只会这般平凡下去，新闻头条不时就会爆出那些在平凡岗位上做出不平凡贡献的人，但实际上除了短时间内获得人们点赞，过后他们生活依旧回归平淡。</p><p>　　感动了整个朋友圈的环卫工人，被大家称赞点赞之后，还是要在寒风里起早贪黑，不会涨工资，要干的活也不会变少，或许是“中有足乐者”，可抛开这个不谈，客观事实上，他为世界做的贡献依旧只是一段街道。</p><p>　　个人对于个人而言，问心无愧，堂堂正正就不算有错，对于社会而言循规蹈矩，不制造麻烦就是好市民，但对于世界而言，只有发挥了推进的作用，那才能成为真正的价值吧？</p><p>　　诸如百家前贤，诸如历史长河中闪烁的那些巨匠，如果没有巫医道的传承，普普通通的江寒，又怎么可能跟这些人相提并论，没有半点可能性。</p><p>　　要是没有见到，那就不会有想念，现在江寒不仅见到了，更是具备了获得完整传承的资格，这真如老道所说，是一桩大造化，大机缘，他说什么都不想错过。</p><p>　　刚刚获得巫医道传承的时候，江寒并没有太放在心上，只是觉得白得的技能，总比没有好，可不到一个月的经历，见识到了太多区区自己根本没有资格够及的人。</p><p>　　那个莫名声音的那句话，江寒越来越在意，服装店走出来之后苏雨歆的那种状态和表情，他再也不想看到，更加不想看到再有人因为他而那样。</p><p>　　“世界上任何不利局面，都是当事人力量不足而导致的，你从没踏足过那些富贵人的圈子和领域，不会用他们的方式解决问题也无可厚非，不过现在你应该知道了吧，有些战争，尽你全力也没法获胜，只因为你的全力，微不足道。”</p><p>　　江寒心中所想，被老道之外的另外一人得悉，现在开口说话，这个声音江寒不陌生，白天在服装店就是他开口教的他，只是后来江寒再没发现他的存在，现在又开口说话了。</p><p>　　“你是谁？”江寒转头看向四周，这回是在自己房间中了，四周一样看不到任何不寻常的东西。</p><p>　　“先别管我是谁，你是不是瞎？大哥不就在你肩膀上吗？还找啥呢。”那声音再次响起，带着几分无奈。</p><p>　　江寒听到这话之后低头看向自己肩膀，两边都仔细看了一遍，什么也没有发现，眉头微皱，“我怎么没看到，你在哪边？”</p><p>　　“废话，你还盯着肩膀怎么可能看得到，我现在在桌子上。”那声音说的话，让江寒忍不住想打人。</p><p>　　小屋中只有一张桌子，就在床边，江寒把头凑过去盯着桌面，终于看到了……</p><p>　　一只虫子？看的不是很清楚，江寒揉揉眼睛，睁大了眼睛，终于看清楚了桌上的小东西。</p><p>　　确实是一只虫子，只不过这个样子的虫子他是从没见过，两足站立，四只手，还有手指，这样的虫子，说出去谁敢相信。</p><p>　　头上长着一对鹿角，两只大眼睛占了一张脸的三分之一左右，关键那一张人脸看上去太过魔性了，身体则是像泡泡龙那样，只不过比泡泡龙瘦点。</p><p>　　“没礼貌，盯着一个不认识的人这么看，要是换成是女生，立马给你第一印象扣一半分，想要勾搭就难上加难。”这个小虫子口吐人言，开始数落江寒。</p><p>　　江寒苦笑，要是说别的他还可能会回嘴，说道这个话题，他是见识过这小虫子的实力的，这话他没法接，只能呵呵。</p><p>　　“算了算了，大哥不跟你计较，咱们打开天窗说亮话，我知道你身上有巫医道的传承，我们打个商量，如果你肯把它让给我，我能保你在失去传承资格之后依旧无恙，这是其一，此外，你一生中，想要什么我就给你什么，这是第二。”小虫子开口说的话听在江寒耳中，对他造成的冲击和震撼可想而知。</p><p>　　“你怎么会知道巫医道？”江寒疑惑，这虫子会说话本来就够扯淡了，还不用说长成这样的虫子，加上它竟然知道自己能够传承巫医道，由不得他不震惊。</p><p>　　“你别管我怎么知道的，这不是重点，重点是我跟你说的话，你好好想想。”小虫子背着手在桌子上来回走，等着江寒回应。</p><p>　　江寒舒了口气，这不是小事，他需要仔细想一想，巫医道传承，他现在不算完整获得，只有半个传承资格，如果在不足一年的时间里他不能达到要求，便不能获得这传承，他自己也要身死。</p><p>　　通过刚才的话，江寒判断出小虫子知道巫医道，更知道传承失败的后果，而它所说的话，是能够保江寒无恙，更是许下承诺，满足他所有的要求。</p><p>　　听起来真的很不错，没有生命危险，更可以坐享一切，这小虫子知道得这么清楚，自然不可能是想要假意欺骗他，从而得到他的巫医道传承，应该很可信。</p><p>　　这种条件对于一个普通人来说，诱惑之大简直无法想像，不用劳心费力，甚至能够成为世界之王，拥有全世界最高的权力最多的财富最多的最美的女人。</p><p>　　说不动心，那不可能，江寒只是半吊子的修士，思考方式都还没有转型，他同样动心，所以才需要思考。 </p>'",
        "'第22章 巫医道'",
        "'<p>　　“不，我拒绝。”江寒咬牙吐出了这几个字，没人知道他心中挣扎，不过那都不重要了，重要的是他最终的决定。</p><p>　　“哈，你说啥？你你你，给你个机会给我好好再说一遍。”小虫子张大嘴，显然是表示不能够理解江寒为什么会做这种决定。</p><p>　　“我说了，我不给。”江寒再次回答没有任何犹豫，斩钉截铁。</p><p>　　小虫子明显焦虑了不少，“这样，我再加一个条件，不管你遇到了哪个漂亮小妞，你跟大哥说一声，手把手教你撩到，亲身体验征服她的快感，永久有效，怎么样？”</p><p>　　像是下了很大决心，小虫子终于说出了这个条件，感觉已经是做了很大的让步一样。</p><p>　　“不行，你说什么我都不给。”江寒言辞拒绝，他已经想清楚了，可能这小虫子说的都是真的，确实，如果他答应了的话也能够更轻松，更轻易的满足所有，得到所有想要的。</p><p>　　可那还有什么意义呢？人活一世，那样的话就没有任何可以追求的，不劳而获的感觉短时间内可能会很爽，不过却经不起时光，留下的只有空虚，那不是他想要的。</p><p>　　“哎我说你那榆木脑袋是怎么长的，这么简单的选择题你硬是要给做错了，你气死我了。”小虫子指着江寒说话的时候不断点着头。</p><p>　　不管这小虫子说什么，江寒就是不答应，巫医道传承事关重大，他仔细从头想了一遍，这是他能够不凡的根本，绝对不能放弃，就算一年时间到了之后他最终没能获得接受完整传承的资格，那也只能说是自己真的无缘。</p><p>　　而如果自己主动放弃了，就是另外一种性质了，江寒如此想法可谓正确至极，传承者能获得传承，最重要的就不再是传承，而是传承者本身，术和法都只是手段，根本是人，是心，是信念，是道。</p><p>　　“算了，你小子是不见棺材不落泪，你别以为这传承资格是简单就能获得，一年时间内你如果不能把炼气转化成炼体，到时候小命不保。”小虫子叹了口气，如果能用强的话它早就动手了，无奈碍于某些规则，他只能选择这种方式。</p><p>　　“我知道困难，但不试试的话，我不甘心，你不用再说了，我决定的事情不会改，倒是我很想知道，你想要这巫医道的传承做什么？”江寒铁了心不跟小虫子做这交易。</p><p>　　“唉，也罢也罢，让你自己体验一次你就知道了，你我有缘相见，大哥就白送你一场造化，如果获得传承之前你感觉不行，就算到了最后关头，你也可以叫我，之前说的条件依旧不变，不要让这种传承再游荡在虚无中，我追着它都快厌烦了。”小虫子摇摇头，人性化地摇摇头。</p><p>　　“至于我，哼哼，说了名头怕吓到你，就不多说了。”小虫子哼哼一声，声音高傲。</p><p>　　之后跟小虫子交流之中，江寒得知了它名字叫龘龗，具体的来历它没有告诉江寒，还说现在的江寒没资格得知那种秘密，不是开玩笑的，说不定在知道这个秘密的下一秒直接就被雷劈了。</p><p>　　这就是所谓的天机不可泄露，以前江寒听到这种话的时候还以为是说话的人搪塞借口，或者干脆是说话的人自己都不知道才故弄玄虚，现在看来，可能冥冥中真的存在什么，主导一切。</p><p>　　龘龗还还告诉江寒，在他正是接受巫医道传承考验之前，它会一直跟在他身边，要是有什么必死的局面，也好方面用巫医道传承来换一条小命。</p><p>　　“如果我真的成功获得巫医道传承了呢？”聊到了最后，江寒发问。</p><p>　　龘龗罕有的神色一正，听到江寒这个问题之后，它似乎也是陷入了沉思，“如果你真的成功获得了巫医道的传承，那我希望你答应我一件事。”</p><p>　　江寒一愣，他自从认识这个小虫子开始，就没有见过它还有正经的时候，这个时候见到，他不免有些意外。</p><p>　　“什么事？”</p><p>　　“现在说了也白说，到时候再说吧，没准到时候我换别的事了也说不定。”龘龗一撇嘴，抬头看着上方，似乎能够透过十几层天花板看到天空一样。</p><p>　　就这样，江寒身边多了一只小虫子，龘龗。</p><p>　　它的实力修为有多强大，江寒并不知道，不过所谓“撩妹”的本事，它自称在这条路上早就登峰造极，早就已经无敌的寂寞于天下。</p><p>　　在他口中，那些自称的把妹达人在他面前就是渣渣，随便都能够完暴几十条街，江寒知道它一番话可能有不少水分，不过这本事多半是真的很强。</p><p>　　有这样的一个虫子在身边，似乎也是很不错的，至少对于拜托单身状态，大有裨益，真的碰到什么无法解决事情的时候，说不定也只能送出巫医道了。</p><p>　　之后江寒开始了自己的闭关，针对于他脑中传承的大量信息，他开始了不断的探索的研究，把目前能够触及所有古中医学术，修炼之法，一一梳理。</p><p>　　里面有关“巫”的那些东西他却一点都不能触及，这是巫医道传承真正核心的大秘密，没有获得完整传承资格的时候，不可触及。</p><p>　　通过对巫医道传承的越发了解，江汉知道了巫医不分家，“巫”和“医”的境界只可相辅相成，根本都是一样的，如果单独拿出一个来，倒也不是说不可以，但但巫医的真谛就难免不全，终究无法达到完美。</p><p>　　巫医道讲中医古术，博古通今，原理更是涵盖了大到宇宙，小到芥子的种种原理，想要完全理解，需要一段很长的时间，如果真的获得这种传承，则必须要有漫长的寿命支持研究。</p><p>　　这就是为何巫医道同样有炼气修炼功法的缘故，其中很多手段，早就超越了凡人之手，原理也非凡人能够理解，也就是说，修为境界同样非常重要，不可落下。</p><p>　　这是一条道，不知道前人是不是已经走到了极致，江寒如今踏上，能做的就是延续前人道路，先走到那个极致，站在前贤的肩膀上，才可能看到更广阔的世界。</p><p>　　这巫医道的世界，必然精妙无双。 </p>'",
        "'第23章 突破失败'",
        "'<p>　　巫医道传承中，太上洞玄诀是主要的修炼法诀，里面所说的第一个境界便是引气入体，江寒已经成功做到，算是半只脚踏入了修士的行列。</p><p>　　引气又分为了三层境界，如今江寒算是达到了引气的第一层，他能够涉及到也只有引气入体的修炼之法，这次闭关他打算的就是突破第一层，达到第二层之后能够掌握一些小法术，那时候将初步涉及到五行之力。</p><p>　　意义重大，现在江寒处在引气第一层的境界，并不能够使用什么五行法术，一些小手段对战斗力也没有神提升，身体强度柔韧性各方面是有了显著的提升，但本身的力量则没多大提升。</p><p>　　突破到引气二层之后，各个方面都会有一定的改观，还有个重大的作用，就是一种医道手段，他准备帮助姜佩琪治疗糖尿病，也确实有术，不过他却不能施展，而到了引气第二层之后，就可以尝试使用。</p><p>　　如果能够治疗糖尿病，那对于一个医生来说，意义就很重大了，目前江寒也需要更多的能力来赚点钱，就目前而言，这东西还是能够解决差不多是所有的难题。</p><p>　　引气之后就是炼气，江寒距离这个境界还远得很，加上老道告诉他，这个境界的修炼很难，如果只靠他自己的话，很难成功，而且有很大的危险，不过老道最后却没说解决的方式，就那么消失了。</p><p>　　还好现在江寒暂时不需要去考虑那些，感受天地间游离天地灵气的方法江寒已经熟记在心，此刻引气入体只是一个重复早就熟练动作的过程，不再费力。</p><p>　　原本江寒以为是因为自己这出租屋所处的环境太差，所以天地灵气很稀薄，然而实际上并不是这样的，江寒在医院宿舍修炼的时候发现也什么变化，天地灵气同样很稀薄。</p><p>　　之后同样的尝试江寒换过好几个地方，没有意外，他到过的所以地方，天地灵气都同样的稀薄，江寒得出了结论，可能整个苏江市都是这种情况，那再换地方也没什么意义了。</p><p>　　这个出租屋还没有到期，不过也很快了，十一黄金周过了之后也就差不多了，江寒打算继续租下去，在这里租房子的都是些没有身份地位并且一天也没有多少空闲时间的人，这些人每天早出晚归，为了生计成天奔波，根本就没有什么闲心关注别的。</p><p>　　江寒修炼说不定就会闹出点什么不得了的动静，在这种没人关注的地方，也能够大大减少暴露自己的风险，总的来说，用于修炼的话还是个很不错的地方。</p><p>　　沉浸在修炼状态中，很快就过了四天的时间，当江寒再次醒来的时候，黄金周已经接近了尾声，睁开眼，其中能够明显看出来充满了疲态，这不是修炼顺利的表现。</p><p>　　江寒用冥想代替了正常睡觉，每次醒来精神都会格外的好，眼下出现这种状态肯定是出了什么岔子，只见他慢慢伸开盘着的腿脚，从床上下地。</p><p>　　刚踩在地上的时候，腿脚竟然有些发软，差点站不住，盘腿太久出现这种情况本来算不得奇怪，因为血液流通受到一定阻碍，瞬间放松的时候回流，才造成了麻木的状况。</p><p>　　可这只是对于一般情况而言，江寒平时也这么干的，一坐就是一整夜，第二天也从没有出现过这种情况，这次却险些站不稳，其根本原因，是因为江寒突破第二层失败了。</p><p>　　太难了，按照太上洞玄诀所述的方法，当体内丹田出灵气凝聚到黄豆大小的时候便能够开始冲击第二层引气境界，江寒一直感受着天地灵气把它们引入体内，压缩成灵力。</p><p>　　这一过程他已经轻车熟路，进行得很顺利，但也花了足足三天的时间才凝聚了黄豆大小的一团灵力，之后按照功法进行突破，只是这接下来的过程就没有那么简单了。</p><p>　　第一次尝试，刚刚开始没多久就宣告完全失败，引气第二层境界，需要凝聚出第二个灵力团，看似很简单，但真正做起来的时候，江寒才发现想是一回事，做又是另外一回事，根本不可同日而语。</p><p>　　第一次失败之后他连续又尝试了几次，同样全部以失败告终，他怎么努力也只能让压缩成的灵力融入已经存在的那个灵力团中，始终没法造出第二个。</p><p>　　一次次的尝试，对他精神的消耗不小，整整一天，江寒心力憔悴，但没成功就是没成功，一点办法都没有，最后他也只能是无奈放弃。</p><p>　　睁开眼的时候一阵虚弱袭来，不光是头有点晕，整个人感觉都有些虚，几天滴水粒米未进，他现在又没达到辟谷的境界，出现这种状况是必然之事，只是之前他一直沉浸在修炼中，没有发觉罢了，现在一放松醒来，几天积累下来的饥渴和疲惫马上爆发了。</p><p>　　江寒努力定了定神才想起来，已经好几天没有吃东西了，拿起手机想要看看时间，发现已经按不亮屏幕，很快他就知道了原因，这么没关机就放了几天，肯定早就没电了。</p><p>　　江寒插上充电器之后直接打开门走了出去，外面天还亮着，不管现在是什么时候，吃饭才是头等大事，江寒感觉现在自己能够吃下一头牛。</p><p>　　走路的时候因为腿脚麻木，几天没有吃东西的虚弱更是让他有种在飘的感觉，再没有上次那种大片既视感的下楼动作，只能扶着楼梯慢慢走下去。</p><p>　　活动活动之后腿脚的麻木感渐渐消失，但脚步轻浮不是一时间能够消除的，找到了一家自助餐店付了款，也不管什么健不健康，江寒拿了一堆东西放到桌上大吃起来。</p><p>　　两个小时后，江寒摸着肚子走出了这家店，在店员异样的注视中他回到自己出租屋内，这一番大吃，总算是填补了上了这几天都没货的胃。</p><p>　　江寒每次吃完自助餐都会有种三天也不想吃东西的感觉，但到第二天饭点又会感觉自己三天都没吃东西一样，不过这次的一顿，他感觉起码有十几天都不想再吃东西。</p><p>　　久饿不宜暴食，这说法对于江寒来说，完全没有什么意义，因为他的身体完全吃得消，饿了只管撑就是了。 </p>'",
        "'第24章 套路得人心'",
        "'<p>　　回到了小屋内，手机已经充上了不少电，开机联网之后，江寒才知道今天已经是国庆的第五天，今天还已经快到晚上了，这一次小小的闭关，竟然花了四天时间，这是江寒没有想到的。</p><p>　　他感觉也没有过了多少时间，这还只是初期引气的修炼，一般来说引气之后是炼气，再之后应该就是金丹元婴什么的，那种时候的闭关，岂不是动辄就是十几年，甚至几十年，果真是山中无甲子，修炼是如此耗费时间的事情。</p><p>　　对于这次突破失败，江寒也没有多少介怀，只是告诉自己好事多磨，通过这次尝试他也掌握了不少有用的方法，下次再尝试的话会轻松很多，恢复了精神之后多试几次，总是会成功的。</p><p>　　现在就继续是不可能了，他现在状态不好，心神损耗不小，需要时间恢复，躺在床上，发现已经有很多条未读信息，打开大概看了看，都进行了回复。</p><p>　　打开朋友圈发现了不少杨梦娇跟刘星发的动态，他们一行人玩的好像很有滋味，其中几条还艾特江寒了，下面有个周围的评论。</p><p>　　“@寒江一曲无忆：学弟，你将会为错过这次旅行而后悔至少三天，因为你错过了学长背包登山的样子。”</p><p>　　下面是刘星几人调笑的互动，这已经是几天前的动态，江寒现在才看到，也就没有评论的必要了，继续往下拉，他看到了苏雨歆也发了个动态。</p><p>　　几张图片，环境非常优美，各种设施看上去非常典雅，一看就不是什么朋友圈爆款旅游圣地，其中还有他们家人的合照，不过却只露出了她自己一个大大的笑脸，看上去是她父母的两人没有露出面貌。</p><p>　　江寒在这条动态之下写了评论，“看上去挺不错的，玩的开心吧？”正准备要发送，龘龗的声音突然响起。</p><p>　　“停停停，你看看，你看看，大哥才一不看着你，这要发的是什么玩意儿，昂？什么玩意儿？”</p><p>　　江寒一愣，仔细看了一遍自己写在输入框里的内容，对啊，很平常的一句话，没什么问题啊，也没有错别字什么的。</p><p>　　“怎么了？”</p><p>　　“唉，臭吊丝，看这样子你平时应该就没少发这种评论，米其林的牌子你是准备挂到什么时候？”龘龗跳到手机屏幕上，很是痛心的样子。</p><p>　　“好好说话啊，发个评论还就成吊丝了，有这种说法吗？”江寒对这虫子是没办法，他尝试过，打不到，捉不到，他的隔空取物之术也没什么作用，所以它也就这么一直嚣张着。</p><p>　　“我可没说发个评论就是吊丝，我是说你是个臭吊丝。”龘龗很不客气，也不管江寒接不接受。</p><p>　　“看你那点出息，我念着，你给我照着写，‘环境挺别致的，就是你脸大，挡住太多风景了，差评/baiy’然后发送。”龘龗摇摇头，看着江寒疑惑的样子，它眼中完全是一幅老师看不争气学生的样子。</p><p>　　“真的要这么发吗，我觉得她脸也不大啊，还有/baiy是什么意思？可别乱说话害我。”按着龘龗说的，江寒写出了这句话，但他怎么看都觉得不妥。</p><p>　　“你管她脸大脸小，有脸就行了，你咋不说她也没挡住风景呢。”龘龗急得跳脚，这种学生，榆木脑袋，“/baiy是QQ表情里的白眼，在微信朋友圈评论不会显示出来，这是常识，常识啊我的哥。”</p><p>　　“那直接发个白眼不就行了吗？干嘛要发显示不出来的，再说她也不一定就知道是白眼的意思。”江寒对于这些事并没有龘龗一样的想法，一时间想不通缘由。</p><p>　　“如果她对你有兴趣的话，不懂她会去百度啊，还会自己尝试用代码写表情，这无形中就完成了一次你们之间的互动，比起直接发个白眼，她对你印象绝逼深刻几分。”龘龗哼了一声，还是给江寒做了解释。</p><p>　　巫医道的传承让江寒脑域开发度都上升了些数值，这种逻辑和原理都不是很复杂的问题，他一想马上也就明白了，思路正确，就是这样。</p><p>　　后面的都不用龘龗再解释，如果对方对自己没有兴趣的话，那发什么都白搭，还不如发个代码膈应膈应她呢，套路，慢慢都是套路，江寒看着龘龗，连一个简单的评论都有这种讲究，他不知道这小虫子对这“撩妹”的学问，到底研究到了什么样的地步。</p><p>　　点击了发送，江寒自己也不知道为什么竟然听信了龘龗的鬼话，明明他对苏雨歆没有往那方面去想，心中所想却逃不过龘龗的法眼，它没有说什么，只是暗中一笑，发都发了，还说没想法，鬼信。</p><p>　　没过多久，江寒微信果然收到了几条信息，一看就是苏雨歆发的，内容是“/baiy”“/Baiy”“\\baiy”一连好几条都是类似的，江寒有些意外地看向了龘龗，“这么神奇？”</p><p>　　说着他手机又亮起，还是苏雨歆，“学长，这是什么意思，我看着像是表情符，怎么打不出来呢？”</p><p>　　江寒拿起手机就要告诉她那是什么，龘龗急忙制止了他，“别忙着回复，过个三五分种，等她百度完了你再告诉他。”</p><p>　　龘龗一说，江寒顺着他的思路一想，马上就明白为什么了，不行了，这简直就跟恋爱游戏攻略女生一样了，问题是还真他娘的可行，江寒掩面，这虫子到底还有多少这种手段。</p><p>　　几分钟之后，江寒按照龘龗说的给苏雨歆发了回复，告诉她那表情符的意思，果然苏雨歆已经知道了，就这个话题为开始，跟江寒聊了起来。</p><p>　　“网聊的第一步，就是打开话题，小子，好好学着。”说完之后龘龗一跳，离开了手机屏幕，不知道到哪去了。</p><p>　　江寒跟苏雨歆聊着天，苏雨歆告诉她明天她就跟爸妈一起回苏江市，然后下午就准备去学校，江寒似乎是受到了龘龗的影响，这个时候灵光一闪，冒出了一句“我送送你。”</p><p>　　那边苏雨歆看到这几个字的时候果然很开心，但接着又有点疑惑，这个学长竟然会想到这个，她有点吃惊，江寒在她印象没这么善解人意才是。</p><p>　　不过这是好事，她欣然答应了。 </p>'"
    ],
    "variables": [
        "data"
    ],
    "comments": [],
    "docstrings": [
        "* Created by Administrator on 2017/2/9 0009."
    ],
    "functions": [],
    "classes": []
}