{
    "identifiers": [
        "org",
        "hisp",
        "dhis",
        "appmanager",
        "org",
        "junit",
        "jupiter",
        "api",
        "Assertions",
        "assertDoesNotThrow",
        "org",
        "junit",
        "jupiter",
        "api",
        "Assertions",
        "assertEquals",
        "java",
        "util",
        "org",
        "junit",
        "jupiter",
        "api",
        "DisplayName",
        "org",
        "junit",
        "jupiter",
        "api",
        "Test",
        "Test",
        "DisplayName",
        "app1",
        "app1",
        "setName",
        "app1",
        "setVersion",
        "app1",
        "setPluginType",
        "app2",
        "app2",
        "setName",
        "app2",
        "setVersion",
        "filteredApps",
        "assertDoesNotThrow",
        "AppManager",
        "filterAppsByPluginType",
        "of",
        "app1",
        "app2",
        "assertEquals",
        "filteredApps",
        "size",
        "assertEquals",
        "filteredApps",
        "get",
        "getName"
    ],
    "literals": [
        "\"filter by plugin type should not thrown a null pointer exception\"",
        "\"app 1\"",
        "\"v1\"",
        "\"plugin1\"",
        "\"app 2\"",
        "\"v2\"",
        "\"plugin1\"",
        "\"app 1\""
    ],
    "variables": [],
    "comments": [
        "given 2 apps, 1 with a plugin type and 1 with none",
        "when filtering by plugin type",
        "then 1 app is returned and no error is thrown"
    ],
    "docstrings": [
        "* Copyright (c) 2004-2024, University of Oslo\n * All rights reserved.\n *\n * Redistribution and use in source and binary forms, with or without\n * modification, are permitted provided that the following conditions are met:\n * Redistributions of source code must retain the above copyright notice, this\n * list of conditions and the following disclaimer.\n *\n * Redistributions in binary form must reproduce the above copyright notice,\n * this list of conditions and the following disclaimer in the documentation\n * and/or other materials provided with the distribution.\n * Neither the name of the HISP project nor the names of its contributors may\n * be used to endorse or promote products derived from this software without\n * specific prior written permission.\n *\n * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\n * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\n * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR\n * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\n * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON\n * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\n * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
    ],
    "functions": [
        "filterByPluginTypeTest"
    ],
    "classes": [
        "AppManagerTest"
    ]
}