{
    "identifiers": [
        "Injectable",
        "Injectable",
        "key",
        "key",
        "key"
    ],
    "literals": [
        "'@angular/core'",
        "'root'",
        "'A Bangu'",
        "'1. De qualquer forma, jeito, de forma grosseira, tosca, às pressas. Ex.: O gaudério se pilchou a bangu (se pilchou às pressas, de forma descuidada, mal acabada).\\n2. De forma descontrolada, sem limites. Ex.: \"Já no final do baile, o bolicheiro começou a me servir canha a bangu!\" (servir à vontade).'",
        "'A La Cria'",
        "'Se mandar a La Cria significa se mandar a Deus-dará, sem rumo, cair no mundo. \\n\\nEx: Ele se mandou a la cria para os EUA, mas nunca esteve por lá.'",
        "'A la fresca'",
        "'Exprime admiração, espanto, surpresa, descrença. '",
        "'A la pucha'",
        "'Segundo o site http://www.alapucha.com.br : Quem é gaúcho certamente já ouviu essa expressão. Usada tradicionalmente quando algo nos pega de surpresa, nos espanta ou nos encanta.'",
        "'A La Pucha, tchê!'",
        "'Exprime admiração, espanto! Quando algo pega o vivente de revesgueio, de surpresa!'",
        "'A troco?'",
        "'Usado no sentido de “por quê?”, “para quê?”. \\nExemplo de uso: \"A troco de que tu fez isso?\"'",
        "'A vaca foi pro brejo'",
        "'Ja era, não vai mais dar certo ou acontecer algo'",
        "'Abagualado'",
        "'Aquele que é bagual, arisco, sestroso, espantadiço. Adjetivo dado ao indivíduo grosseiro, inculto, rústico, amatutado, selvagem.'",
        "'Abaralhar'",
        "'Agarrar, pegar não deixar cair ao solo.'",
        "'Abatumado'",
        "'Um bolo ou pão que não cresceu; pessoa que está desanimada...'",
        "'Abichornado'",
        "'Sinônimo de chateado, doente, deprimido...'",
        "'Abocanhar'",
        "'Apoderar-se indevidamente de alguma coisa.'",
        "'Aboletar-se'",
        "'Instalar-se. Ocupar, indevidamente, determinado lugar.'",
        "'Aborrir-se'",
        "'Verbo português muito utilizado em certos lugares do Estado. Significa aborrecer-se, ficar triste, tornar-se melancólico.'",
        "'Abostado'",
        "'Abobado, bobo, que tem bosta na cabeça, sem juízo.'",
        "'Abrir a graxeira'",
        "'Falar tudo o que sabe ou o ato de vomitar. \\n\\n*Contribuição do Alfabeto de Quaraí. '",
        "'Acabrunhado'",
        "'Entristecido, desanimado, ...'",
        "'Acadelar'",
        "'Se esconder, ficar com medo, desistir'",
        "'Acadelhar'",
        "'Pessoa fica se fazendo para ir em algum lugar ou fazer alguma coisa'",
        "'Acalambrado'",
        "'Intimidado, amedrontado. \\n\\n*Contribuição do Alfabeto de Quaraí. '",
        "'açoitar'",
        "'= bater, surrar'",
        "'Acoleirado'",
        "'Unido o animal a outro pela coleira. Andar uma pessoa acoleirada com outra. Significa andar uma pessoa sempre junto de outra'",
        "'Acolherar'",
        "'Juntar, unir, aparceirar.'",
        "'Acoxambrar'",
        "'Fazer corpo mole, preguiçoso. \\n\\n*Contribuição do Alfabeto de Quaraí. '",
        "'Acrocar'",
        "'Acocorar-se, pôr-se de cócoras.'",
        "'Acuar'",
        "'Latir o cão.'",
        "'Acuierá'",
        "'Muito usada para bailes. O mesmo que aglomeração, juntamento.\\n\"Hoje a noite vamos todos nos acuierá no Clube Farrapos\". '",
        "'Afilar'",
        "'Caçoar, dar vaia, troçar com alguém.'",
        "'Afocinhar'",
        "'Quem “afocinhou” é porque caiu de nariz no chão, tropeçou.'",
        "'Afofar'",
        "'Exagerar, fazer algo em demasia ou com rapidez. Ex.: \"Afofei na bóia\" (Exagerei na comida). Pedido para alguém acelerar a velocidade da viagem: \"Afofa, senão a gente se atrasa\".'",
        "'Afrouxar'",
        "'recuar por medo, acovardar-se, arrolhar. Usa-se em sentido figurado, afrouxar a ponta, como conceder certas liberdades que, no geral descambam para o abuso. '",
        "'Afudê'",
        "'[subst.] Legal, bom. Exemplo: \"Bah, que afude essa música.\"'",
        "'Agalhas'",
        "'Velhacaria, trampolinice, parlapatice, fanfarrice.'",
        "'Agalhudo'",
        "'É o indivíduo esforçado, audacioso, forte, ousado.'",
        "'Agnoline'",
        "'Capeletti dos gringos da Serra.'",
        "'Aguinaldo'",
        "'Décimo terceiro salário. \\'Já recebeste o Aguinaldo?\\'\\n\\n*Contribuição do Alfabeto de Quaraí\". '",
        "'Ajojado'",
        "'Atado por ajoujo, amarrado junto, unido lado a lado. '",
        "'Ajoujo'",
        "'Tira fina de couro usada para prender ou atar coisas '",
        "'Ajudanta'",
        "'Mulher que presta ajuda em qualquer serviço.'",
        "'Ajupe'",
        "'Termo utilizado por tropeiros para estimular os animais.'",
        "'Ala pucha tchê!'",
        "'Expressão usada quando se surpreende com algo.'",
        "'alambrado'",
        "'campo alambrado é o que está fechado por cerca de arame. '",
        "'Alarido'",
        "'Conversa alta; muita gente falando alto, ao mesmo tempo.'",
        "'Alarifagem'",
        "'Ação de alarife. Qualidade do alarife. Proeza do alarife. Esperteza, velhacagem, trapaça.'",
        "'Alarife'",
        "'Sinônimo de: malandro, embusteiro, escorregadio, viscoso, espertalhão.'",
        "'Alarifo'",
        "'Desconfiado, espantado...'",
        "'alarmento'",
        "'Pessoa que chega falando gritando em um local.'",
        "'alçada'",
        "'quando a cadela entra no cio.\\nex.: a cadela está alçada.'",
        "'Alcaide'",
        "'O mesmo que arcaide, que não vale nada pronunciada no interior'",
        "'Alcatra'",
        "'A parte da rês constituída pelos ossos da bacia e acompanhados de alguma carne. Também significa assento: “... e quando se aproximou com a alcatra esbandalhada...”.'",
        "'Alegrete'",
        "'Termo utilizado para se referir àquele que, levemente embriagado, manifesta alegria.'",
        "'Alertar os gansos'",
        "'Dar alarme sobre algo. Despertar a atenção indesejadamente.'",
        "'Alevanta'",
        "'Corruptela da conjugação \"levante\" do verbo \"levantar\". Ex: \"Alevanta, guri! Sai desta cama que o sol já nasceu!\"'",
        "'Aligeirar'",
        "'Ir mais rápido, se apressar. Ex: Te aligeira, guri. (Vamos rápido, te apressa). '",
        "'Alpargatas'",
        "'Alpargata é um calçado do tipo sapatilha, feita em brim ou lona, com solado de corda ou borracha, e que pode ser preso ao pé por meio de tiras de couro, corda ou pano.\\nTeve origem entre os trabalhadores das docas, na França (espadrille) e na Espanha (alpargata). Foi moda na década de 1980.\\nAs alpargatas podem ser usadas tanto por homens como por mulheres. Pode servir também como substituto da bota no traje típico dos gaúchos.'",
        "'Amanar'",
        "'Ficar mano a mano no jogo; ficar em igualdade de condições.'",
        "'Amanda bobona'",
        "'\"Amanda bobona\" significa Menina levada, bobinha, brincalhona e muito lezinha, mas amável e muito especial.'",
        "'Amargo'",
        "'Como o mate chimarrão é chamado no Rio Grande do Sul. Mate amargo, mate sem açúcar.'",
        "'Amasiado'",
        "'Diz-se do homem que possui uma relação estável, porém não oficializada pelo matrimônio'",
        "'Amolado'",
        "'Sinônimo de doente'",
        "'Amuado'",
        "'Triste. Melancólico.'",
        "'Andaço'",
        "'Diarréia forte e duradoura'",
        "'Aperriar'",
        "'Ato de incomodar, apressar'",
        "'Aplastado'",
        "'Aquele que está cansado, abatido, esmorecido, fatigado, desanimado.'",
        "'aprochega'",
        "'1- se aproximar, chegar perto\\nEx: te aprochega ai e toma um mate tche\\n'",
        "'Aprochegar'",
        "'Chegar perto, unir-se.\\n\"Te aprochega aí vivente.\"'",
        "'Apruma'",
        "'Arrumar/Ajeitar.... Te aprume índio veio que o baile hoje começa antes'",
        "'Apurar'",
        "'apurar\\nvtd e vpr Reg (Rio Grande do Sul) 1 Apressar o passo. 2 Dar mais pressa ao que está fazendo. 3 Ficar sobrecarregado de serviço.'",
        "'Aquerenciado'",
        "'Termo utilizado para se referir a um animal que está acostumando a viver em determinado lugar, ou em companhia de outros animais. Também é utilizado para se referir a pessoas.'",
        "'Aragano'",
        "'Pessoa sem rumo, preguiçosa, vagabundo.'",
        "'aragem'",
        "'Em gauchês, sinônimo de neblina fria, \"sereno\", orvalho. Assim, quando a mãe manda o guri entrar pra dentro de casa por causa do frio, ela diz: \"Sai do sereno guri!\" ou \"Sai dessa aragem, vai pegar uma gripe!\".'",
        "'Araqüê'",
        "'Expressão de indignação muito antiga, com o mesmo significado de \"oras pois\", \"que droga\", etc. Pode ser vista no filme \"Anahy de las Misiones\", que retrata a fala gaúcha na época da Guerra dos Farrapos, no que se chamou de dialeto guasca. Ainda usada em locais interioranos da região das Missões hoje em dia.'",
        "'Arigó'",
        "'[s.m.] Burro; desastrado. (ex.: O arigó deixou cair todos os pratos no chão.)'",
        "'Arrancar os olhos e lamber o buraco'",
        "'Cobrar muito caro por algum produto ou serviço. '",
        "'Arrancar pessegueiro'",
        "'Expressao utilizada para dizer que algo é muito bom. Ex. O baile estava de arrancar pessegueiro.'",
        "'Arrastando as alpargatas'",
        "'Realizando trabalho com exaustão, cansaço.'",
        "'Arrastinada'",
        "'Muito ofendido, maltratado, humilhado... a resto de nada. '",
        "'Arrear'",
        "'v. tr.\\n1. Realizar algo muito difícil.\\n2. Fazer algo muito bem feito (ver também \\'se puxar\\').\\n(ex.: Bah, ele se arreou fazendo aquele golaço no grenal.)'",
        "'Arreganhada'",
        "'Mulher muito sorridente, muito dada\\n\\nAplicação\\n\"Mais arreganhada que gaita de bolicho\"\\n'",
        "'Arregar'",
        "'Ficar com medo.'",
        "'arreio'",
        "'peças com que se arreia um cavalo para montar. '",
        "'Arrepoiado'",
        "'O vivente caiu de cara no asfalto e ficou todo arrepoiado'",
        "'Arrodião'",
        "'Derrota vexatória, dificuldade de obter êxito em alguma coisa.\\nExemplo: O fulano levou um arrodião naquele jogo!'",
        "'Arrodiar'",
        "'Girar, fazer rodar.\\n'",
        "'Arroio'",
        "'O que no Brasil é chamado de \"riacho\", \"córrego\". Com essa palavra ocorre o mesmo que com \"sanga\".'",
        "'Arroz de china pobre'",
        "'Comida típica feita com arroz, linguiça, cebola picadinha, alho e pimentão. É uma comida de origem popular, bem conhecida e apreciada entre a população mais humilde do estado.'",
        "'Asneira'",
        "'bobagem, algo idiota'",
        "'Ataio'",
        "'Contração de atalho. \"Vai e pega um ataio pra chega la em casa , tchê\"'",
        "'Atarantado'",
        "'Diz-se do sujeito que está com muitas tarefas e, por conta disso, fica atordoado, em dificuldades. Atarantado'",
        "'Atinar'",
        "'Perceber, dar-se por conta de algo.'",
        "'Atochar'",
        "'Mentir, fantasiar. Normalmente, mentiras de pequena importância, como exagerar um feito.\\nExemplo: \"Aqui se reunem caçadores, pescadores e outros atochadores\".'",
        "'Atrolhado'",
        "'Diz-se do sujeito que está cheio de trabalho, cheio de coisas pra fazer.\\n\\nEx.: \"Não vou poder almoçar com vocês porque estou atrolhado de serviço.\"'",
        "'Atucanada'",
        "'Nervosa, preocupada, atrapalhada, ocupada, apoquentada.'",
        "'Atucanado'",
        "'Quando se tem muitas coisas para fazer, vários problemas para resolver, tarefas de trabalho e outras questões, todas em prazos semelhantes, quase ao mesmo tempo, e fica-se agitado fazendo várias coisas de uma só vez, tentando dar conta do recado.\\nEx.:\\n- Tens um minuto para conversarmos?\\n- Agora não dá, tô muito atucanado!'",
        "'Auto'",
        "'[s.m.] Automóvel; carro. (ex.: Não sei onde deixei as chaves do meu auto.)'",
        "'Avio'",
        "'Isqueiro de pedra, pederneira.'",
        "'Azar é do goleiro'",
        "'Tipo \"doa a quem doer\". \"Não quero saber, não tô nem aí!\".'",
        "'Azedume'",
        "'Mal humorado, chateado, acabrunhado...ex: mas tá num azedume que só vendo...'",
        "'Azucrinar'",
        "'Incomodar alguém.\\nEx: Para de azucrinar guri.'",
        "'Babuja'",
        "'Alguma coisa grande'",
        "'Babujera'",
        "'Uma coisa muito maior que algo babuja'",
        "'Bacanudo'",
        "'Muito bacana. Muito legal.'",
        "'Bachero'",
        "'O mesmo usa em cavalos, estrapiado, judiado. Ex: que loco bachero aquele'",
        "'Bacuri'",
        "'menino, garoto, filho'",
        "'Bagacera'",
        "'Pessoa incoveniente. Chinelão. Turma de amigos. '",
        "'Bago'",
        "'Pode ter dois significados:\\n1- Testículos. Ex: Ai, me chutaste bem nos bagos, mulher!\\n2- Chute muito forte na bola de futebol, que geralmente a manda pra bem longe do campo. Ex: Pra quê dar um bago desses na bola, guri??'",
        "'Bagual'",
        "'Pessoa grosseira, estúpida.'",
        "'Baguari'",
        "'Vagaroso, lerdo, mole, pesadão.'",
        "'bah'",
        "'Oriunda da expressão \"bah tchê\", sinônimo de \"mas que barbaridade\".\\nA expressão \"bah\" é uma das mais polivalentes da cultura da República Rio-Grandense. Possui vários significados dependendo da situação, do cenário, o quanto se prolonga ao pronunciar e da entonação com que é pronunciada.\\n\\nEspanto: \"Bah, e é barato!\"\\nDesapontamento: \"baahhh, mas é um animal...\"\\nIndignação ou inconformidade: \"Baah, nem vou te falar é mais nada\"\\nIndiferença ou desinteresse: \"uhum, bah...\"\\nElogio: \"Baaahhhh\"\\nTristeza: \"Bah mas com essa se foi o boi com a corda.\"\\nFelicidade: \"Bah, mas é louco de especial !!\"\\nConcordância: \"BAAHHHH, beeem certinho !!!\"\\nSurpresa: \"Baaaahhh mas é uma \\'cavala\\'(gostosa) !!\"\\nRevolta: Bã!'",
        "'Baia'",
        "'Casa ou residência, local aonde pessoas vivem.\\nEx. Eu vou para minha \"baia\". Eu vou para minha casa.'",
        "'Baiacu'",
        "'Peixe das costas oceânicas do RS. Quando irritado, enche-se de ar, ficando como uma bola, e nadando, então, de ventre pra cima.'",
        "'Baio'",
        "'Brabo, descontrolado, enfurecido.'",
        "'Baita'",
        "'Algo muito grande, gigantesco.'",
        "'Balaca/balaqueiro'",
        "'malandro, cheio de si, pomposo.'",
        "'Balaqueira'",
        "'Pessoa gabola, sabe tudo, não confiável. Também significa o indivíduo que se exibe demais. '",
        "'Baldoso'",
        "'Pessoa carente, precisando de carinho. \\n\\n*Contribuição do Alfabeto de Quaraí'",
        "'balota'",
        "'mentira'",
        "'Banda'",
        "'O termo significa lugar, região, paragem. Quando alguém diz: “Sou de outras bandas” quer dizer que é de outro lugar, de outra regiões ou de outras paragens.'",
        "'Banzo'",
        "'É uma pessoa \\'não muito certa\\'. \\nEx.: Mas tu é banzo né!!'",
        "'Barateza'",
        "'Sacanagem, baixaria'",
        "'Barbaridade!!'",
        "'Expressão usada em frases de espanto, susto, alegria, indignação. Exemplo: Tchê mas que barbaridade!'",
        "'barbicacho'",
        "'tira de couro, de algodão ou similar que prende o chapéu ao queixo.'",
        "'Barde'",
        "'Manha\\nEx: -Espera nós chega em casa pia, quero tira tuas barde!'",
        "'BARRANQUEAR'",
        "'Praticar a bestialidade (i.e., sexo com animais), usando o barranco quando necessário para nivelar a diferença de altura (p.ex., com éguas e vacas). \"Barranquear é verbo xucro | Mais velho que a monarquia | Criado em fodologia | De um modo pampeiro e franco\"'",
        "'Bateclô'",
        "'Local destinado a receber dejetos oriundos da veia bostérea, latrina. Derivado do vocábulo inglês Water-Closet'",
        "'Batendo água'",
        "'Sinônimo de chuva forte, torrencial.\\nExemplo de uso: \"Se eu fosse tu não saia agora, tá batendo água.\"'",
        "'Bater as botas'",
        "'Morrer, falecer...'",
        "'Bater cola'",
        "'Sair de casa sem um bom motivo. Ex: Essa guria não pára de sair pra bater cola no shopping!'",
        "'Batocaço'",
        "'Golpe que o galo dá com os batoques, quando rinhado.'",
        "'baús'",
        "'muito grande, muita coisa, sinônimo de muito, aplica-se numa frase como: \"tinha baús de coisas para fazer\"'",
        "'Baus de tri'",
        "'Muito legal mesmo; demais. '",
        "'Bei'",
        "'Derivação de Bah.'",
        "'bem capaz!'",
        "'tem significado de negação à alguma  coisa ou pedido.\\nEx: Posso furar a fila do mate? Bem capaz!'",
        "'Bem nessas'",
        "'Significa dizer \" sim, isso mesmo, eu concordo contigo\".'",
        "'Berba'",
        "'Pelas beiradas. \\n\\n*Contribuição do Alfabeto de Quaraí. '",
        "'Berga'",
        "'Diminutivo de \"bergamota\", ou seja, o mesmo que \"tangerina\".\\nEx. \"Aproveitei o sol para passar a tarde na Redenção, lagarteando e comendo uma berga\".'",
        "'BERGAMOTA'",
        "'A tangerina (Citrus reticulata), também laranja-mimosa, mandarina, fuxiqueira, ponkan, laranja-cravo, mimosa, vergamota, clementina, bergamota ou mexerica[1], é uma fruta cítrica de cor alaranjada e sabor adocicado. Parece ser uma antiga espécie selvagem [2], nativa da Ásia (Índia, China e países vizinhos de clima subtropical e tropical úmido).'",
        "'Biaba'",
        "'significado: tapa, soco.\\norigem: termo gauchesco e crioulo argentino.\\nEx: Vou te dar umas biabas se não obedecer!'",
        "'Bicheira'",
        "'Coisa muita velha: normalmente utilizada para especificar automóvel muito velho, caindo aos pedaços.'",
        "'Bicicleteiro'",
        "'Ciclista, pessoa andando de bicicleta. EX: Quase atropelei um bicicleteiro na rua hoje. '",
        "'Bidê'",
        "'Mesinha de cabeceira.'",
        "'Bidu'",
        "'Cachorro quente vendido em trailers. \\n\\n*Contribuição do Alfabeto de Quaraí. '",
        "'Biriquete'",
        "'Viela, caminho estreito, esconderijo.'",
        "'Bisca'",
        "'Pessoa nojenta , rabugenta , chata. Também pode significar quem faz biscate. '",
        "'Biscaio'",
        "'Facão grande usado pelos homens que trabalham no mato.'",
        "'Bixento'",
        "'Pessoa ralé, medíocre'",
        "'Boca entaipada'",
        "'Diz-se quando a situação não está boa. Ex.: Vamos embora que estourou um bochincho e é \"boca entaipada\".'",
        "'Boca floreada'",
        "'Tolo, atrapalhado, lerdo, distraído\\nEx.: O boca floreada esqueceu a carne do churrasco'",
        "'Bochincho'",
        "'Confusão, troca de xingamentos, discussão acalorada, etc. Ex.: \"Qual foi o bochincho dessa vez? Aquela guria tá sempre puxando briga com todo mundo!\"'",
        "'Boco'",
        "'Círculo feito no solo com a pressão do calcanhar enquanto o corpo gira para marcar o local onde deve-se colocar a bola atirada no jogo de \"sela\"; A quantidade de bocos corresponde ao número de jogadores menos 1; Cada jogador escolhe 1 boco, exceto o lançador.'",
        "'Bodear'",
        "'Sinônimo de \"lagartear\", dormir, descansar deitado, etc.\\n\\nAssim como o lagarto fica ao sol sobre as pedras (curtindo a boa vida) os bodes também aproveitam o sol e o vento enquanto pastam.\\n\\nEx.: Mas olha lá o fulano! Já tá bodeando! [lagarteando]'",
        "'Bodega'",
        "'Diz-se de mercado de pequeno porte, venda de secos e molhados pequeno.'",
        "'Bodoque'",
        "'O mesmo que funda ou estilingue.'",
        "'Boi lerdo toma água toldada!'",
        "'Aquele que se atrasar perderá a melhor parte.'",
        "'bóia'",
        "'comida'",
        "'Boiada'",
        "'Porção de bois mansos, especialmente do serviço de carrêtas.'",
        "'Boleiar'",
        "'\"Boleia a perna\", quer dizer, levanta e dá uma sacudida na perna. '",
        "'Boleio'",
        "'Chute forte no futebol. \\n\\n*Contribuição do Alfabeto de Quaraí. '",
        "'Bolicho'",
        "'[s.m.] Pequeno bar ou estabelecimento comercial onde o gaúcho se reúne para tomar uma canha, para ver noticias do povo e comprar um pedaço de fumo em corda. (ex.: Fui no Bolicho jogar uma bocha e tomar um trago de canha!)'",
        "'bolija'",
        "'bolita, bola de gude. Do cast. bolilla.'",
        "'Bombacha'",
        "'A bombacha é uma peça de roupa, calças típicas abotoadas no tornozelo, usada pelos gaúchos. O nome foi adotado do termo espanhol \"bombacho\", que significa \"calças largas\".\\nPode ser feita de brim, linho, tergal, algodão ou tecidos mesclados; de padrão liso, listrado ou xadrez discreto. As cores podem ser claras ou escuras, fugindo-se de cores agressivas, chocantes e contrastantes.\\nNo Rio Grande do Sul, a bombacha, juntamente com toda a indumentária característica do gaúcho, é considerada traje oficial desde 1989, quando foi aprovada a Lei Estadual da Pilcha [1] pela Assembléia Legislativa. De acordo com a Lei, a pilcha gaúcha -- o conjunto de vestes tradicionais tanto masculino quanto feminino -- pode substituir trajes sociais -- ex. terno e gravata para os homens e vestidos de tecidos mais nobres para as mulheres -- em qualquer ocasião formal que ocorra no Rio Grande do Sul, inclusive reuniões das Assembléias Legislativas estadual e municipais, desde que se observe as recomendações ditadas pelo Movimento Tradicionalista Gaúcho (MTG).'",
        "'Bombando'",
        "'Quando tu chegas em um lugar e a o ambiente tá \\'loco de especial\\', ceva gelada, boa música e todos os amigos. '",
        "'Bombeia'",
        "'Olhar algo ou para alguém. Ex: Bombeia só, a guria tá de namorado novo. \\n'",
        "'Bonachão'",
        "'Diz-se do sujeito de boa índole, calmo e tranquilo.'",
        "'Bonanchão'",
        "'Aquele que é bondoso, calmo, cavalheiro, franco.'",
        "'Bordonear'",
        "'Executar uma música em viola ou violão usando as cordas mais grossas, que emitem sons mais graves.'",
        "'Borracheira'",
        "'Estado de embriaguez, bebedeira, tragueado, bêbado.'",
        "'borracho'",
        "'borracho é o índio véio mamado, bêbado. aquele que tá mais pra lá do que pra cá.'",
        "'BRAGUETA'",
        "'O mesmo que braguilha: parte frontal do vestuário masculino, que, ao ser aberta, permite ao usuário exteriorizar o pênis para urinar.'",
        "'BRAGUILHA'",
        "'peça do vestuário masculino que se usava nos séculos XV e XVI para cobrir os órgãos genitais. Por extensão o nome é aplicado a frente das calças, calções ou cuecas que se costuma fechar. Permite ao seu portador retirar o pênis para fora na ocasião de urinar.  \\nNos séculos XV e XVI a braguilha surge por razões de pudor. '",
        "'Brazino'",
        "'[adjetivo] Qualidade daquilo que assume a coloração da brasa acesa.\\n\\n  Exemplo:\\n - Guri, volta aqui  ou vou te deixar brazino a pau. '",
        "'Brete'",
        "'Onde vacina o gado.'",
        "'bruaca'",
        "'1. megera, mulher que parece um dragão\\n2. Compartimento de carga usado em lombo de cavalos e muares e que no tempo das tropeadas servia para o transporte de especiarias, ferramentas, tecidos etc, para pontos distantes do território brasileiro e ainda hoje usada em regiões de minifúndio, onde há dificuldade de uso de outro meio de transporte; espécie de bolsa de grandes dimensões, usada sempre aos pares penduradas nas cangalhas, equipamento de suporte apoiado diretamente sobre o lombo do animal.'",
        "'Bruxo'",
        "'Utilizado como forma de tratamento aos flanelinhas. '",
        "'Buchincho'",
        "'s.m.\\nGrafia alternativa de \\'bochincho\\' [veja: \\'bochincho\\'].\\nConfusão; tumulto; briga generalizada.\\n(ex.: Mas não é que a chinoca pegou o índio velho traindo ela e o bichincho estava formado.)'",
        "'Bucho'",
        "'Estômago. Ex: Hoje vou encher o bucho no churras do meu primo!'",
        "'Buchuda'",
        "'O mesmo que prenha, grávida.'",
        "'Budum'",
        "'Grande desordem, sujeira, bagunça...\\nEm algumas localidades, também significa mau odor. '",
        "'Buenacha'",
        "'Significa uma coisa boa.'",
        "'Buenas'",
        "'[interj.] Buenas é um cumprimento, pode ser usado em qualquer momento do dia para cumprimentar amigos e conhecidos. (ex.: Buenas, tchê! Como vai a família?)\\nEternizado na fala do Capitão Rodrigo, personagem de Érico Verísimo, em O tempo e o vento: \"Buenas e me espalho...\"'",
        "'Bugio'",
        "'Pelego curtido e pintado, em geral forrado de pano. Animal da Serra.'",
        "'Buxa'",
        "'Quem nunca disse \"É buxa!!\", \"Pura Buxa!!\"... Palavra usada para expressar algo \"complicado\".'",
        "'Cabeça de porongo'",
        "'Cabeção, teimoso, cabeça dura...'",
        "'Caborteira'",
        "'Cavalo ou outro animal, manhoso, arisco, infiel, velhaqueador, que não se deixa pegar.\\nIndivíduo velhaco, esperto, manhoso, mau, mentiroso, trapaceiro, tratante, que vive de expedientes.'",
        "'Cabresto'",
        "'Peça de couro apresilhada ao buçal ou buçalete para segurar o cavalo ou o muar. É comum o uso da expressão “sentar no cabresto”.'",
        "'Cacaria'",
        "'Porção de objetos velhos e sem serventia. Cacarecos tem o mesmo significado.'",
        "'Cacetinho'",
        "'O famoso Pão Frances'",
        "'Cachetada'",
        "'Bofetada, paulada, soco.'",
        "'Cachorro de baile'",
        "'Gurizada no baile atrás do conjunto só olhando. \\n\\n*Contribuição do Alfabeto de Quaraí. '",
        "'Cacunda'",
        "'Costas, ombros. \\n'",
        "'Cafundó'",
        "'Lugar ermo e solitário, grota. É comum o uso da expressão “lá nos cafundós do Judas”.'",
        "'Cagaço'",
        "'tomar um susto muito grande, vivenciar algo inesperado com medo'",
        "'Cagando e andando'",
        "'O cara que não tá se importando muito com determinada situação. Mesmo que seja difícil imaginar a cena.'",
        "'Cagar a pau'",
        "'Bater muito, dar uma surra.'",
        "'Calavera'",
        "'aquele que compra e não paga. enganador, golpista...'",
        "'Camadona'",
        "'Palavra de bastante espanto, tipo como \"Camadona! Tu viu aquilo?'",
        "'Camareu'",
        "'Sinônimo - camarão\\n\\nUtilizado princialmente por vendedores ambulantes que circulam pela cidade de bicicleta vendendo o  crustáceo.'",
        "'Cambona'",
        "'Recipiente para aquecer água para o mate no fogo de chão. \\n\\n*Contribuição do Alfabeto de Quaraí. '",
        "'Cambota'",
        "'Cair realizando um giro com o corpo para frente.....Cambalhota, rolamento para frente, rolinho....'",
        "'camoatim'",
        "'Espécie vespa produtora de um gostoso mel, muito encontrado em colméias suspensas em ávores e arbutos nos campos do Rio grande do Sul.'",
        "'Campear'",
        "'Procurar algo'",
        "'Camperiar'",
        "'Sair campo a fora, ou sair pra lide campeira.'",
        "'Cancheiro'",
        "'Cavalo cancheiro é o já habituado e mestre em correr. Deriv. De cancha.'",
        "'Candanga'",
        "'Sujeito andarilho, sem morada certa, estradeiro. Alguém que vive pelas estradas pedindo alimento e pousada. Personagem assustadora das crianças. Meus pais diziam: -\"Cuidado que o candanga te pega.\"'",
        "'capaz'",
        "'\"interjeição\" de espanto - Ex: CAPAZ QUE TU CONSEGUIU FAZER ISTO!?\\n2. \"interjeição\" de negação - Ex: O QUÊ? BEM CAPAZ!'",
        "'Capincho'",
        "'O mesmo que bajuladores, aqueles que estão sempre adulando alguma pessoa importante.'",
        "'Caramuru'",
        "'Brasileiro que não nasce no Rio Grande. Usado desde a época da Guerra dos Farrapos, quando designava os membros do Partido Restaurador (que pretendia a volta de D. Pedro I para o governo do Brasil) e logo passou a designar todos os soldados brasileiros, com os quais os gaúchos peleavam.'",
        "'Carneiro'",
        "'Aquele que cobiça a mulher dos outros. \\n\\n*Contribuição do Alfabeto de Quaraí. '",
        "'Carpeta'",
        "'Pasta de documentos ou jogo de cartas. \\n\\n*Contribuição do Alfabeto de Quaraí. '",
        "'Carpim'",
        "'Meia'",
        "'Carreteiro'",
        "'1. Pessoa, geralmente um homem, que transporta produtos, mantimentos e artigos variados em uma carreta de bois.Os carreteiros de hoje transportam as cargas nos carretas movidas a cavalos mecânicos, ou seja, caminhões. \\n2. Os carreteiros antigos inventaram o  \"arroz de carreteiro\", mais conhecido no Rio Grande do Sul como \"carreteiro\", feito do charque – carne salgada e seca ao sol para não estragar. '",
        "'Carreteiro de charque'",
        "'Comida típica, que consiste em arroz com charque (carne seca) picadinho.'",
        "'Cascudo'",
        "'Pancada em algo ou na cabeça de alguém com os nós dos dedos. Sinônimos: coque, cocorote. Exemplo: A menina deu um cascudo no irmão mais novo.'",
        "'Castelhano(castelhana)'",
        "'Pessoa de nacionalidade estrangeira Argentina ou Uruguaia'",
        "'Catinga'",
        "'Mau cheiro. \\n\\n*Contribuição do Alfabeto de Quaraí. '",
        "'Caudilho'",
        "'Chefe militar. Manda-chuva.'",
        "'causo'",
        "'o mesmo que caso, história, qualquer narrativa contada à beira do fogo, nos galpões das estâncias. caso, conto, acontecimento'",
        "'Cazul de linha'",
        "'Nome dado ao retrós de linha.'",
        "'Cerro'",
        "'Morro ou montanha baixa. No RS se usa a palavra em espanhol, \"cerro\", resquício deixado pelos primeiros colonizadores da região - os castelhanos.'",
        "'Ceva'",
        "'Abreviativo para cerveja, usado principalmente em Porto Alegre. No interior do estado é mais observado o uso de \"cerva\".'",
        "'Cevar'",
        "'Preparar, cativar.\\nCevar o mate: prepará-lo para ser bebido.\\nCevar um animal: acostumá-lo a vir comer num lugar, para posteriormente caçá-lo.\\nTermo usado também com o mesmo significado nos países latinos (escrito \"cebar\").'",
        "'Chafundar'",
        "'Atolar-se, cair n’água.'",
        "'Chairado'",
        "'Abatido, cansado... Derivado de faca ruim de fio, que já vem sendo amolada na chaira.'",
        "'Chalana'",
        "'Embarcação ou Lancha grande e chata'",
        "'Chaleirando'",
        "'Incomodando, se metendo ns assuntos dos outros, atrapalhando...'",
        "'Chamarisco'",
        "'O mesmo que chamariz; coisa que chama, que atrai.'",
        "'chamarra'",
        "'A chamarra é um colete escarlate ou preto, também talar e sem mangas, aberto na frente, usado sobre o roquete. A chamarra era, originalmente, uma jaqueta de equitação ao ar livre e suas pregas traseiras facilitavam o montar e desmontar do cavalo.'",
        "'Chamegão'",
        "'Assinatura; Ex.: Agora é só tu passar o chamegão na escritura para o negócio ficar preto no branco.'",
        "'Chapéu tapiado'",
        "'Que levou um tapa e ficou com a aba para cima ou pedurado nas costas, pelo baricacho, preso ao pescoço'",
        "'Charla'",
        "'Palestra, conversa.'",
        "'Chasque'",
        "'Jornal .'",
        "'Cheba'",
        "'Mendigo'",
        "'Cheio de balaca!'",
        "'Pessoa muito exibida. \\nChegou aqui “cheio de balaca”!\\n'",
        "'Chergão'",
        "'Espécie de tapete retangular de lã que se coloca sobre o lombo do cavalo antes da sela. No popular também se usa a expressão para falar uma roupa muito usada e encardida.'",
        "'Chibo'",
        "'Ovino macho, castrado, de até um ano de idade.'",
        "'Chima'",
        "'Forma abreviada para \"chimarrão\".\\nEx.: e aí, passa lá em casa pra tomar um chima'",
        "'Chimarrão'",
        "'Do espanhol cimarrón= selvagem, puro.\\nMate chimarrão: mate amargo, preparado sem adição de açúcar, leite, rapadura ou outras ervas; apenas água quente.\\nGado chimarrão: gado sem dono, criado solto, sinônimo de \"alçado\" ou \"orelhano\", comum no século XIX.'",
        "'Chimas'",
        "'[s.m.] Forma reduzida de \\'chimarrão\\' (consulta: \"chimarrão\"). Possui outras variações, como \"Chima\", principalmente (ex.: Mas que sol bem bom pra tomar um chimas na frente de casa!)'",
        "'Chimbear'",
        "'Gauderiar, vadiar, vagabundear. O mesmo que chimbiar.'",
        "'Chimia'",
        "'Termo utilizado pelos descendentes de alemães para designar as geléias de frutas\\n\\nSinônimos: schmier, geléia\\nObservação: käs-schmier: geléia de queijo (venerada pela comunidade germânica do sul do mundo) = pronuncia-se \"quechimie\" ou \"quechimia\"\\n'",
        "'chimpa'",
        "'esporte de rua dos piazitos, jogado com pedras (similar à bocha)'",
        "'Chinaredo'",
        "'Grande número de chinas, mulheres'",
        "'Chinelagem'",
        "'Sacanagem.'",
        "'Chinelão'",
        "'Pessoa mal arrumada; coisas mal feitas; relaxamento.\\nAquela guria está muito chinelona para ir na festa. '",
        "'Chinelo'",
        "'Diz-se do indivíduo que vive na ralé.'",
        "'Chinfrim'",
        "'Modesto, sem graça...  Ex: Essa roupa é muito chinfrim para aquela festa.'",
        "'Chinoca'",
        "'A mulher gaúcha, a prenda.'",
        "'Chiripa'",
        "'Veste intima feminina, feita normalmente de pano de algodão.'",
        "'chisme'",
        "'discussão, tumulto, briga...'",
        "'Chispa'",
        "'Sai, \"te arranca\", vai embora. '",
        "'Chorna'",
        "'confusão, rebuliço, desordem.\\nExemplo: \"Mas que \\'chorna\\'* é essa?\\n*Chorna: no sentido de confusão.\\n'",
        "'Chulear'",
        "'Torcer para que algo aconteça, dar uma chuleada: ficar na expectativa; fazer pontos de costura a grosso modo antes de costurar em definitivo.'",
        "'Chulepento'",
        "'Aquele que tem chulé.'",
        "'Chumbeado'",
        "'Embriagado, bêbado; o mesmo que traguado.'",
        "'Chupim'",
        "'Aproveitador'",
        "'Churero'",
        "'Quem vendia miúdos de bovinos.\\nEram vendidos por carroceiros pelas ruas de São Borja. Isto até o início da década de 70.\\nVem do espanhol \"achura\".'",
        "'Churras'",
        "'Abreviatura de Churrasco.\\n-Onde vai ser o Churras?'",
        "'Churrascada'",
        "'Reunião de pessoas para participarem de um churrasco.'",
        "'CHURRIO'",
        "'Diarreia, desarranjo, caganeira. \"O xiru não veio porque deu um CHURRIO nele\"'",
        "'Churumela'",
        "'Conversa fiada, mentira, ou papo furado.'",
        "'Cincha'",
        "'Peça dos arreios que serve para firmar o lombilho ou o serigote sobre o lombo do animal. '",
        "'Cinchado'",
        "'Apresilhado, apertado.\\nDeriva da palavra cincha, parte do arreio que prende a sela ao cavalo.\\nEntre os tradicionalistas, é comum o emprego dos termos \"abraço bem cinchado\" e \"um quebra-costelas\",como sinônimos de um abraço bem apertado.'",
        "'Coió de mola'",
        "'Pessoa boba, inútil, \"abobada\"!'",
        "'Cola'",
        "'Cabelo preso. \\n\\n*Contribuição do Alfabeto de Quaraí'",
        "'Cola fina'",
        "'Quem não usa pilcha e veste-se no estilo \"moderninho\"'",
        "'Colono'",
        "'Agricultor, vivente nascido no interior do estado.'",
        "'Com a boca na botija'",
        "'Quando o índio é pego na hora H, no pulo do gato. Momento em que a pessoa é surpreendida pronta para realizar determinada ação.'",
        "'Conchavar'",
        "'Contratar serviços. Também significa alugar-se ou entrar para o serviço de uma estância ou de uma casa qualquer.'",
        "'Conjuminar'",
        "'Fazer nexo, bater ideias.\\nExemplo: \\nBah! Não conjuminamos e peguei o ônibus errado.'",
        "'Copa'",
        "'Parte central e alta do chapéu'",
        "'Copar'",
        "'Vencer; Ter sucesso; Humilhar; Vencer a copa.\\n\\nExemplos:\\n• Cope afú!\\n• O Grêmio copou o campeonato.\\n• Está muito bom. Você copou!\\n• Cope! Cope sempre sem cessar!\\n• Copadaço.'",
        "'Corcovear'",
        "'Pinotear. Quando o animal dá corcovos, saltos, curvando o lombo para lançar o cavaleiro para fora de si.'",
        "'Cordão da calçada'",
        "'Em São Paulo, chama-se \"meio-fio\". Mas é a parte da calçada que é pintada de amarelo, branco, etc.'",
        "'Cortar os naipes'",
        "'Expressão que indica a necessidade de dar limites à alguém. \"Bá, tem que cortar os naipes desse guri\".'",
        "'corticeira'",
        "'seivo ou seibo. corticeira do banhado. '",
        "'Costado'",
        "'O mesmo que \"do lado\". Exemplo: Me parei no costado do fogão a lenha a tarde inteira.'",
        "'Costeando'",
        "'\"Vamo se costeando pro lado dos parceiros de fundamento\".\\n\\nAproximar-se, fica perto. \\n\\n'",
        "'Cramenha'",
        "'Segundo a Fernanda Krige, é uma expressão de desaprovação, que vem do dialéto italiano. Também expressa espanto.'",
        "'Crioulo'",
        "'Natural de um determinado ponto do Estado. Originário do país, da região do lugar onde vive.'",
        "'Crivado'",
        "'Cheio de alguma coisa. “Morreu crivado de balas”- morreu atingido por muitas balas.'",
        "'Crivo'",
        "'Cigarro.\\nExemplo: \"Tchê, acabaram meus crivo, tu tens um pra me dar?\"\\n\"Me vê um quilo de erva e um pacote de crivo\"\\n'",
        "'Cuca'",
        "'Espécie de pão doce (pode ter recheio ou não), possuem uma cobertura açucarada.'",
        "'Cudio'",
        "'Cudio é uma expressão de grande espanto, por exemplo: \"Cudio, que frio!\"'",
        "'Cueca de Piola'",
        "'Rapaz inexperiente'",
        "'Cuiúdo'",
        "'Muito bom. Fodão. Excepcional. Exemplos: \"Esse mate tá cuiúdo!\"'",
        "'Culhão'",
        "'Testículos.'",
        "'Cupincha'",
        "'Companheiro, amigo. '",
        "'cusco'",
        "'cachorro'",
        "'Dalhe!'",
        "'Cumprimento, o mesmo que: e aí?\\n\\n*Contribuição do Alfabeto de Quaraí. \\n'",
        "'Dançata'",
        "'Bailarico, baileco, dança-rola'",
        "'Dar Chá de garfo'",
        "'Significa, falar mal de alguém através de indiretas'",
        "'Dar no pé'",
        "'Correr em disparada.'",
        "'Dar nos dedos'",
        "'Dar uma resposta rápida e bem dada.Fazendo com que a pessoa que recebeu tenha vontade de esconder o rosto.'",
        "'Dar uma banda'",
        "'Expressão usada para designar passeio sem especificar onde ou com que finalidade. Sair para passear. Equivalente a \"dar um rolê\". '",
        "'De apa'",
        "'Muito, aos montes, bastante.'",
        "'De canto'",
        "'Discretamente, sem chamar a atenção.'",
        "'De cara'",
        "'Chocado, surpreso e até mesmo magoado. Tudo junto. \"Ô meu, o fulano tá de  cara contigo!\". Também pode significar o sujeito que não está sob algum estado alterado de consciência.'",
        "'De H'",
        "'Expressão usada para designar algo inútil, falso.\\nExemplo de uso: \"Este cabo é de H\"'",
        "'De lamber os beiço'",
        "'O mesmo que dizer: E dê-se por satisfeito!\\nOu essa comida está de lamber os beiço: muito saborosa!'",
        "'De Patrão!'",
        "'(Também \"De Capa!\".) Interjeição de satisfação referente a algo, uma pessoa ou situação. Exemplo: \"RadioSemFronteira.com - Essa é de Patrão!\"'",
        "'De ponta'",
        "'Em pé, de pé. \\n\"-Hoje, tempranito já estava de ponta.\"'",
        "'De rachar'",
        "'Geralmente refere-se ao frio muito intenso. \"Bah, hoje tá fazendo um frio de rachar os beiços\". Mas pode se referir aos efeitos do Sol.'",
        "'De revesgueio!'",
        "'1. Próximo, não exatamente onde deveria acertar/estar.\\n    Exemplo: \"Essa gripe me pegou, mas de revesgueio\".\\n2. Olhar de revesgueio é olhar atravessado, meio de lado, de canto de olho.\\n    Exemplo: \"Ele a olhou de revesgueio\".'",
        "'Debandiar'",
        "'Corruptela de \"debandar\". Sair, deixar um lugar.'",
        "'Debocheira'",
        "'Grande troça ou deboche; zombaria, deboche.'",
        "'Degolado'",
        "'Diz-se do animal de pescoço muito fino no local da junção com a cabeça.'",
        "'Deitar o cabelo'",
        "'Se mandar, sair correndo...'",
        "'Dentama'",
        "'Grande quantidade de dentes. Dentadura toda igual.'",
        "'Desacorçoar'",
        "'Desanimar, desistir.'",
        "'Desatinado'",
        "'Enlouquecido, desesperado. \\n\\n*Contribuição do Alfabeto de Quaraí. \\n'",
        "'Desbocado'",
        "'Diz-se do cavalo muito sensível da boca, que com a mais leve pressão do freio, levanta bruscamente a cabeça, não governando bem. Aplica-se também às pessoas que tem o hábito de dizer palavras obscenas ou menos delicadas.'",
        "'Descambada'",
        "'Declive, descida de uma coxilha ou lomba para uma quebrada ou vale. O mesmo que descambado.'",
        "'Desembarrigar'",
        "'Ficar delgado, magro, fazer desaparecer o grande volume da barriga.'",
        "'Desembuchar'",
        "'Confessar segredos, contar tudo o que sabe.'",
        "'Desenchufado'",
        "'Desligado; Desconectado;\\nEx: Ando meio Desenchufado ultimamente; '",
        "'Desgarrar'",
        "'Retirar as garras (pontas) do couro. Também significa apartar-se dos outros, perder-se dos companheiros.'",
        "'desmaiar o Batista'",
        "'A expressão \"de desmaiar o Batista\" é utilizada quando queremos dizer que algo está exagerado, causando mal estar. Por exemplo: \"Mas tá calor de desmaiar o Batista!\".\\n\\nA origem da expressão vêm do dia em que o Batista, comentarista da TV COM (rede de comunicação do RS) desmaiou ao vivo em um jogo: http://www.youtube.com/watch?v=Zd7WBUj8PAs'",
        "'Desmereceu'",
        "'Desmerecer é quando perde a cor, o mesmo que desbotar\\n'",
        "'Despacito'",
        "'adv.\\nSem pressa; lentamente; com parcimônia. (ex.: Não \\'se apressemo\\'. despacito, chegamos lá.)'",
        "'Destornilhado'",
        "'Diz-se daquele que não tem o juízo muito certo.'",
        "'Deus o livre'",
        "'Expressão de alívio (Deus o livre, ainda bem que não choveu hoje). '",
        "'Devereda'",
        "'Rápido, ligeiro.\\nEx: Quando ele recebeu a notícia saiu devereda resolver o problema.'",
        "'Diabrete'",
        "'Criança muito arteira.'",
        "'Diacho'",
        "'Diabo. “É o dicaho”, ou seja, é o diabo.'",
        "'Dinheirama'",
        "'Muito dinheiro. O mesmo que dinheiral. “Dei uma dinheirama por essa tropa”, ou seja, essa tropa custou muito dinheiro.'",
        "'Ditas'",
        "'Hemorróidas.'",
        "'Do tempo do Ariri de gancho'",
        "'Muito antigo, fora de moda, ultrapassado...'",
        "'Doma'",
        "'Ato de domar. Ato de amansar um animal xucro.'",
        "'Dormida'",
        "'Sono. Pouso no fim da jornada.'",
        "'Dos tempos do guaraná de rolha'",
        "'Algo muito antigo, dos idos de antigamente.'",
        "'É de comer ou passar no pão?'",
        "'Quando a pessoa não entende nada de nada. Não entende de determinado assunto ou da informação que lhe foi passada. '",
        "'É mais feio que galope de vaca!'",
        "'A vaca, ao contrário do cavalo, não sabe galopar. Quando por qualquer motivo, precisa correr, não é garbosa, é desajeitada, meio descordenada.'",
        "'Eita!'",
        "'Interjeição de espanto.'",
        "'Em cima do laço'",
        "'Com pressa, apressado, com pouco tempo\\nEx: Estou em cima do laço pra chegar na reunião.'",
        "'Embelecos'",
        "'Coisas de pouco valor, bugigangas.'",
        "'Emborcar'",
        "'Cair de borco, virar a canoa ou o veículo, quando a parte superior fica para baixo.'",
        "'Embretar'",
        "'Apertar, pressionar, deixar sem escapatória.'",
        "'Embromar'",
        "'v. Levar muito tempo para fazer algo. Andar devagar, sem pressa.'",
        "'Embrulhão'",
        "'Diz-se de ou o indivíduo que causa confusão, embaraço, atrapalhação, complicação.'",
        "'Empacado'",
        "'Calado, sério, taciturno.'",
        "'Empilchado'",
        "'Diz-se do que tem pilchas. Rico, que tem bons haveres.'",
        "'Empipocar'",
        "'Criar pústulas, bolhas ou borbulhas. Também significa estalar, arrebentar. O mesmo que espipocar, pipocar, papocar, espocar.'",
        "'encalistrado'",
        "'constrangido, desconfiado.\\n\\n\"Mais encalistrado que galinha chocando ovo de avestruz\"'",
        "'Encarangar'",
        "'Ficar enregelado a ponto de ficarem hirtas as mãos e os dedos.'",
        "'Encasquetar'",
        "'Obstinar-se em realizar alguma coisa. Meter uma ideia fixa na cabeça.'",
        "'Encher de osso'",
        "'Xingar alguém ou ser xingado. \"Tchê! O vivente me encheu de osso!\"'",
        "'Encher o buxo'",
        "'Comer demasiadamente. Um pouco além do recomendado.'",
        "'Encherido(a)'",
        "'Pessoa com ar de superioridade!'",
        "'Enchufar'",
        "'Plugar. Do Espanhol \\'enchufe\\'.'",
        "'Encordoado'",
        "'Consecutivos, em sequência.'",
        "'Encostelar'",
        "'Emparelhar, ficar rente com outrem, encostar-se a outrem, andar junto.'",
        "'Endomingar-se'",
        "'Vestir-se bem, com roupa de passeio.'",
        "'Enfastiado'",
        "'Sem fome, embuchado, de barriga cheia. \\n\\n*Contribuição do Alfabeto de Quaraí'",
        "'Enforquilhar-se'",
        "'Prender na forquilha. Em sentido, figurado, assentar-se mal, com deselegância, quando a cavalo.'",
        "'ENGASGA GATO'",
        "'Carne moída ou picada em tamanho grande ou ensopado com pedaços de charque. Geralmente usa-se os restos do churrasco.\\nEx: Hoje a noite vai ter um engasga gato lá em casa.'",
        "'Engatado'",
        "'Apaixonado, louco pela guria. \\n\\n*Contribuição do Alfabeto de Quaraí'",
        "'Engate'",
        "'1 - Hora extra. 2 - Ato de estar engatado.\\n\\nEx. 1: \"Vou chegar mais tarde porque estou engatado aqui no serviço\"\\n\\nEx. 2: \"Trabalho entrando a essa hora? Certo que é engate\" '",
        "'Engrólio'",
        "'Trapaça, embrulho, embrulhada.'",
        "'Entecada'",
        "'Doente, com problema de saude'",
        "'Enticar'",
        "'en.ti.car, transitivo indireto e pronominal\\n(Regionalismo) provocar questão, entrar em discussão com; altercar, brigar\\nTem a mania de enticar com todo mundo.\\nEnticam-se diariamente sobre questões de trabalho.\\n(Regionalismo) tomar implicância com (alguém ou algo); aborrecer\\nResolveu enticar com o vizinho por causa de um muro.\\nEnticou com o vestido assim que o viu.\\n(Regionalismo) obstinar-se em; teimar, rabujar\\nQuando ele (se) entica e resolve sair, não tem jeito.'",
        "'entrevero'",
        "'1. Confusão, mistura, briga, desentendimento. 2. Espécie de sanduíche recheado com diversos tipos de carnes picadas.'",
        "'Entrouchado'",
        "'Ato de entrouchar-se. Traduzindo, é o cara que sai bem agasalhado de casa, pronto pra enfrentar o frio de renguiar cusco que costuma fazer no Rio Grande.'",
        "'Epucha!'",
        "'Expressão de admiração.'",
        "'Ermão'",
        "'O mesmo que irmão. É a maneira mais comum que se exprime a gente rústica da campanha.'",
        "'Escangalhado'",
        "'Em estado lamentável. Esbodegado.'",
        "'Escangalhar'",
        "'Estragar, destruir.'",
        "'Escramuçar'",
        "'Salto dado pelo cavalo, normalmente quando está sendo montado e sob pressão. Ex.: \"Meu cavalo escramuça, e até parece que pulsa sangue crioulo em minhas veias!\"'",
        "'Esgualepada'",
        "'Destroçada, destruída, demolida, bagunçada'",
        "'Esgualepado'",
        "'Pessoa ou animal mal tratado ou machucado. Cansado ao extremo. (Físico ou emocionalmente)\\n\\nJoão voltou todo esgualepado da fazenda.\\nO cusco velho já tá esgualepado.\\n\\n'",
        "'esgualepado (a)'",
        "'Alguém cansado...'",
        "'Eslaque'",
        "'Usado pelas mulheres, é a mesma coisa que calça comprida. Derivado de slack'",
        "'Esmerar'",
        "'Caprichar, fazer bem feito, '",
        "'Esparramo'",
        "'Separação, disseminação de objetos, de animais ou de pessoas. O mesmo que esparrame.'",
        "'Esquaxerengado'",
        "'Adjetivo que se refere a quem está quebrado, estropiado, manco ou rengo das pernas.'",
        "'Estar com um pé que é um leque'",
        "'Ser uma pessoa que sai muito, que não para em casa'",
        "'esticada no matambre'",
        "'Quando um vivente está muito cansado, e vai dormir um pouco!'",
        "'Estilingue'",
        "'Querido entre a piazada, o estilingue é um instrumento feito geralmente com um pedaço de galho de goiabeira bifurcado, elástico e uma tira de couro. O objetivo é lançar pedras em um alvo, seja ele qual for.\\n\\nTambém conhecido como bodoque. '",
        "'Estropiado'",
        "'Diz-se o animal sentido dos cascos, com dificuldade de andar, em conseqüência de marchas por estradas pedregosas.'",
        "'Esturricar'",
        "'Secar demais, ficar muito tempo no sol. Ex.: aquela roupa que ta secando lá fora no sol vai esturricar se você não for logo lá recolher.'",
        "'Facada'",
        "'Pedido de dinheiro feito por indivíduo vadio, que é incapaz de trabalhar, que não pretende restituí-lo.'",
        "'Faceiro'",
        "'alegre, contente'",
        "'Faceiro que nem gordo de camiseta.'",
        "'Uma pessoa que está muito feliz com algo, afinal é difícil um gordo entrar em uma camiseta. '",
        "'Faixa'",
        "'Estrada, Rodovia'",
        "'Falquejado'",
        "'Significado de Falquejar. v.t. Desbastar uma madeira (tronco). Ex: Eu aprendi na escola do mundo não fui falquejado em bancos colegiais.'",
        "'Faniquito'",
        "'Surto psicótico; distúrbio mental; \" A tia Ponciana teve um faniquito quando soube que a Juraci fugiu com o Bonifácio\"'",
        "'Fanisco'",
        "'Pessoa de estatura pequena e magra.'",
        "'Farrear'",
        "'Sair à pândega, à folia, à troça, para divertir-se, passear, beber.'",
        "'Fatiota'",
        "'Terno; Conjunto de roupas do homem: calça, colete e paletó.'",
        "'Faz a frente'",
        "'O mesmo que \"Faz a mão\". Quer dizer: Pô fulano, dá um jeito aí.  Também pode ser: Vai, toma a iniciativa.'",
        "'Fazer os lados'",
        "'Quando o amigo está afim de alguém que tu conhece e quer uma ajuda, ele pede para que tu \"faça os lados\".'",
        "'Fechou o pastel'",
        "'Combinar algo, concordar com algo. Ex.: Vamos tomar um mate lá em casa? -Vamos sim. -Entao fechou o pastel.\\n'",
        "'Fechou o pau'",
        "'Quer dizer que aconteceu uma briga, uma confusão, um tumulto. Pode ser também \"fechou a rosca\", ou ainda \"fechou o tempo\".'",
        "'fedelho'",
        "'Moleque, pentelho. Pessoa que parece uma criança pentelha.\\nExemplo: Foi aquele fedelho que vi hoje no parque atrapalhando as outras crianças.\\n'",
        "'Fervo'",
        "'Luta, tumulto, grande conflito.'",
        "'Fiambre'",
        "'Carne fria assada ou cozida na panela, que se leva para comer em viagem.'",
        "'Fiasqueira'",
        "'Pessoa que briga em publico, que vergonha em algum lugar.\\n\\n'",
        "'Fiasquento'",
        "'Aquele que faz fiasco. Desastrado. Geralmente quando a pessoa faz algo que chame atenção dos outros, como gritar ou desastrar-se em público. '",
        "'Ficar na moita'",
        "'Não se manifestar, ficar de fora para ver no que vai dar...'",
        "'Finar de rir'",
        "'Rir até perder o fôlego. Ex: Fulano se finou de tanto rir.'",
        "'Findi'",
        "'Forma apocopada para fim-de-semana. \"Nesse findi eu vou pra Capão da Canoa\".'",
        "'Finesse'",
        "'Sutileza, astúcia. '",
        "'Fiquei com cara de tacho!'",
        "'...'",
        "'Firme, forte e são de lombo'",
        "'Expressão usada como resposta quando perguntam: Tudo bem contigo?\\nE significa: Tudo bem!'",
        "'Firula'",
        "'Frescura, mimimi, enfeite demais.'",
        "'Flaco'",
        "'Fraco, magro, desnutrido.'",
        "'Flete'",
        "'Montaria, cavalo. Termo empregado também nos países platinos.'",
        "'Floreado'",
        "'Embriagado, tonto, perturbado; a meia embriaguez.'",
        "'Foguete'",
        "'Diz-se da criança arteira, traquinas, etc.'",
        "'Forrobodó'",
        "'Desordem, bochinche, baile popular.'",
        "'Frege'",
        "'Conflito, bagunça, briga. Também significa hotel ou pensão muito ruim.'",
        "'Fresquear'",
        "'Ato de abster-se de modo acovardado; desistir por razões sentimentais; fazer birra ou manha ao não continuar ou não prosseguir com a realização de algo ou de alguma coisa em específico.\\n\\nExemplos: \\n1. \"Não te fresqueia, guria!\" \\n2. \"Só porque começou a cair uma chuvinha, o guri já se fresqueou e não quis sair de casa.\"\\n'",
        "'Friaca'",
        "'Sinônimo de frio. \\n\"Bah, mas que friaca!\" '",
        "'Frio de renguear cusco!'",
        "'Expressão utilizada quando esta muito frio e forma-se a geada, então os cachorros fazem uma especie de revezamento com as patas para andar. '",
        "'Fuçar'",
        "'Procurar. \\n\\n\\'\\'vou fuçar(procurar) na internet até encontrar\\'\\''",
        "'Fuleiro (a)'",
        "'De péssima qualidade: \"esse baile tá muito fuleiro\".'",
        "'Fulistrica'",
        "'Pessoa insignificante, pessoa sem mérito.'",
        "'Funda'",
        "'estilingue, bodoque, brinquedo de criança, principalmente do interior do estado, '",
        "'Furungar'",
        "'Insistir enfadonhamente a respeito de um assunto. Intrigar com mexericos insistentes.'",
        "'Futriquinha'",
        "'Coisa velha, sem valor.'",
        "'Fuxicar'",
        "'Coser com grandes pontos, sem muito cuidado, pano ou roupa. Também significa bulir, remexer em qualquer coisa. Intrigar, enredar, furungar.'",
        "'Fuzarca'",
        "'Confusão; aglomeração de pessoas envolvidas em brincadeiras, brigas ou sacanagens; \"botaram fogo na patente do Amâncio e dizem que o Pedro tava metido na fuzarca\";'",
        "'Gadeia'",
        "'Cabelo. ex.: penteei as gadeia! Tá na hora de cortar essas gadeia!'",
        "'Gaitada'",
        "'Grande risada, gargalhada.'",
        "'Galgo'",
        "'O mesmo que louco de fome, comilão, usado na década de 1960 a 1970'",
        "'Galo Cinza'",
        "'Similar a expressão Galo Veio. Amigo de Longa Data. Parceiro em Indiadas'",
        "'Galo Véio'",
        "'Grande Amigo; Parceiro de Indiadas'",
        "'Garantonhas'",
        "'Diz-se do aspecto do tempo, quando se apresenta feio ou ameaçador de chuva.'",
        "'Garganta'",
        "'[adj.] Quem gosta de se exaltar através de histórias inventadas ou aumentadas. Mentiroso. Falastrão. (ex.: Não acredito em ti, tu és muito garganta.) 2. [adj.] Quem vive ameaçando ou prometendo sem cumprir. (ex.: Ele vive prometendo a prenda em casamento mas nunca casa. É um garganta mesmo.)'",
        "'Garralho'",
        "'Bezerro(a) de qualidade inferior, tanto de raça como de constituição física.'",
        "'Gastando a nega'",
        "'1. Fazendo algo muito bem\\n'",
        "'Gastura'",
        "'Azia, mal do estômago, enfarte.'",
        "'Gato muito miador, não é bom caçador'",
        "'Quem fala muito, mas não cumpre tudo o que anuncia...'",
        "'Gaudério'",
        "'1. Sinônimo de gaúcho.\\n2. Sujeito alegre. \\n3. Regionalismo gauchesco e da região serrana catarinense para o tipo humano, morador do campo, de hábitos rudes, errante, que acompanha qualquer pessoa até que a deixe para seguir outra.'",
        "'Gavola'",
        "'Denominação ao gaúcho que exalta exacerbadamente seus feitos, qualidades; gabar-se; vangloriar-se. [Ex.: Sirvam nossas façanhas de modelo a toda Terra.] #quasenunca'",
        "'Gazear'",
        "'Faltar propositalmente à aula, ou mentir que vai ao colégio e ir pra outro rumo sem os pais saberem. Gíria antiga muito usada nos colégios gaúchos e pouco usada no Brasil hoje em dia.'",
        "'Gentarada'",
        "'Gentama, gentaria, multidão.'",
        "'Gente fina'",
        "'Diz-se de indivíduo com qualidades e virtudes. Amigo, parceiro, \"dus  meu\".'",
        "'Ginete'",
        "'Pessoa que monta bem, com firmeza e com garbo. Bom cavaleiro domador. Também significa o vulto de um homem a cavalo.'",
        "'Godô'",
        "'Artimanha, despiste, desculpa esfarrapada. \"O fulano me deu um godô\".'",
        "'Goleira'",
        "'[s.f.] Trave de futebol.'",
        "'Gordacho'",
        "'Gorducho, muito gordo, gordíssimo.'",
        "'Grandote'",
        "'Diz-se do menino já grande, ou do animal muito novo, já de tamanho regular.'",
        "'Grauzento (a)'",
        "'Esta palavra em nosso vocabulário se refere a uma pessoa que quer ser poderosa, maioral. Resumindo, se acha o bom (a).'",
        "'Gravatá'",
        "'Cactácea da familia Bromeliae, que se espalham pelos campos, tem espinhos finos que machucam quem anda sem calçados. '",
        "'Graxaim'",
        "'O graxaim ou sorro (Pseudalopex gymnocercus) é um mamífero carnívoro da família dos canídeos, encontrado nos campos úmidos do Sul do Brasil, chega a medir até 1 metro de comprimento, com pelagem cinza amarelada, o alto da cabeça marrom ferrugíneo, orelhas grandes e focinho afilado. Também é conhecido pelos nomes de graxaim-do-campo, guaraxaim e sorro.'",
        "'Graxeira'",
        "'Panela grande ou caldeirão onde se fervem os ossos e se derrete o sebo da rês, para extrair a graxa. Também significa o lugar onde é instalado esse caldeirão nas charqueadas ou nas estâncias.'",
        "'Gringada'",
        "'Grupo de pessoas de origem italiana ou alemã, geralmente originarias da região da Serra Gaúcha. Similar ao termo \"alemoada\" para o grupo de pessoas de descendência alemã.'",
        "'Grude'",
        "'Namoro, derriço.'",
        "'Guaiaca'",
        "'carteira de dinheiro e documentos do gaucho'",
        "'guaipeca'",
        "'Sinônimo: cusco, cachorro'",
        "'guampa'",
        "'chifre, corno'",
        "'Guapo'",
        "'Forte, vigoroso, valente, bravo.'",
        "'Guasca'",
        "'1. Homem rústico, forte, guapo, valente.\\n\\n2. Tira, corda de couro cru, isto é, não curtido.\\n\\n3. Pênis.'",
        "'Guaxa'",
        "'Rebenque curto e grosso usado para doma.'",
        "'Guenzo'",
        "'Fora de prumo, que foi tirado de sua posição normal, inclinado, torto, pendido para um lado, inseguro, bamboleante.'",
        "'Guincha'",
        "'Poldra, potranca, égua nova, gueixa. Também significa mulher despudorada.'",
        "'Guisado'",
        "'Carne moída refogada'",
        "'Guri de Apartamento'",
        "'Utiliza-se quando queremos nos referir a alguém que não tem muita experiência, criado sempre dentro de casa (ou pela avó).  '",
        "'guria'",
        "'sinonimo de menina ,feminino de guri '",
        "'Guria do céu'",
        "'quando se está abismado com alguma coisa, por exemplo: Guria do céu, o que aconteceu contigo?'",
        "'Gurizada'",
        "'Rapazio, meninada, muchachada, gurizeiro.'",
        "'Gurizear'",
        "'1. Ato de \"dar de guri\"\\n2. Infantilidade\\n3. \"Deixar alguém na mão\"'",
        "'Haedo'",
        "'Coxilha localizada no sul do município de Livramento.'",
        "'Haraganear'",
        "'O animal que anda solto por muito tempo, sem prestar serviço algum tornando-se arisco. Também se aplica, em sentido figurado, às pessoas, significando vadiar, gauderiar, vagabundear, andar sem ocupação, passear de um lado para outro sem procurar serviço.'",
        "'Hechor'",
        "'Asno ou burro que serve de garanhão para fecundar as éguas, a fim de promover a hibridação de que resulta o gado muar, isto é, as mulas.'",
        "'Hep'",
        "'Usa-se no campo para excitar os animais a andarem.'",
        "'Heréu'",
        "'Herdeiro, dono, proprietário.'",
        "'Hom'",
        "'Interjeição ‘Hum!’'",
        "'Horneiro'",
        "'O mesmo que João-de-Barro.'",
        "'Horteleiro'",
        "'Hortelão.'",
        "'Hosco'",
        "'O mesmo que osco.'",
        "'Hospe'",
        "'Abreviação de hóspede.'",
        "'Ilex paraguariensis'",
        "'Nome científico da erva mate.'",
        "'Incherido'",
        "'Presumido, ganjento, convencido, metido.'",
        "'indiada'",
        "'Grande quantidade de homens do campo.\\nMas nós gaúchos usamos mesmo a expressão: \" Fizemos uma indiada!\" Que quer dizer: fizemos um programa de índio.'",
        "'Índio véio'",
        "'gaúcho de fibra '",
        "'Índio velho'",
        "'[s.m.] Forma de tratamento utilizada entre pessoas com qualquer nível de conhecimento. Também pode ser utilizada na forma reduzida, apenas como \"índio\". (ex.: E aí, índio velho, como como é que tu tá?)\\n'",
        "'Infernizar'",
        "'Aborrecer, impacientar, arreliar, enfadar, incomodar, apoquentar, amargurar.'",
        "'Inflador'",
        "'Bomba de encher bola, pneu, etc.'",
        "'Inhapa'",
        "'Gorjeta. \\n\\n*Contribuição do Alfabeto de Quaraí'",
        "'Inhato'",
        "'Que tem nariz curto e arrebitado; que tem nariz curto e arrebitado; que tem nariz chato.'",
        "'Inhé'",
        "'Onomatopeia designativa da voz dos sapos e das rãs.'",
        "'Instrovenga'",
        "'Instrumento ou máquina, de pouco valor.'",
        "'Intanguida, encarangada'",
        "'Quem sente muito frio'",
        "'Inté'",
        "'Até. Também significa “até logo”, “até outra vista”.'",
        "'Interter'",
        "'O mesmo que entreter. '",
        "'Inticá!'",
        "'Significado: Provocar alguém. Pegar no pé'",
        "'Inticar'",
        "'Provocar, desafiar, mexer com alguém.'",
        "'Ir aos pés'",
        "'Defecar, realizar suas necessidades fisiológicas.'",
        "'Isonero'",
        "'Desassossegado, sem descanso.'",
        "'isqueiro'",
        "'O ânus; \"tá com coceira no isqueiro\": aquele que não  para quieto.'",
        "'Isso é falta de laço!'",
        "'Ampla utilização, desde um chilique de guria até um desfalque no caixa da cooperativa. '",
        "'Ja tah se passando!'",
        "'Passar dos limites, ofender.'",
        "'Jacu'",
        "'1. Sujeito pouco inteligente, besta, sem noção.\\n2. Ave galiforme da família dos cracídeos que alimentam-se de frutas, folhas e brotos.'",
        "'Jaguara'",
        "'Pejorativo. sem crédito, adpto da lei do menor esforço...'",
        "'Jaguatirica'",
        "'Carnívoro felídeo, também chamado de maracajá e gato-do-mato-grande.'",
        "'Japona'",
        "'Casaco de lã ou outro tecido de grande poder de retenção de calor, usado em tempos de frio glacial como há nos Campos de Cima da Serra.'",
        "'Jardineira'",
        "'Carro de quatro rodas, puxado por cavalos, muito usado nas estâncias. Também significa dança antiga.'",
        "'Jeta'",
        "'Azar, má sorte.'",
        "'Jiboiar'",
        "'Ter um momento de descanso após a refeição. Leva esse nome porque enquanto faz a digestão a pessoa fica meio estirada, como uma jiboia após o almoço. Acontece quando a pessoa come demais.'",
        "'Joaninha'",
        "'Alfinete de segurança. Também significa jacundá.'",
        "'Jogador'",
        "'Osso do peito das aves, em forma de forquilha.'",
        "'Jorna'",
        "'Bebedeira, tomar uma jorna: embriagar-se.'",
        "'Jornadear'",
        "'Viajar a cavalo, caminhar.'",
        "'Jucão'",
        "'Mas que piá jucão esse.\\nSeu jucão.\\nO mesmo que bobo, trouxa.'",
        "'Judiado'",
        "'Machucado, sem forças, acabado, maltratado. \\n\"Não judia o teu irmão, guri!'",
        "'Judiar'",
        "'machucar,beliscar, maltratar\\n\\n\\'\\'não judia dele\\'\\'\\n\\n\\'\\'não belisca ele\\'\\''",
        "'Judiaria'",
        "'Malvadeza, maus tratos.'",
        "'Junco'",
        "'Planta com que, em alguns lugares, se preparam os acolchoados dos lombilhos.'",
        "'Junta'",
        "'Parelha de bois mansos que puxam lado a lado.'",
        "'Kakedo'",
        "'Pessoa que não vale nada.'",
        "'Lá se foi o boi com a corda'",
        "'Significa: acabou nao tem mais jeito afinal o boi escapou e levou até a corda junto. Se a corda ficasse, tu poderias até tentar laçar o boi, mas como foi-se o boi com a corda, não tem mais jeito.'",
        "'Lábia'",
        "'Habilidade na conversa.'",
        "'Lacraia'",
        "'Espécie de canoa.'",
        "'Lagarteando'",
        "'Diz-se do sujeito que está ao sol, aquecendo-se. \"Hoje tá bom pra pegar um chimas e ir pra Redença, lagartear\".'",
        "'Lagartear'",
        "'Sinônimo de dormir, descansar deitado ou expôr-se ao sol preguiçosamente.\\nÉ comum que se coma bergamota ao se lagartear.'",
        "'Lambada'",
        "'Relhada, laçaço.'",
        "'Lambança'",
        "'Intriga, embrulhada, briga, bate-boca, enredo.'",
        "'Lambão'",
        "'Porcalhão, imundo, o que anda com roupas maltrapilhas e sujas.'",
        "'Lambe graxa'",
        "'Cachorro vira-lata, sem raça definida.\\nEx: No meio da churrascada me aparece um lambe graxa esperando um osso cair da mão'",
        "'Lambuja'",
        "'O que se dá de vantagem nas apostas. O partido concedido ao adversário.'",
        "'Lanchão'",
        "'Pé muito grande. Aumentativo de lancha.'",
        "'lanhado'",
        "'arranhado, com a pele riscada....\\nentrei naquele mato e saí todo lanhado do meio do espinharedo.'",
        "'Lanhar'",
        "'Machucar, \"ralar\". Ex.: \"Mas eu vô te lanhá a pau, ô guri!\"'",
        "'Lasquiado'",
        "'Chinelão, enxerido, metido a besta\\n\\n*Contribuição do Alfabeto de Quaraí'",
        "'Légua de beiço'",
        "'Quando o lugar é distante!  distância incerta que na maioria das vezes, vale bem mais que uma légua, geralmente associada ao gesto de distender o lábio inferior; Ex. Aquele galpão fica uma légua de beiço!'",
        "'Lenquiar o lombo a laço'",
        "'Surrar alguém até o ponto de ferir.'",
        "'Levar uma tunda de rabo de tatu'",
        "'Equivalente a apanhar, ou levar uma camassada de pau.'",
        "'Ligeiro'",
        "'Nome dado ao indivíduo que viaja a pé pela via férrea.'",
        "'Lindeiro'",
        "'adj. vizinho de terra, terras que fazem fronteira direta uma com a outra'",
        "'Linguiça'",
        "'Trapaça.'",
        "'Linterna'",
        "'Lanterna'",
        "'Livreto'",
        "'Caderno pequeno para anotações. \\n*Contribuição do Alfabeto de Quaraí'",
        "'LIXIGUANA'",
        "'Pequena abelha, parecida com um marimbondo, que produz mel delicioso. \"Bah, tá um frio de tirar LIXIGUANA\"'",
        "'Loco'",
        "'Termo vago para designar sujeito do sexo masculino, sem juízo de valor ou de sua saúde mental. Alternativa: lôco'",
        "'Loco de especial'",
        "'Macanudo,Muito bom, excelente,gostoso, agradável'",
        "'lomba'",
        "'Terreno em declive.\\n\"vou descer a lomba!\"'",
        "'Lombeira'",
        "'Preguiça, modorra, moleza no corpo.'",
        "'Lonca'",
        "'Pessoa que costuma fazer algo errado ou estranho. Ex: Jõao bateu em um poste - \"Mas é um lonca mesmo!!\"'",
        "'Lonjura'",
        "'A imensidade do campo, a distância.'",
        "'Lonquear'",
        "'Raspar, barbear, raspar o couro da rês com faca\\n\"Rápido de lonquear rato dormindo.\"'",
        "'Loqueou'",
        "'Ficou louco.\\nAplicação: Tu até loquoeu, o que estás pensando?'",
        "'Lorota'",
        "'Conversa sem importância, jactância, mentirosa, pabulagem, fanfarrice, banalidade, mentira, embuste.'",
        "'Loscanha'",
        "'Diz-se do indivíduo aluado, meio louco.'",
        "'Louco de bom'",
        "'Quando algo é muito bom.'",
        "'Louco de especial'",
        "'Quando algo é muito especial.'",
        "'Má Tchê'",
        "'Usado em momentos de indignação. Ex.: má tchê, que que tu ta fazendo parado aí ainda.'",
        "'MACANUDO'",
        "'Muito bom. Ótimo'",
        "'Maçaroca'",
        "'Intriga, mexerico.'",
        "'Macega'",
        "'Arbusto rasteiro que viceja, em geral, nos campos de má qualidade. Pastagem. Capim alto.'",
        "'Machucão'",
        "'Pisadura; contusão.'",
        "'Magal'",
        "'Aquele que rebaixa o carro e costuma andar com o vidro do \"auto\" aberto com o braço para fora ouvindo música alta.\\nA Vestimenta típica varia bastante porém sempre apresenta um acessório chamativo como por exemplo: Um belo chapéu ou fivela e, nos urbanos, o maldito boné e correntes no pescoço.\\nAs músicas podem variar de acordo com a região: bailão, poperô de rádio e até pagode. Relatos recentes contam que até o \"Tecno brega\" vem sendo executado pelos magais.'",
        "'Magra lebre'",
        "'Termo usado para descrever uma situação complicada ou algo que não é satisfatório. Por exemplo: \"Só isso? Magra lebre\"'",
        "'Magrão'",
        "'adj.\\n1. Pessoa de quem se omite o nome ou lhe é desconhecido. (ex.: Tchê, quem é aquele magrão ali?)\\n2. Forma de tratamento que pode ser uitilizada entre pessoas com qualquer nível de conhecimento, inclusive desconhecidas. (ex.: Bah, magrão; me fizeste cair os butiá do bolso.)'",
        "'mais à vontade que bugio em mato de boa fruta'",
        "'Sentir-se em casa, à vontade. '",
        "'Mais agarrado que carrapato em gado magro'",
        "'Muito apego, junto, com muita fome.\\nEx: Grudado numa ripa de costela. Mais agarrado que carrapato em gado magro...'",
        "'Mais ansiado que anão em comício.'",
        "'nervoso,inquieto,preocupado .'",
        "'Mais apertado que sardinha em lata'",
        "'Quando algo está muito cheio, como um ônibus, por exemplo. Quando não cabe mais nada, ninguém.'",
        "'Mais assustado que sapo em cancha de bocha'",
        "'É uma frase.'",
        "'Mais atravessado que fiofó de lagarto'",
        "'Coisa mal feita, amadorismo, trabalho mal executado.'",
        "'Mais beijada que anel de bispo'",
        "'Quando a moça é muito namoradeira. '",
        "'Mais comprido que enterro de rico'",
        "'Diz-se de um mate muito comprido ou de qualquer coisa muito demorada. '",
        "'Mais curto que coice de porco!'",
        "'Auto explicativa'",
        "'Mais enrolado que cristal pra viagem'",
        "'Expressão utilizada no sentido literal, quando algo está enrolado mesmo, fisicamente. '",
        "'Mais estropiado que cavalo de contrabandista'",
        "'Expressão usada quando o gaúcho está muito doente ou muito cansado!'",
        "'Mais faceiro que bugiu em mato de fruta!'",
        "'Uma pessoa muito, mas muito feliz! '",
        "'Mais faceiro que vivente embarcando em uma Kombi pro Bororé'",
        "'Baseada em uma música do Mano Lima, surgiu em uma conversa entre amigos do 3° ano do colégio Farroupilha, após pesquisar, começamos a usar a expressão quando um dos guris falou sobre onde fica o distrito do Bororé, descobrindo que fica distante 470 km aproximadamente da capital da República Riograndense. Adicionamos a Kombi pois é um veículo comum no estado, sendo quase obrigatório em todas as famílias interioranas e também por sua capacidade interna e dirigibilidade.'",
        "'Mais fechado que porta de convento'",
        "'Pessoa introvertida'",
        "'Mais inútil que cinzeiro em moto'",
        "'Auto explicativa'",
        "'Mais perdido que cusco em tiroteio'",
        "'Diz-se de alguém perdido em comparação à desorientação de um cachorro em meio a um tiroteio.'",
        "'Mais perfumado que mão de barbeiro'",
        "'Pessoa muito perfumada, bem cheirosa.  '",
        "'Mais sujo que pau de galinheiro'",
        "'Sujeito trapaceiro, larápio, sem vergonha...'",
        "'Malito'",
        "'[adj.] Vem do espanhol \"malito\", que é o diminutivo de mal. Atribui-se a quem está muito mal, muito debilitado ou em qualquer situação muito ruim. (ex.: Eu trabalhei tanto que estou malito.)'",
        "'Maloqueiro'",
        "'Aquele que vive em maloca ou em grupo de bandidos. Habitente de maloca.'",
        "'Mamado'",
        "'Aquele que se encontra embriagado.'",
        "'Manco'",
        "'Com a perna ou pata dianteira machucada, diferente de rengo, que se refere à pata de trás. '",
        "'Mandinho'",
        "'Criança pequena. Sinônimo de guri, piá.   '",
        "'Maneta'",
        "'Diz-se da pessoa que tem falta de um braço.'",
        "'Manga'",
        "'1. Chuva forte e rápida.\\n2. Mangueira de plástico, mangueira de jardim.'",
        "'Manguá'",
        "'Instrumento usado para debulhar feijão feito com uma vara e arames na ponta'",
        "'Manguaça'",
        "'bebedeira, ficar muito bêbado.\\nEx.: ontem ele ficou na maior manguaça'",
        "'Manotaço'",
        "'Pancada que o cavalo dá com uma das patas dianteiras, ou com ambas.\\n\\nBofetada, pancada com a mão dada por pessoa. '",
        "'Maomeno'",
        "'Contração de mais ou menos. Em alguns pontos do estado, se diz \"marromeno\". '",
        "'Maricas'",
        "'Homem que se ocupa de trabalhos próprios de mulheres. Homem efeminado. Homem que gosta de intrometer-se em assuntos reservados a mulher'",
        "'Maroto'",
        "'Mesmo que caborteiro, difícil de domar...'",
        "'Marro'",
        "'Porrada, Soco, Paulada. ex.: Vou te dar um marro na cara! Dei-lhe um marro nos corno!\\n'",
        "'Mas ai sim'",
        "'espanto, ficar admirado com algo.'",
        "'Mas Daonde'",
        "'quando não acreditamos em algo, ou duvidamos. é falado bem cada som da sílaba.'",
        "'Mas Nem Te Apresenta!'",
        "'Quando a pessoa tá com pouca moral, falando algo sem credibilidade.'",
        "'Mascando brim'",
        "'Com as calça (calção, bermuda, o que for) atolado no rego.'",
        "'mate'",
        "'bebida resultante da infusão de folhas da Ilex paraguaiensis, nossa conhecida erva mate devidamente preparada, que se toma em cuia com o auxílio de uma bomba ou em taças. '",
        "'matear'",
        "'Sinônimo de tomar chimarrão.\\nEx: Vamos matear na praça?\\n'",
        "'Mateira'",
        "'Espécia de bolsa, feita normalmente de couro, onde se leva os aparatos pra se fazer chimarrão: garrafa térmica, cuia, bomba e a embalagem de erva mate.'",
        "'matreira'",
        "'que vive no mato, arisca, fugidia, animal que dificilmente se deixa apanhar. Diz-e também de pessoa esquiva, que foge a tudo .'",
        "'Matucho'",
        "'Gaúcho do Mato Grosso. '",
        "'Matungo'",
        "'Cavalo vagabundo. É para os cavalos o que o guaipeca é para os cachorros.'",
        "'Maturrengo'",
        "'Mau cavaleiro.'",
        "'Matusco'",
        "'Semelhante a \"matuto\". Adjetivo utilizado para designar uma pessoa desajeitada.'",
        "'Maula'",
        "'Frouxo, depreciado, sem nenhum valor...'",
        "'Mazah'",
        "'(Também \"mazá\".) Corruptela de \"mas, ah!\". Interjeição de satisfação referente a algo, uma pessoa ou situação. Exemplo: \"Mazah, galo veio!\"\\n\\n'",
        "'Me abri pra ti'",
        "'Algo como: \" tu é o cara mesmo!\". Tirei o chapéu.'",
        "'Me caíram os butiá do bolso!'",
        "'Expressão que denota espanto, incredulidade.\\nOs jurados desclassificaram o declamador porque estava calçando alpargatas? Bah!!! Me caíram os butiá do bolso com essa!!!\\n'",
        "'Me caiu a faca da mão!'",
        "'Ficar sem ação, paralisado. '",
        "'Me caiu as trança!'",
        "'Fiquei decepcionado!'",
        "'Me caiu os butia do bolso'",
        "'É uma expressão regionalista típica do Rio Grande do Sul.\\nUsa-se quando a pessoa quer dizer que está impressionada, assustada ou estupefada.\\nA expressão é usada porque o butiá é uma fruta pequena, pouco maior que uma bola de gude, dando a idéia de que quando se pára de sopetão, eles facilmente caem dos bolsos.\\nEx.: \\'Quando descobri que até a Samantha participou, me caiu os butiá do bolso!\\''",
        "'ME dormi'",
        "'Dormir além do horário, atrasar-se'",
        "'Me froxa'",
        "'Quando alguém está te incomodando, se arriando, tu fala: mas me froxa, tchê!'",
        "'Me pisei'",
        "'Machuquei, me feri'",
        "'Me primeriô'",
        "'Chegar em primeiro lugar, chegar antes, fazer alguma coisa antes que alguém.'",
        "'Me pula sexta feira'",
        "'Quando tem um dia especial essa expressão é usada. digamos não vejo a hora desse dia chegar.'",
        "'Me tapei de nojo!'",
        "'\"Entrei no elevador e o cidadão, ali, fumando. Bah, mas me tapei de nojo, tchê!\"'",
        "'Me tapei de quero-quero'",
        "'Sair correndo no estilo Usain Bolt.'",
        "'Melena'",
        "'Cabelo?\\nCabelo volumoso e normalmente desajeitado.'",
        "'Menear'",
        "'Dar golpes com a mão. Executar qualquer coisa com as mãos. Manejar.'",
        "'Mensú'",
        "'Indio colono, de fora, não habituado com a cidade'",
        "'Mequetrefe'",
        "'Diz-se do indivíduo vagabundo, tratante, capadócio, acanalhado, fanfarrão.'",
        "'Mercadinho'",
        "'Pequena casa de comércio onde se faz venda de frutas e cereais.  O que no Rio de Janeiro e São Paulo se chama de quintanda.'",
        "'Merece'",
        "'Sinônimo de \"de nada\" em resposta a \"muito obrigada\".'",
        "'Merecundência'",
        "'Falta de respeito, sem explicação'",
        "'Metido a facão sem cabo'",
        "'Parece ser valente, mas na verdade não é de nada.'",
        "'Meu Favor!'",
        "'Meu Deus! Expressão de espanto.'",
        "'Michar'",
        "'v int.\\n1. Desistir.\\n2. Desanimar, esmurecer.\\n3. Colocar empecílhos.\\n4. Declinar ou rejeitar oportunidades e convites.\\n(ex. O time não pode se michar; é difícil mas podemos vencer.)'",
        "'Michorna'",
        "'Confusão, bagunça, coisas viradas do avesso. '",
        "'Migué'",
        "'Ato de enganar, encobrir, mentir. \"O fulano me deu um migué dizendo que vinha hoje, mas até agora não apareceu\". '",
        "'Mijada'",
        "'Chamar atenção de alguém. Ex. O professor deu uma mijada no aluno porque ele tentou colar na prova.'",
        "'Milicada'",
        "'Grupo de milicos. O mesmo que milicama.'",
        "'Mimosa (o)'",
        "'Pessoa querida, bonita, agradável\\nEx: Que mimosa essa guria!'",
        "'Mingo'",
        "'Pequeno, menor, mínimo: “o dedo mingo”, o mínimo; “a costela minga”, a menor costela.'",
        "'minguado'",
        "'desprovido de corpo (substância).'",
        "'Minuano'",
        "'referência há vento andino; frio e seco, que sopra do sudoeste no inverno.'",
        "'Mirador'",
        "'Pequena e elevada construção no alto das casas, para gozo de largas perspectivas.  O mesmo que mirante.'",
        "'Mixaria'",
        "'Algo com pouco valor, que não é de nada.'",
        "'Môcha'",
        "'Mulher de seios pequenos.'",
        "'Mocó'",
        "'Local escondido, esconderijo. \"Vou ficar no meu mocó hoje.\"'",
        "'Mocosado'",
        "'Ficar escondido. \"Tô a fim de ficar mocosado\"'",
        "'Mondonguinho'",
        "'Também conhecido como bucho, ou \"dobradinha\". É exatamente isso, o bucho do boi. Geralmente preparado com molho vermelho e acompanhado por pão colonial pra \"potchar\" no molho.'",
        "'Monteador'",
        "'Quem costuma caçar ou até simplesmente quem vive em região montanhosa.'",
        "'Moquear'",
        "'Esconder, ocultar. '",
        "'Moquiado'",
        "'Quando o indivíduo se faz de morto. '",
        "'Morocha'",
        "'[adj.] Forma de tratamento utilizada para uma mulher com quem se tem bastante intimidade, como a cônjuge ou companheira. É uma palavra de origem espanhola, que também quer dizer \"morena\". (ex.: Mas que saudade eu tava de ti, morocha.)'",
        "'Mosquear'",
        "'Quando o cavalo movimenta a cola para espantar as moscas que o perseguem, ou fazer tal movimento quando é açoitado ou esporeado.'",
        "'mugre'",
        "'sujeira. Do cast. mugre'",
        "'Muita mão'",
        "'Desculpa para se negar a fazer algo por ser muito trabalho. \"Bah, muita mão ir buscar lenha\"\\n\\nVariação: alta mão. '",
        "'MULITA'",
        "'Pequeno tatu (Dasypus hybridus) encontrado nos campos do sul do Brasil. \"Pra se segurar no barranco, cravou as unha na terra como MULITA cavando buraco\"'",
        "'Munaia'",
        "'Algo grande.'",
        "'mundaréu'",
        "'muito, bastante'",
        "'Muquiço'",
        "'Usado no RS pra se referir a alguém sujo, ou a alguma lugar sujo e bagunçado. '",
        "'Muquifo'",
        "'Lugar sujo, desagradável.\\nEx: Aquele hotel era um muquifo.'",
        "'Na capa da gaita'",
        "'Quando a pessoa está muito cansada. Diz-se também de indivíduo muito velho ou muito debilitado. '",
        "'Na corrida'",
        "'Ligeiro, depressa, acelerado. \\nSignifica que algo deve ser feito muito rápido, sem perda de tempo.\\nExemplos: \\nVai lá, na corrida.\\nVai compra um refri, na corrida.'",
        "'Na manha'",
        "'[prep. + s.f.] Tranquilo; sem compromissos ou preocupações. (ex.: Ontem eu tive muito trabalho, mas hoje eu estou na manha.) 2. Lentamente; devagar; sem se esforçar. (ex.: Vamos na manha, ainda falta muito tempo para a reunião começar.)'",
        "'Na ponta dos cascos'",
        "'Quando o indivíduo anda sorrateiramente, com todo o cuidado, tentando não fazer barulho. Também é utilizado para designar o indivíduo que está 100%, no melhor de sua forma.'",
        "'Na raiz'",
        "'Em cheio, na mosca. Ex: deu um tapa na raiz da orelha'",
        "'Naco'",
        "'Naca. Pedaço de fumo ou de carne.'",
        "'Namorido'",
        "'Namorado que vive com a namorada, e se comporta como marido.'",
        "'Naniquice'",
        "'Pequenez, pouca altura.'",
        "'Não ata nem desata.'",
        "'Indeciso,  pensativo além do comum, enrolador...'",
        "'Não caga nem desocupa a moita'",
        "'Expressão usada para o sujeito que não se decide. Não vai nem fica. Não anda nem desanda.'",
        "'Não dá nada'",
        "'Algo como: \"não te preocupa, isso não vai nos trazer problemas futuros\". Ou simplesmente: \"Não esquenta\".'",
        "'Não é farinha de fazer hóstia'",
        "'Indivíduo dado a andar pelos caminhos tortos da vida.'",
        "'Não emprenha nem sai de cima.'",
        "'Não se decide, fica no meio termo, indeciso,....'",
        "'Não me faz te pegar nojo!'",
        "'Quando alguém faz algo nada admirável.'",
        "'Não tá morto quem peleia!'",
        "'Não está morto quem ainda disputa. Enquanto lutamos temos chance de vencer.'",
        "'Não te acadela'",
        "'Não te bobeia, não te faz de louco!'",
        "'Nascido'",
        "'Leicenço, furúnculo. Diz-se, por exemplo: “tenho um nascido no braço”. Termo muito usado na campanha.'",
        "'Nazarenas'",
        "'Esporas grandes. Usa-se também como adjetivo: esporas nazarenas.'",
        "'Negaça'",
        "'Esconderijo especial construído com ramos de árvore, em forma de círculo, em cujo o meio o caçador se oculta para atirar nos bandos de marrecões ou marrecas que passam voando.'",
        "'Negalhas'",
        "'Pequena porção, quantidade insignificante.'",
        "'Negão'",
        "'[adj.] Forma de tratamento utilizada entre pessoas com qualquer nível de conhecimento entre si. (ex.: E aí, negão, como é que tu vais?) 2. [adj.] Pessoa de quem se omite o nome ou lhe é desconhecido, independentemente de qualquer alusão a etnia. (ex.: Bah, mas como é mesmo o nome daquele negão que joga de atacante?)'",
        "'negrinho'",
        "'sinônimo de brigadeiro doce de chocolate muito usado em festas de aniversario'",
        "'Nem que a vaca tussa!'",
        "'De jeito nenhum, de maneira alguma...'",
        "'Nhonhô'",
        "'Tratamento familiar dado aos meninos, pelos escravos.'",
        "'Nicada'",
        "'Batida de uma bola de vidro em outra, conhecido jogo infantil.'",
        "'Niqueleira'",
        "'Porta-níqueis, bolsinha pequena.'",
        "'Nó cego'",
        "'Enrolado, mal pagador, lento, molenga, atrapalhado ruim '",
        "'Nó nas costas'",
        "'Mania; excessivo; mau costume; esquisitice.. Exemplo: O fulano é cheio de nó nas costas! (Fulano é cheio de manias)'",
        "'Nonato'",
        "'Não nascido. O terneiro tirado do ventre da vaca que foi carneada.'",
        "'Nos pé da égua'",
        "'Quando a pessoa está passando por uma dificuldade, está mal'",
        "'Nos pés da égua'",
        "'Diz-se do indivíduo muito cansado...'",
        "'Noviço'",
        "'Cavalo novo. Pessoa inexperiente.'",
        "'nulidade'",
        "'Pessoa sem mérito nenhum, índio inútil, sem serventia, quem não presta para nada.'",
        "'Nútria'",
        "'Ratão do banhado.'",
        "'Nuvem'",
        "'Velhaco, vivo, esperto, finório, perspicaz, atilado, pouco escrupuloso. Emprega-se também como substantivo: o que andará fazendo esta nuvem?”,  isto é, este sujeito de vida equívoca e pouco limpa.'",
        "'O ninho está para um lado e a galinha canta para o outro.'",
        "'Quando alguém tenta enganar o outro, dizer que vai pra um lugar, mas na verdade vai pra outro...'",
        "'O que é um peido pra quem tá cagado'",
        "'Muito usada para justificar uma atitude inesperada para alguém em situação desfavorável, sobretudo  financeiramente.'",
        "'O risco e o fedor'",
        "'Diz-se da chinoca mui magra, pois está tão magra que parece ter sido reduzida apenas ao \"risco e o fedor\", referência à vagina (risco) e ao ânus (fedor). Ex.: \"Essa guria está que é só o risco e o fedor!\", significando que a tal está muito magra. Expressão erroneamente utilizada também para o gênero masculino atualmente por desconhecimento de sua origem destinada exclusivamente ao gênero feminino.'",
        "'Obedeença'",
        "'Obediência.'",
        "'Obrar'",
        "'Evacuar, defecar.'",
        "'Obrigação'",
        "'A família, os filhos. Diz um amigo a outro: “como vai a obrigação?”, isto é, como passa a família?.'",
        "'Ocalípio'",
        "'O mesmo que eucalipto.'",
        "'Ôche!'",
        "'Interjeição usada pelos carreteiros para fazer parar a carreta ou diminuir a marcha. É usada também quando se quer acalmar o boi que se quer pegar.'",
        "'Oigalê'",
        "'exprime admiração, espanto, alegria.\\nOigalê tchê porquera!'",
        "'Onça'",
        "'Moeda antiga, de ouro.'",
        "'Ontonte'",
        "'Anteontem, antes de ontem.'",
        "'Orear'",
        "'Expor ao ar ou ao vento qualquer coisa úmida: “orear a roupa, orear o charque fresco”. Secar por meio do vento: “estamos esperando que oreie um pouco o terreno para seguir viagem”.'",
        "'Orelhano'",
        "'Gado criado solto, sem dono. Sinônimo de gado \"alçado\" ou \"chimarrão\". A expressão deve-se ao nome do jesuíta Cristóbal de Mendoza Orellana, que introduziu o gado vacum na América do Sul.\\nA expressão foi popularizada pela música nativista de mesmo nome.\\n'",
        "'Orelhar'",
        "'Segurar o animal, cavalar ou muar, que será domado, por uma ou pelas duas relhas, para facilitar que o domador o monte.'",
        "'Oriental'",
        "'Adjetivo com que denominamos a República do Uruguai, apesar de ficar ao ocidente da nossa. Termo da antiga colônia espanhola.'",
        "'Orina'",
        "'Urina.'",
        "'Orizícola'",
        "'Que cultiva arroz: “países orizícolas”.'",
        "'Orre'",
        "'Interjeição que exprime satisfação por ter acontecido algo de mau a um adversário ou inimigo.'",
        "'Ossamenta'",
        "'Carcaça, esqueleto. Em sentido figurado, o corpo da pessoa.'",
        "'Ou caga ou desocupa a moita'",
        "'Decida-se'",
        "'Ovelha'",
        "'Em sentido figurado, a pessoa má conselheira, a que, por mau exemplo, põe as outras a perder. “Uma ovelha mestra põe o rebanho a perder.”'",
        "'Ovelheiro'",
        "'Cusco, cão parceiro da lida de campo, pastor de ovelha.'",
        "'Pacau'",
        "'Jogo de cartas usado na fronteira. Também significa o indivíduo que não possui um dedo. “Bater o pacau” significa morrer.'",
        "'Pacotilha'",
        "'Quadrilha feita de malfeitores.'",
        "'Pago'",
        "'[s.m.] Lugar ou região com a qual se tem uma ligação afetiva, por ter sido o local de nascença, de criação, por ter-se radicado ou por qualquer outro motivo que o valha. Lar. Pátria. [consulta também: \"rincão\" e \"querência\"] (ex.: Amo o Rio Grande do Sul porque esse é o meu pago.)'",
        "'Pai de fogo'",
        "'Madeira bem grossa colocada no fogo para que ele não apague por um longo tempo.'",
        "'Paisano'",
        "'Paisano: homem que não é militar, guerreiro civil, diz-se de militar quando anda sem farda! Também do amigo e companheiro o paisano também aquele que é conhecido de longa data, no Rio Grande do Sul. Expressão provavelmente espanhola, usada na banda oriental (Uruguai) . Uma tropa de paisanos passou a fronteira!\\n'",
        "'Pala'",
        "'[s.m.] Poncho de pala é o de fazenda mais fina que o de bichará, e com as pontas arredondadas. É mais leve e mais curto, e na campanha é considerado como traje mais decente. (ex.: Vou colocar o meu pala mais bonito pra ir pra bailanta logo mais.) 2. [s.f.] Amostra. Exemplo. Exibição. Também pode ser encontrada na variação \"palha\" ou \"palhinha\". (ex.: Se tu és um bom gaiteiro, dá uma pala pra vermos o que tu sabes.)'",
        "'Palanque'",
        "'Madeira para cerca'",
        "'Palheiro'",
        "'Cigarro de fumo crioulo, enrolado em palha de milho.'",
        "'Palpitoso'",
        "'Desejoso.'",
        "'pampa'",
        "'possui significados diversos. o mais comum é usar pampa para designar as extensas planícies do Rio Grande do Sul, Uruguai e Argentina, cobertas de passagens verdes onde vive o gado vacum e cavalar. '",
        "'Pança'",
        "'Indivíduo ridículo. Também significa ventre, abdômen.'",
        "'Pandorga'",
        "'Pipa, Papagaio.'",
        "'Pandulho'",
        "'Barriga, pança.'",
        "'Pangaré'",
        "'Cavalo de pelagem indefinida. Não é comum de ser encontrado. \\nex: Este cavalo é um baita de um pangaré!\\n'",
        "'Papata'",
        "'Negociata, roubalheira, mamata.'",
        "'Papudo'",
        "'Balaqueiro, jactancioso, blasonador.\\n\\nO termo é empregado para insultar, provocar, depreciar, menosprezar outra pessoa, embora esta não tenha papo.'",
        "'Parada'",
        "'Conhecido também como ponto de ônibus'",
        "'Passar o relho'",
        "'Dar uma surra.'",
        "'Pataquada'",
        "'Trejeitos, expressões de ...'",
        "'Pátio'",
        "'Como sinônimo de quintal, usado na capital. Área ao redor da casa, normalmente calçada e usada para colocar automóvel, ou como área de estar, para cevar um mate em roda de chimarrão.'",
        "'Pau pra toda a obra'",
        "'Aquele que faz de tudo um pouco...'",
        "'peão'",
        "'Homem ajustado para fazer o serviço do campo.'",
        "'Pechada'",
        "'Batida de trânsito'",
        "'Pelando'",
        "'\"Tchê, o mate está pelando\"\\nMuito quente, de queimar a boca.'",
        "'Pelear'",
        "'Brigar, lutar, combater, pelejar, teimar, disputar.'",
        "'Pelechar'",
        "'Trocar de pêlo. Mudança estacional do pelame dos animais, que trocam de um pêlo mais grosso e aspero (para maior proteção do frio do inverno) por um pêlo mais fino e sedoso (para conviver com maior facilidade com o calor do verão). Na maioria das espécies (cavalos, bois, cães, gatos....) trocam de peêo entre o inverno e o verão.'",
        "'Pelêgo'",
        "'Trata-se de um pedaço de lã de carneiro, colocado sobre a sela e preso por uma tira de couro chamada barrigueira, para que não escorregue. Sua função é amaciar o assento do arreio de lida com o gado'",
        "'Peleia'",
        "'Briga, luta, desavença, disputa.\\n'",
        "'peonada'",
        "'pionada ou pionagem; porção, grande número ou classe de peões; os empregados de uma estância ou casa ou os condutores de uma tropa. '",
        "'Perau'",
        "'Precipício, barranco'",
        "'Percanta'",
        "'Moça bonita, apresentável.'",
        "'Perdi o canto'",
        "'Oriundo de não escutar o canto do galo.\\nSinônimo de se atrasar, perder o despertador.'",
        "'Petiço'",
        "'Cavalo pequeno, curto, baixo.'",
        "'Pexada'",
        "'Batida, esbarrada. '",
        "'piá'",
        "'gurí, garoto, menino'",
        "'pialo'",
        "'tombo, cair no chão'",
        "'Piazada'",
        "'Ajuntamento de piás. Gurizada, meninada, garotada.'",
        "'Piazedo'",
        "'Criançada, jovens. Exemplo, extraído do blog http://www.bombachalarga.org/ver_poesia.php?id=139, poema Payador: \"...Deixaste nossos xucros corações num alvoroço;\\ndeixaste o piazedo com olhos úmidos\\ne falquejou os corações das prendas....\". '",
        "'Pichurum'",
        "'Grupo de pessoas que se juntam para realizar um serviço para outra.'",
        "'Picorrucho'",
        "'Variável em \"gauchês\" da palavra em desuso no português \"pequerrucho\", que significa pequeno, de colo. Se usa geralmente de forma carinhosa pra se referir a uma criança pequena.'",
        "'Piguancha'",
        "'Chininha, chinoca'",
        "'pila'",
        "'Dinheiro, reais'",
        "'PILETA'",
        "'local onde se lava roupas, o mesmo que tanque.\\n'",
        "'Pinar'",
        "'Sinônimo de sair. \\nPor exemplo, aqui não é um bom lugar, vamos pinar daqui.\\n\\n'",
        "'Pinchar'",
        "'Jogar, atirar, arremessar.\\nExemplo: Pinchei fora aquelas tranqueras.'",
        "'pingo'",
        "'é o cavalo do gaucho'",
        "'Pinguancha'",
        "'Mulher feia.'",
        "'Pinica'",
        "'O mesmo que bolita ou bolinha de gude.'",
        "'Pior'",
        "'Significa \"é mesmo\". \"Tem toda razão\"'",
        "'pisar'",
        "'quando era piá ficava correndo atrás de um matungo múi arisco, e não tinha consciência da periculosidade, aí que a vó gritava: \"Guri, sai daí senão tu vai se pisar\" - sin. machucar, ferir, quebrar, torcer, rasgar'",
        "'PISCA-PISCA'",
        "'Sinal luminoso intermitente do automóvel, localizado lateralmente às sinaleiras e aos faróis, que indica a direção para a qual o motorista pretende convergir.'",
        "'Pito'",
        "'Cigarro, fumo, crivo; Verbo: pitar.\\nExemplo: pitava que parecia uma chaminé!'",
        "'Plasta'",
        "'Pessoa lerda, muito devagar, que não desenvolve uma tarefa com prontidão. '",
        "'Pode tirar o cavalo da chuva!'",
        "'Quando não concorda com o que a outra pessoa está afirmando.'",
        "'Pollo'",
        "'Sinônimo de ¨frango¨. Como se diz em espanhol e também nessa região. '",
        "'Pombas (pombos)'",
        "'1. Gurias, guris, namorados... \\n2. Também é utilizado quando o indivíduo está incomodado com algo, de saco cheio. \"Pombas, tchê! Não fizeste o que te pedi.\"'",
        "'Porca pipa'",
        "'Espanto, susto.'",
        "'Porco Dio'",
        "'expressão de raiva, de desapontamento, de decepção, de desacordo.'",
        "'PORCO ZIO!'",
        "'(do italiano; literalmente \"Tio Porco\") Interjeição de baixo calão usada em momentos de irritação e/ou indignação. \"Má me voltou pra casa pinguço, PORCO ZIO!\"'",
        "'Porongo'",
        "'Cuia. Recipiente de madeira, usado para se tomar mate/chimarrão. '",
        "'Potchar'",
        "'Geralmente usa-se como sinônimo pra \"molhar\" o pão em algo, passar/mergulhar no molho do fundo do prato, ou até mesmo no café.'",
        "'Potranca'",
        "'Substantivo feminino. Ser humano do sexo feminino. Mulher gostosa. Muito gostosa. Mulher provocante, de corpo bonito.'",
        "'Pousar'",
        "'v. intr. e pron.\\nHospedar-se ou passar a noite na casa de alguém. (ex.: Chinoca, faz mais um chimarrão que o compadre vai pousar aqui hoje.'",
        "'Pra fora'",
        "'Fora = Interior. \\nEu moro pra fora, moro no interior.'",
        "'Pra tu vê'",
        "'Expressão usada para indicar a confirmação e/ou surpresa em determinada situação. \"A guria me deu um pé na bunda. Pra tu vê como são as coisas\".'",
        "'Prenda'",
        "'Menina bonita, moça, faz o par do gaúcho. Também pode significar presente, dádiva.Qualidade, dom.\\nAptidão; conhecimentos; arte; habilidade.'",
        "'Prender fogo'",
        "'Ato de incendiar alguma coisa.'",
        "'Prender o grito'",
        "'Significa falar, dizer, avisar, ou seja, soltar o grito quando se precisa de ajuda.'",
        "'Puchero'",
        "'Iguaria feita com carne (de preferência peito de boi gordo) e vários tipos de hortaliças. Tudo muito bem temperado com vários condimentos...'",
        "'Pudim de trago'",
        "'Quem bebe muito, que fica alcoolizado com frequência. '",
        "'Pular a cerca'",
        "'Trair o cônjuge, sair fora das regras conjugais, se engraçar por outra pessoa...'",
        "'Puteada'",
        "'Dar um, pito, xingar. \\nApl. O guri só parou depois de levar uma puteada.'",
        "'Putz Grila!'",
        "'Expressão usada quando algo da errado, ou expressão de espanto.'",
        "'Quadrados'",
        "'Bandeja de grande tamanho, normalmente de folha de zinco, utilizada para quarar ou clarear roupa no sol.'",
        "'Quadrilha'",
        "'Grupo ou lote de animais cavalares de pelos diferentes, que costumam andar juntos, acompanhando a égua-madrinha.'",
        "'Quarador'",
        "'Bandeja de grande dimensão, normalmente fabricada com folha de zinco, utilizada para clarear roupa ao Sol. \\n'",
        "'Quê Borracheira!'",
        "'Exclamação usada para dizer que estás de porre.. ou se usada no outro dia.. afirmando a tua ressaca.'",
        "'Que Correriu!'",
        "'Muito movimento, tumulto.'",
        "'Que ratiada!'",
        "'individuo \"ratão\" que fez alguma \"bragerada\". Ex: mas que ratiaaada!'",
        "'Quebra-costela'",
        "'Expressão comumente utilizada pelos gaúchos como sinônimo de abraço. \"Manda um quebra-costelas lá praquele xiru véio!\"'",
        "'Quebra mola'",
        "'Lombada em via pública. '",
        "'Quebreira'",
        "'Moleza, preguiça, lassidão, lombeira.'",
        "'Queimar o assado'",
        "'Atrasar - se; dormir demais. Queimei o assado hoje, cheguei meia hora atrasado!'",
        "'Queixada'",
        "'Variedade de porco do mato existente no Rio Grande do Sul. Também significa maxilar inferior.'",
        "'Quem atolou o burro que puxe a carroça'",
        "'Expressão usada quando alguém, por trapalhada sua, acaba atrapalhando os outros.'",
        "'Quengo'",
        "'Homem sabido, astuto.'",
        "'Quentucho'",
        "'Quente, para espantar o frio, aquecer, de queimar os beiços.\\n\\nTambém se usa para definir algo que seja interessante, legal, bom: Quentucho!'",
        "'Queque'",
        "'Pronuncia-se Quéque - Bolo inglês'",
        "'qüera'",
        "'Homem, gaúcho, gaudério.'",
        "'querência'",
        "'lugar ou paragem onde o animal assiste de ordinário ao pasto, ou onde foi criado. o mesmo que pago ou lugar; lugar onde alguém nasceu ou se criou. '",
        "'Querudo'",
        "'Forte, valente, respeitado, temido.'",
        "'Quibebe'",
        "'Pirão de abóbora.'",
        "'Quilina'",
        "'Os pelos compridos do cavalo, que ficam na parte superior do seu pescoço. Ex: Meu pai dizia: - segura nas quilinas para não cair...'",
        "'Quimbombô'",
        "'Quiabo.'",
        "'Quintal'",
        "'Como sinônimo de pátio, parte dos fundos do terreno da casa, ajardinado ou não, com árvores frutíferas e criação de galinhas em local urbanizado.'",
        "'Quipoqué'",
        "'Iguaria de feijão partido e cozido com diversos temperos.'",
        "'Quitute'",
        "'Comida especial, fora do trivial.'",
        "'Rabada'",
        "'A carne e o osso da parte superior do rabo da rês.'",
        "'Rabioscas'",
        "'Rabiscos, letras mal feitas.'",
        "'Raia'",
        "'Linha. Palavra proveniente do espanhol, como tantas outras faladas no Rio Grande. Ex: A \"bulita\" de gude passou da raia!'",
        "'Ralhar'",
        "'Xingar, ou como se diz lá no Brasil, \"dar sermão\". Ex.: \"Minha mãe ralhou comigo hoje porque eu chutei a bola no vidro da janela.\"'",
        "'Rancho'",
        "'Compra de itens alimentícios feita por famílias gaúchas na quantidade suficiente para cerca de 30 dias. Compra do mês.'",
        "'Ratão'",
        "'Palavra para definir alguém que pisa na bola, que faz algo de errado.'",
        "'Rateada'",
        "'Ato de vacilar, fazer algo errado, cometer um deslize. \"Bah, meu, que rateada!\"'",
        "'Realengo'",
        "'Sem dono, público.'",
        "'Rebenque'",
        "'Chicote curto, com o cabo retovado, com uma palma de couro na extremidade. Pequeno relho.'",
        "'Reboldosa'",
        "'Desordem, alvoroço, estrupício, barulho, trabalhos. O mesmo que rebordosa.'",
        "'Rebuliço'",
        "'Confusão causada devido algum desentendimento (confusão, revolta, briga)'",
        "'Recuerdo'",
        "'Lembrança, recordação.'",
        "'Récula'",
        "'Conjunto de bandidos, desordeiros.'",
        "'Rédeas'",
        "'Correia presa ao freio do animal de tiro ou de montaria, e que o cavaleiro segura nas mãos ao cavalgar; brida '",
        "'Redevu'",
        "'Briga, balbúrdia, bochincho, reunião que acaba mal. Derivado do francês Rendez-vous (reunião)'",
        "'Redomão'",
        "'Animal que foi mal domado'",
        "'Reinando'",
        "'Reinando, expressão usada quando se quer definir uma pessoa quando ela esta incomodando muito.\\n\\n\\'\\' Essa guria ta reinando hoje! \\'\\''",
        "'Relampejando'",
        "'Trovejando'",
        "'Relampiar'",
        "'Também chamado \"relampeio\". É o aparecimento de relâmpagos, que no português padrão seria \"relampejar\". Ex: Bah, mas como tá relampiando lá fora heim, prenda?'",
        "'relho'",
        "'Tipo de chicote usado pelos gaúchos para bater nos cavalos, bois e outros animais, ou até mesmo para brigar com outras pessoas. Na maioria das vezes esse instrumento é ou era usado sem violência, apenas para incentivar os animais.'",
        "'Rengo'",
        "'Aquele que está com a perna machucada.'",
        "'Rengueando'",
        "'Caminhar puxando uma perna devido a algum ferimento ou má-formação.'",
        "'Renguear'",
        "'Deixar manco; Ex. Hoje está frio de renguear cusco.'",
        "'Repontar'",
        "'Tocar o gado por diante de um lugar para outro.'",
        "'Resbalar'",
        "'Derivação de \"resvalar\" e sinônimo de \"escorregar\".\\n\\nAcredita-se que a derivação tenha acontecido devido a proximidade de nossas terras aos povos de descendência espanhola e da influência destes sobre nossa cultura.\\n\\nNa língua espanhola o som do \"b\" é frequentemente confundido com o som do \"v\", e vice versa. O comum engano linguístico foi apropriado à ponto de tornar-se uma nova palavra.'",
        "'retirar'",
        "'...'",
        "'Retoço'",
        "'Festa; bagunça; esculhambação.'",
        "'Revesgueio'",
        "'De lado, de canto de olho, de atravessado... Fulana me olhou de revesgueio no baile....Bati na bola meio de revesgueio'",
        "'Revessa'",
        "'Lugar abrigado do vento.'",
        "'Rincão'",
        "'Porção de campo naturalmente cercado de mato. Lugar muito abrigado. Trecho de campo onde há arroio. Recanto formado por acidente natural'",
        "'Riscada'",
        "'Movimento rápido a cavalo, disparada.'",
        "'Roça'",
        "'significado: campo, lavoura, plantação.\\nex: fui trabalhar na roça hoje.'",
        "'Rodela'",
        "'Mentira, patranha.'",
        "'rodido'",
        "'Medroso, incapaz, se diz de quem não consegue fazer determinada tarefa EX. Tu é um rodido mesmo, hehehe'",
        "'Rojeira'",
        "'Utensílio uasdo para guiar os bois na carreta, feita de couro cru ou de corda de linho.'",
        "'Rufião'",
        "'Cavalo inteiro destinado à reprodução. Garanhão pastor. Figuradamente, indivíduo dado a namoros, femeeiro.'",
        "'Saberete'",
        "'Sabichão.'",
        "'Sacana'",
        "'Indivíduo sem caráter. Também significa indivíduo trocista.'",
        "'Saluço'",
        "'Forma antiga e popular de soluço.'",
        "'Samoco'",
        "'Boca aberta, bocó, tapado, tonto, troxa'",
        "'Sampar'",
        "'Enfiar, fincar... Ex: \"Te sampo minha adaga\".'",
        "'Sanga'",
        "'Pequeno curso de água.'",
        "'Sangado'",
        "'Preso na sanga. Enfezado, raquítico.'",
        "'Santo do pau oco'",
        "'Quem se faz de santo(a), que tentar parecer bom, mas no fundo é um falsário. '",
        "'Saracotear'",
        "'Fazer bagunça, não parar quieto. Ex.: \"Esse guri não pára de saracotear essa noite.\"'",
        "'Sarna pra se coçar'",
        "'Situação que poder gerar confusão. \"Tu tá é procurando sarna pra se coçar\". Procurando encrenca, incomodação.'",
        "'Saudade da cadeia'",
        "'Significa que você não esta com vontade de fazer nada, ficar na moleza,comer, beber, dormir e não pagar.'",
        "'Se afeitar'",
        "'Fazer a  barba'",
        "'Se faz de salame'",
        "'O termo completo é \\'se faz de salame pra ser comido em rodelas\\'. Refere-se ao indivíduo que finge não ser com ele, ou não saber do que se trata. Sinônimos: falso, mentiroso.'",
        "'Se fazer'",
        "'[prep + v. tr.] Ato de ser omisso, tímido, insuficiente, decepcionante, dúbio, não confiável, não cumpridor, etc. Entende-se que o termo é uma redução de outras expressões como \"se fazer de leitão\", que têm o mesmo significado. (ex.: Ele já tem o dinheiro, mas está se fazendo para pagar o que me deve.)'",
        "'se foi a gata com a cinta'",
        "'não tem mais volta; não tem mais o que fazer'",
        "'Se fresqueá'",
        "'Se fazer louco, marcar passo, vacilar. '",
        "'Se pah'",
        "'Talvez, pode ser. Ex.: Se pah vamos ao shopping.'",
        "'Se puchar'",
        "'[pron. indef. + v. int] Dar o máximo de si, se empenhar. 2. Surpreender.\\n(ex.: Bah, eu tive que me puchar pra dar conta do trabalho acumulado.)'",
        "'Se puxar'",
        "'Esforçar-se; dedicar-se a algo. Me puxei para terminar a prova na hora.'",
        "'Se sumiu'",
        "'Desapareceu, foi embora'",
        "'Sefazol'",
        "'[adj.] Quem se faz [procura por: \"se fazer\"]. (ex.: Ele é um baita de um sefazol; já tem o dinheiro mas não quer pagar o que me deve.)'",
        "'Semostração'",
        "'semostração = exibição; demonstração de alguma habilidade ou de algum pertence de muita qualidade. Ex: Andava de pé sobre a sela numa semostração que todos aplaudiam.'",
        "'Senador'",
        "'Cavalo muito velho.'",
        "'Sequilho'",
        "'Rosquinha de farinha de trigo, seca, revestida de açúcar cristalizado.'",
        "'Serigaita'",
        "'Mulher muito conversadeira, rampeira, regateira, escandalosa, buliçosa. O mesmo que sirigaita.'",
        "'Serração'",
        "'Nevoeiro, normalmente pela manhã, em alguns casos se extende por horas, dependendo da humidade e da ausensia de vento .\\n\\nExemplo: A cidade amanheceu debaixo de serração'",
        "'Sesteada'",
        "'Descansar; dormir ao sol; ato de dormir a tarde.'",
        "'Sestear'",
        "'dormir depois do almoço'",
        "'Sílbido'",
        "'Assobio.'",
        "'Sinaleira'",
        "'Semáforo. Ex.: Não me passa essa SINALERA tchê, ta fechada!'",
        "'Sirigaita.'",
        "'Mulher assanhada, sem modos, oferecida...'",
        "'Soga'",
        "'Corda feita de couro, ou de fibra vegetal, ou ainda de crina de animal, utilizada para prender o cavalo à estaca ou ao pau-de-arrasto, quando é posto a pastar. Corda de couro torcido ou trançado, que liga entre si as pedras das boleadeiras.'",
        "'Solavanco'",
        "'Baque da carreta nos acidentes da estrada.'",
        "'Solear'",
        "'Tomar um sol. Quando esta muito frio em casa, por exemplo, e você vai para fora para se esquentar no sol.'",
        "'Sorro'",
        "'(do espanhol zorro)= raposa. Diz-se também da pessoa matreira, velhaca, sorrateira.'",
        "'Sumanta'",
        "'Apanhar. Tomar um pau. Surra. '",
        "'tá de arreganho'",
        "'tá de brincadeira'",
        "'Tá louco!'",
        "'Pronuncia-se “tá loco!”. \\nExpressão de espanto ou desapontamento, dependendo do contexto que está sendo empregada. Usada também para chamar atenção.\\n\"Tá loco! Que jogão de bola!\"\\n\"Taaaaá Louco! Que perda irreparável\"\\n\"Tá loco! Fulano\"\\n Expressão muito usada na região do Médio Uruguai.'",
        "'Tabacudo'",
        "'Pessoa otária, sem noção das coisas, \"boca aberta\" imbecil.\\nEi tabacudo !! cuidado pra não derrubar essa lata de tinta !!'",
        "'Tacanho'",
        "'Tosco, ignorante, panaca, de pouco conhecimento.'",
        "'Taipa'",
        "'1.Represa de leivas, nas lavouras de arroz. 2.Cerca de pedra, na região serrana. 3.Tapado, burro, ignorante.\\n\" É um taipa mesmo!\"'",
        "'TALAGAÇO'",
        "'quando um gaucho, convida o outro para tomar um gole de cachaça.\\n- dá pelo menos um \"talagaço\" ai.\\n- deixa eu dar um \"talagaço\".'",
        "'Talho'",
        "'Ferimento, corte.\\nEx: O guri levou um talho no braço.'",
        "'Taludo'",
        "'Crescido, grande, desenvolvido.'",
        "'Tambo'",
        "'Estábulo onde se ordenham as vacas para a venda de leite.'",
        "'Tamueiro'",
        "'Utensílio usado pelos carreteiros para ligar os bois à carreta. Feita de couro.'",
        "'Tança'",
        "'Aquele que cometeu uma gafe, esqueceu algo, se meteu em alguma encrenca.'",
        "'Tanso'",
        "'Distraído, tolo, trapalhão.\\nEx.: João passou em frente à prenda amada, ela lhe dirigiu um olhar interessado, mas ele não a viu. É um tanso mesmo.'",
        "'Tapado de carrapicho'",
        "'Cheio de problemas.'",
        "'Tapeio'",
        "'Tapeação, engano, embuste.'",
        "'Tapera'",
        "'Casa ou qualquer construção velha e abandonada.'",
        "'tás tolo, istepô'",
        "'Ó, lhó, lhó, rapagi, tás tolo, istepô, intiquento, miserento,digraçado!\\n'",
        "'Taura'",
        "'Diz-se do indivíduo valente, guapo, arrojado, destemido, valoroso, forte'",
        "'Tchê'",
        "'Reza a lenda que deriva do termo Tupi Guarani Chê, que significa, meu, minha, com relação de pertencimento, e é entendido como sinonimo de \"companheiro\" ou \"amigo\". É utilizado como interjeição isoladamente ou em conjunto com outras palavras.'",
        "'Tchê Loco'",
        "'1: Interjeição. chamamento utilizado para homens.\\n\\n2: Expressão para demonstrar surpresa e espanto.'",
        "'Tchó'",
        "'Igual ao Tchê, muito falado na região de Caxias do Sul.'",
        "'Tchuco'",
        "'Bêbado.'",
        "'Te arranca'",
        "'Sinônimo de mexa-se. \\nPor exemplo, te arranca daí e vem logo.\\n\\nPode ser usado para o verbo levantar, sair, etc.'",
        "'Te arremanga e vem'",
        "'Para que o indivíduo vá rápido, de qualquer jeito, a todo custo, '",
        "'Te larguei pras cobra!'",
        "'Usado quando alguém faz ou fala algo de que tu discorda. Tipo, teu amigo fica com alguém que tu considera feio, daí tu fala: Ba, te larguei pras cobra!\\nE não se pode falar pras cobras, é sem o s mesmo, para ser fiél ao modo com que a expressão sempre foi empregada =]'",
        "'Te liga, bico de luz!'",
        "'Expressão que se diz para a pessoa se orientar, se focar.'",
        "'te liga cusco'",
        "'chamar a atenção'",
        "'Te manda'",
        "'Sai daqui, vai embora.'",
        "'Tejo'",
        "'Jogo em que se atiram moedas sobre uma faca cravada no solo.'",
        "'Telefone de arreio'",
        "'Também conhecido como telefone celular.'",
        "'Tendél'",
        "'Confusão, escândalo, bagunça. Exemplo: A cumadre fez um tendél depois que o cumpadre pisou-lhe o pé.'",
        "'Tentear'",
        "'Entreter, enrolar. Exemplo: Não me tenteia morena, que tu é flor cheia de espinho...'",
        "'Terça Lidio , depois da chuva !'",
        "'Uma coisa tratada que nunca será cumprida , a pessoa trata e não cumpre'",
        "'Termo'",
        "'Térmica, recipiente para água quente'",
        "'Terreiro'",
        "'Local sem vegetação ao redor das casas de campanha.'",
        "'Teto preto'",
        "'s.m.\\n\\nAcontecimento inesperado, fora do padrão.\\n\\n'",
        "'Teu'",
        "'É uma expressão para se referir à alguém. Em Porto Alegrte falam \"véio\", em São Paulo \"meu\" e em Tapejara \"teu\". Exemplo: E daí teu, beleza? \\n\\nTambém pode ser usada para repreender alguém  que falou alguma bobagem. Exemplo: \"Ó o teu\" ou \"mas é um teu mesmo.\" A fina flor da grossura.'",
        "'Tiorga'",
        "'Embriaguez, borracheira, bebedeira, carraspana.'",
        "'Tirada'",
        "'Gauchada, agachada, compadrada.'",
        "'Tiritando de frio'",
        "'Quando a pessoa está com muito frio. '",
        "'Tô de balde'",
        "'Estar sem fazer nada. Variação: tô de valde. \\nEx: Tchê, to de balde, vamos fazer alguma coisa?'",
        "'Tô verde'",
        "'Quando ja está com a barriga cheia de tanto tomar chimarrão, não aguenta mais chimarrão.'",
        "'Tocaia'",
        "'Espera, emboscada, espreita ao inimigo ou à caça.'",
        "'Tomar um pileque'",
        "'O mesmo que tomar um porre, embebedar-se...'",
        "'Tombo'",
        "'Prejuízo. “Dar o tombo em alguém” significa causar prejuízo a alguém.'",
        "'Topeira'",
        "'Pessoa mal vista, que não faz as coisas certas, ou cabeça dura'",
        "'Tormenta'",
        "'Temporal. Outra palavra proveniente do espanhol, muito usada pelos mais velhos.'",
        "'Toró'",
        "'Uma chuva extremamente forte. Ex.: Vai cair um baita toró hoje!'",
        "'torrão'",
        "'Determinada porção de terra, de acordo com o complemento do termo. Ex.: Torrão Gaúcho = Estado do Rio Grande do Sul ou ainda toda região dos povos gauchos (Rio Grande do Sul, Uruguay, partes da Argentina e Paraguay).'",
        "'Torta de gostosa'",
        "'Uma mulher excepcionalmente curvilínea e atraente.'",
        "'Trampo'",
        "'Trabalho, emprego.'",
        "'Tramposo'",
        "'Intrometido, trapaceiro, velhaco.'",
        "'Tranco'",
        "'Passo largo, firme e seguro, do cavalo ou do homem. Empurrão. Rapidamente, bruscamente.\\n\" Fiz o carro pegar no tranco.\"'",
        "'Tranqueira'",
        "'Muito carro na estrada. Lentidão no trânsito.'",
        "'Traste'",
        "'Diz-se da pessoa que incomoda, não serve quando precisamos, de animal, ou de algo em serventia. '",
        "'treco'",
        "'Treco é simplesmente um objeto. Treco pode ser também expressão para mal súbito.'",
        "'Tremedeira'",
        "'Tremura, tremor, estertores de moribundo.'",
        "'Tremer'",
        "'1. Tirar sarro, sacanear. (ex.: Eu cai do cavalo e ficaram me tremendo.)'",
        "'Tri'",
        "'Muito'",
        "'Tri legal'",
        "'1.Gíria utilizada para definir algo que é muito mais do que legal.'",
        "'Trigo limpo'",
        "'Quando se quer dizer que uma pessoa não tem boa índole;\\n\"Ele não é trigo limpo\"'",
        "'Trocentos'",
        "'Usada pra representar uma quantidade muito grande de alguma coisa, sem especificar. Ex.: \"Não te vejo há trocentos anos.\"'",
        "'Troço'",
        "'Alguma coisa, algo, um negócio. Usado quando a pessoa quer apontar algo mas não sabe oque é. Coisa indefinida.'",
        "'Tromba d\\'água'",
        "'Temporal, chuva forte. Ex. Hoje vai cair uma tromba d\\'água.\\n'",
        "'Tronqueira'",
        "'Tronco grosso de árvore ex; mais atirado que pica-pau em tronqueira'",
        "'Troteando'",
        "'1.Sinônimo de andar rápido, andar apressado.\\nEx: Perdi o canto e tive que ir troteando para trampo.'",
        "'trova'",
        "'Ato de falar e tentar convencer a outra pessoa da sua idéia.\\n\\nFalar abobrinhas e fazer com que a pessoa acredite.\\n\\nPode-se também dizer que seria como um xaveco.\\nTambém e um tipo de musica monostrófico tradicional do rio grande do sul'",
        "'Trovar'",
        "'Semelhante a flertar, conquistar. \\n\\nA pessoa que \"trova\" é chamada de \"trovador\"'",
        "'truco'",
        "'Jogo de baralho'",
        "'Trupicar'",
        "'V. Tropeçar em algo. Desequilibrar-se. Perder o rumo. Aplicação: \"Bah, loco! Dei uma trupicada afú naquela pedra...\"'",
        "'Tubuna'",
        "'Imbecil, tabacudo... Também é uma variedade de abelhas silvestre que produz mel de má qualidade.'",
        "'Tuna'",
        "'cactos, típicos da fronteira oeste, aplica-se numa frase do tipo \"vá se coçar numa tuna\", isto é \"vá embora\" \\n'",
        "'Tunda'",
        "'Bater, surra.\\nEx: Se tu continuares a me incomodar te darei uma tunda!'",
        "'Tunda de laço'",
        "'Camaçada de pau, sumanta de relho, apanhar.'",
        "'Tungar'",
        "'Molhar (submergir) alguma coisa em algo líquido. \"Tungar o pão no café\", por exemplo.'",
        "'Tupetudo'",
        "'Chimarrão'",
        "'Ué'",
        "'Interjeição que exprime admiração, espanto.'",
        "'Uia!'",
        "'Interjeição que expressa espanto, surpresa'",
        "'Um pé lá e outro cá'",
        "'Advertência, geralmente usada pelas mães, para avisar a criatura para não se demorar, porque senão vai ter.'",
        "'Unhar'",
        "'Roubar, furtar, surrupiar, levar o que não lhe pertence. Também significa correr, fugir à disparada, azular.'",
        "'Untura'",
        "'Remédio feito com sebo, carvão moído e outros ingredientes, usado para curar as matas dos animais de montaria ou de carga.'",
        "'Urco'",
        "'Diz-se do cavalo grande e belo.'",
        "'Urucungo'",
        "'Cavalo ruim, imprestável.'",
        "'Urumbeba'",
        "'Espécie de tuna, do gênero Cactus.'",
        "'Usted'",
        "'Você. Usado somente na fronteira.'",
        "'Vá lamber sabão'",
        "'Diz-se para uma pessoa que está falando bobagens, incomodando...'",
        "'Vá te afumentar'",
        "'Quando uma pessoa está te enchendo a paciência; o mesmo que \"Vai te catar!\".'",
        "'Vá tomar onde as galinhas tomam'",
        "'Xingamento, desprezo '",
        "'Vai à fava'",
        "'Sai daqui, não enche a paciência, pára com isso...'",
        "'Vai ao gaio (vai ao galho)'",
        "'Se dar mal ao fazer alguma coisa. Correr risco de perder algo importante (a vida) por causa de ações intencionais que geram risco.\\nA expressão foi originada pelos suicídios por enforcamento na região. (\"Fulano foi ao gaio\" = morreu).'",
        "'Vai catá coquinho!'",
        "'Se diz á pessoa que esta molestando ou insistindo em uma coisa que nao tem fundamento.'",
        "'Vanera'",
        "'[s. f.] Sinônimo de vanerão enquanto dança. 2. [s. f.] Sinônimo de vanerão enquanto estilo musical. [procura por \"vanerão\"]'",
        "'Vanerão'",
        "'[s. m.] Dança de origem alemã desenvolvida no Rio Grande do Sul, onde se tornou uma das danças mais populares do estado. Também pode ser utilizada como sinônimo de vanera. (ex.: Vamos dançar um vanerão?) 2. [s. m.] Estilo musical que acompanha a dança. (ex.: Abre a gaita e toca um vanerão, gaitero bueno.)'",
        "'Vão cordiando, indiada'",
        "'Sirvam-se, vão repondo o prato com mais comida, vão cortando mais churrasco...'",
        "'Vaquilhona'",
        "'Vaca nova que ainda não pariu. Novilha.'",
        "'Varado'",
        "'Definição: com muita, louco, desesperado.\\nEx: o fulano esta \"varado\" de fome.\\n\\nLocalidade: Porto Alegre/RS\\nAutor: Fabio de Deus'",
        "'Vareio'",
        "'Susto, sova, surra, repreensão.\\n\\nDiz-se também da derrota vexatória de um time. \"tomou um vareio\" ou uma saraivada. Uma variação possível é \"varei\": que varei tu tomou hoje, hein?'",
        "'Varejeira'",
        "'Mosca que deposita seus ovos nas feridas dos animais, produzindo bicheiras.'",
        "'Vareta'",
        "'Desapontamento, atrapalhação, perturbação, encalistração, encabulação.'",
        "'Vazio'",
        "'O vazio, conhecido fora do Rio Grande do Sul como fraldinha, é um tipo de corte de carne bovina, localizada entre a parte traseira e a costela do animal.'",
        "'Velhaco'",
        "'Diz-se do animal que perde o costume de velhaquear, dar pinotes, corcovear.'",
        "'Vergamota'",
        "'Bergamota.'",
        "'Vermelhão'",
        "'Nome dado ao condimento \\'colorau\\'. Pigmento que se adiciona a comida para dar cor.'",
        "'Vespra'",
        "'Véspera.'",
        "'viajou'",
        "'enluqueceu, pirou'",
        "'Vianda'",
        "'Refeição fornecida a domicílio em marmitas. Marmita.'",
        "'Vina'",
        "'Vina, o mesmo que salsicha! Exemplo: Quero um cachorro quente com duas \"vinas\"!'",
        "'Viso'",
        "'Saia de baixo.'",
        "'Viva o luxo e encolha o bucho'",
        "'Mesmo que não tenha o que comer, mostre seu perfil em grande estilo, nunca perca a pose...'",
        "'Vivente'",
        "'Aplic. Saudação.Termo comumente usado para se dirigir a uma pessoa que está na roda ou se aproxima da mesma. Ex : Te aprochega vivente!! '",
        "'Voar as tranças'",
        "'Sair correndo, andar rápido, com pressa!!  Exemplo:(a) Voei as trança atrás de um laço novo!  (b) A menina voou as trança pra pegar o brinquedo novo!'",
        "'Vortiada'",
        "'Passeio'",
        "'Vozerio'",
        "'Vozeria, vozearia, vozeada, clamor de muitas vozes juntas.'",
        "'xamixunga'",
        "'Pessoa pegajosa, que não desgruda.'",
        "'Xepa'",
        "'Comida.'",
        "'Xerenga'",
        "'Faca velha, ordinária, ruim.'",
        "'Xereta'",
        "'Conversador, intrometido, bisbilhoteiro, importuno, novidadeiro, leva-e-traz, bajulador, engrossador.'",
        "'Xi!'",
        "'Interjeição que expressa surpresa, pasmo, horror.'",
        "'Ximbo'",
        "'Cavalo cujo dono não se conhece.'",
        "'Xingar'",
        "'Descompor, injuriar, dizer desaforo.'",
        "'xirú'",
        "'Expressão usada para se referir a algum indivíduo.\\n\\n\"Xiru\" é uma palavra de origem indígena (Guarani) e que significa amigo, podendo também ser sinônimo de forte e corajoso.'",
        "'Xis'",
        "'Tradicional lanche vendido no RS, normalmente composto de algum tipo de carne, tomate, alface, queijo, milho e ervilha. Aceita variações.'",
        "'Xisme'",
        "'Confusão., ajuntamento , reunião de pessoas palavra tipica da Fronteira Oeste'",
        "'Xispar'",
        "'Sair rapidamente. Ex.: \"Xispa daqui, índio véio, senão vai fechar a peleia.\"'",
        "'Xixo'",
        "'Churrasquinho picado de palito, ou espeto com diferentes tipos de carne, cebola e tomate assados. '",
        "'Xubrega'",
        "'Diz-se do indivíduo insignificante, de animal ordinário, de coisa sem valor.'",
        "'Xucrice'",
        "'Qualidade de animal ou de indivíduo xucro. Grosseria. Falta de educação.'",
        "'Xucrismo'",
        "'O mesmo que xucrice.'",
        "'XUCRO'",
        "'(adjetivo) Animal bravo e indomado; pessoa tosca, rude, sem modos. \"Te afasta que o bagual é XUCRO\"'",
        "'Zambo'",
        "'Desnorteado, tonto, aparvalhado, atoleimado.'",
        "'Zarro'",
        "'Incômodo, maçante, difícil de fazer, chato.'",
        "'Zorro'",
        "'O mesmo que sorro ou guaraxaim. Figuradamente, a pessoa manhosa, atilada, disfarçada, velhaca.'",
        "'Zunir'",
        "'Ir-se apressadamente.'",
        "'Zura'",
        "'Diz-se da pessoa sovina.'",
        "'Zurra'",
        "'Trabalhar intensamente com muito afinco. O mesmo que dizer asneiras, tolices.'",
        "'Zurrapa'",
        "'Ruim, ordinário, de má qualidade.'",
        "'key'"
    ],
    "variables": [],
    "comments": [],
    "docstrings": [],
    "functions": [
        "fetch",
        "find"
    ],
    "classes": [
        "ArtigosService"
    ]
}