{
    "identifiers": [
        "org",
        "bayofmany",
        "peapod",
        "orientdb",
        "java",
        "io",
        "org",
        "apache",
        "tinkerpop",
        "gremlin",
        "orientdb",
        "OrientGraphFactory",
        "org",
        "apache",
        "tinkerpop",
        "gremlin",
        "structure",
        "Graph",
        "org",
        "junit",
        "BeforeClass",
        "org",
        "junit",
        "ClassRule",
        "org",
        "junit",
        "rules",
        "TemporaryFolder",
        "peapod",
        "GraphProvider",
        "peapod",
        "GraphTest",
        "peapod",
        "GraphTestSuite",
        "URL",
        "getSimpleName",
        "ClassRule",
        "folder",
        "BeforeClass",
        "GraphTest",
        "graphProvider",
        "URL",
        "folder",
        "newFolder",
        "getAbsolutePath",
        "getNoTx"
    ],
    "literals": [
        "\"memory:\"",
        "\"root\"",
        "\"root\""
    ],
    "variables": [],
    "comments": [],
    "docstrings": [
        "* Copyright 2015-Bay of Many\n *\n *    Licensed under the Apache License, Version 2.0 (the \"License\");\n *    you may not use this file except in compliance with the License.\n *    You may obtain a copy of the License at\n *\n *        http://www.apache.org/licenses/LICENSE-2.0\n *\n *    Unless required by applicable law or agreed to in writing, software\n *    distributed under the License is distributed on an \"AS IS\" BASIS,\n *    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n *    See the License for the specific language governing permissions and\n *    limitations under the License.\n *\n * This project is derived from code in the TinkerPop project under the following licenses:\n *\n * TinkerPop3\n * http://www.apache.org/licenses/LICENSE-2.0\n *\n * Redistribution and use in source and binary forms, with or without\n * modification, are permitted provided that the following conditions are met:\n *     * Redistributions of source code must retain the above copyright\n *       notice, this list of conditions and the following disclaimer.\n *     * Redistributions in binary form must reproduce the above copyright\n *       notice, this list of conditions and the following disclaimer in the\n *       documentation and/or other materials provided with the distribution.\n *     * Neither the name of the TinkerPop nor the\n *       names of its contributors may be used to endorse or promote products\n *       derived from this software without specific prior written permission.\n *\n * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\n * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\n * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n * DISCLAIMED. IN NO EVENT SHALL TINKERPOP BE LIABLE FOR ANY\n * DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\n * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND\n * ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\n * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE."
    ],
    "functions": [
        "setGraphProvider",
        "Graph",
        "getGraph"
    ],
    "classes": [
        "OrientDBSuite"
    ]
}