export const leadSectionMockData = {
  info: 'Текст о компетенции, можно тот же, что и на главной странице раскрывается, 100-150 знаков, что‑то типа подзаголовка',
  description: [
    'Уже нормальный текст, объясняющий, что это за зверь такой и с чем его едят. Если его, конечно, можно сформулировать и написать так, чтобы было понятно.',
    '2–3, может быть 4 абзаца по 150-200 знаков, чтобы это можно было легко и быстро воспринять и понять, о чем речь. Пытаться казаться более знающими, чем есть на самом деле, за счёт использования умных слов точно не стоит.',
    'Можно добавить ещё блоки-пунктики с какими‑нибудь цифрами «улучшатели показателей» и вот это вот всё, как на главной странице на экране мастерской.',
  ],
  cardsData: [
    {
      titleBig: '78',
      title: '%',
      text: 'Рост чего‑нибудь при&nbsp;использовании этой штуки',
    },
    {
      titleBig: '7',
      title: 'месяцев',
      text: 'Требуется для полноценного внедрения бла-бла-бла',
    },
    {
      titleBig: '5',
      title: 'лет',
      text: 'Пунктов может быть и больше, если текста много',
    },
    {
      titleBig: '15',
      title: 'специалистов',
      text: 'Участвовали в разработке и тестировании',
    },
    {
      titleBig: 'Сайт',
      title: '',
      text: 'Запущен и его можно посмотреть по ссылке',
    },
  ],
};