export const cards = [
  {
    title: 'Gamedev',
    info: 'Ваша игра будет разработана профессионально, с учетом потребностей вашей аудитории. Ваша игра будет разработана профессионально, с учетом потребностей вашей аудитории.',
    description:
      'Разрабатываем 2D и 3D игры любых жанров, стремимся обеспечить увлекательный игровой процесс, создавая интересных персонажей, уникальные игровые механики и липкость игры.',
    url: '/',
  },
  {
    title: 'Web-разработка',
    info: 'Создание высококачественных и инновационных веб-приложений и сайтов.',
    description:
      'Создаем интерактивные пользовательские интерфейсы (UI) с использованием HTML, CSS и JavaScript, строим мощные и масштабируемые серверные приложения и API с пост-релизной поддержкой.',
    url: '/',
  },
  {
    title: 'Мобильные приложения',
    info: 'Ваше приложение под iOS, Android  будет создано профессионально по современным стандартам.',
    description:
      'Разрабатываем на Swift и Objective-C для iOS до Kotlin и Java для Android, используем фреймворки, такие как React Native и Flutter, для кросс-платформенной разработки.',
    url: '/',
  },
  {
    title: 'Machine Learning / AI',
    info: 'Создаем интеллектуальные системы, оптимизируем процессы и повышаем эффективность бизнес-операций.',
    description:
      'Создаем и настраиваем различные модели машинного обучения, алгоритмы классификации, регрессии, кластеризации и нейронные сети в анализе данных, прогнозировании, распознавании образов и др.',
    url: '/',
  },
  {
    title: 'КХД / Data Warehouse',
    info: 'Уверенно управляйте и анализируйте данные для бизнес-решений и повышения эффективности.',
    description:
      'Специализируемся на интеграции данных из разных источников-базы данных, приложения и внешних источников. Это позволяет создать единое и надежное хранилище данных.',
    url: '/',
  },
  {
    title: 'Системы автоматизации',
    info: 'Оптимизируем бизнес-процессы для увеличения эффективности и снижения затрат.',
    description:
      'Интегрируем подходящие системы автоматизации, такие как ERP (Enterprise Resource Planning), CRM (Customer Relationship Management), BPM (Business Process Management) и другие.',
    url: '/',
  },
  {
    title: 'Управление данными',
    info: 'Программные решения и системы по эффективному управлению данными.',
    description:
      'Создаем системы сбора данных, интегрируем их с разными источниками информации, а затем обеспечиваем их безопасное хранение и обработку, анализ и визуализацию.',
    url: '/',
  },
];