export const products = [
  {
    title: 'Docshablon',
    info: 'Разработка сервиса c необходимыми формами и шаблонами документов',
    labels: 'Документооборот Документооборот Документооборот',
    url: '/',
  },
  {
    title: 'DocshablonDocs',
    info: 'Разработка сервиса c необходимыми формами и шаблонами документов',
    labels: 'Документооборот Документооборот Документооборот',
    url: '/',
  },
  {
    title: '11111111111111',
    info: 'Разработка сервиса c необходимыми формами и шаблонами документов',
    labels: 'Документооборот Документооборот Документооборот',
    url: '/',
  },
  {
    title: 'WWWWWWWWW',
    info: 'Разработка сервиса c необходимыми формами и шаблонами документов',
    labels: 'Документооборот Документооборот Документооборот',
    url: '/',
  },
];