{
    "identifiers": [
        "ReactiveVar",
        "ReactiveVar",
        "ReactiveVar",
        "ReactiveVar",
        "ReactiveVar",
        "ReactiveVar",
        "ReactiveVar",
        "ReactiveVar",
        "ReactiveVar",
        "numCheck",
        "check",
        "a1",
        "a2",
        "a3",
        "a1",
        "a2",
        "Template",
        "check",
        "correct",
        "a1",
        "a2",
        "a3",
        "counter",
        "corCounter",
        "counter",
        "numCheck",
        "Template",
        "input",
        "isNaN",
        "input",
        "input",
        "numCheck",
        "numCheck",
        "isNaN",
        "input",
        "numCheck",
        "check",
        "counter",
        "counter",
        "input",
        "a3",
        "corCounter",
        "corCounter",
        "correct",
        "correct",
        "a3",
        "picker",
        "Template",
        "picker",
        "counter",
        "corCounter"
    ],
    "literals": [
        "\"yes\"",
        "\"/\"",
        "\"\"",
        "\"no\"",
        "\"Please enter a number.\"",
        "\"\"",
        "'submit #answer'",
        "\"ans\"",
        "\"\"",
        "\"no\"",
        "\"yes\"",
        "\"Correct!\"",
        "\"Incorrect! The answer is \"",
        "\".\"",
        "'click #next'",
        "\"ans\""
    ],
    "variables": [
        "a1",
        "a2",
        "a3",
        "check",
        "correct",
        "counter",
        "corCounter",
        "numCheck",
        "input"
    ],
    "comments": [
        "function to generate a new numbers for a question.  Also resets the status of numCheck so the user isn't asked to enter a number, and resets check to false so the correct buttons are shown.",
        "If the total number of questions answered is greater than 0, then return the number of correctly answered questions followed by a slash and the total number of questions asked",
        "If the user enters something that is not a number, or the entry is blank, return Please enter..... otherwise displays nothing.",
        "When clicking element with id Submit (i.e. the button Check!)",
        "Prevents the form refreshing the page when submitted",
        "grabs the value of the text box)",
        "If the answer is not a number or if the text box is empty",
        "sets numCheck to no, prompting the Please enter a number message",
        "if the entry is a number, then sets numCheck to yes, so that it returns nothing, adds 1 to the total counter, and sets check to true so that the template shows correct/incorrect and the correct buttons",
        "If the input is equal to the answer i.e. they've answered correctly, add one to the correct counter, and set correct to display \"Correct!\"",
        "Otherwise, set correct to display incorrect and the correct answer",
        "'click #roll':function()\n\t{\n\t\tpicker();\n\t\tconsole.log(\"HI\");\n\t},",
        "On clicking the next question button, call function picker",
        "When the template is rendered, reset both the Counter and Correct Counters to zero, and call picker"
    ],
    "docstrings": [],
    "functions": [
        "picker"
    ],
    "classes": []
}