package task_9.parking;

/**
 * Реализовать эмулятор стоянки самолётов-стэк.
 * 1) Создайте класс Plane с полями класса – название самолета и номер самолета.
 * 2) В отдельном классе создайте стоянку для самолетов (коллекция). Размер стоянки 5 мест.
 * Работать должно следующим образом
 * - Вводим в консоль бортовые номера самолётов, и программа их запоминает (“ставит” их на стоянку).
 * - Если команду ADD введем, то предлагают ввести название и номер самолета.
 * . Эти данные записываем в объект и объект добавляем в коллекцию объектов.
 * - При вводе команды “exitAll” программа должна распечатать номера самолётов в порядке покидания стоянки
 * . (и удалить их все из памяти).
 * - При вводе “exitLast” должна распечатать и удалить из памяти только тот самолёт, который сейчас выезжает.
 * - Если стоянка заполнена полностью, следующему самолёту должно быть отказано во въезде.
 */

public class Main {
    public static void main(String[] args) {
        ParkingAircraft parkingAircraft = new ParkingAircraft();
        parkingAircraft.planeInParking();
    }
}