export const questions = [
  "오늘 하루는 어떻게 보내셨나요? 오늘 특별하거나 재미있는 일이 있으셨나요?",
  "오늘 약은 일정대로 잘 챙겨 드셨는지요?",
  "오늘 방문하신 분들이나 전화 오신 분들이 계셨나요? 그분들과의 대화는 어땠나요?",
  "오늘 식사는 무엇을 드셨나요? 맛있게 드셨는지요?",
  "오늘 특별히 즐기셨던 일, 예를 들어 책을 읽으셨다거나, TV를 보셨다거나, 산책을 하셨다거나 하는 일이 있으셨나요? 있으셨다면 어떤 게 가장 기억에 남으셨나요?",
  "오늘 신체적으로나 감정적으로 어떻게 느끼셨는지요? 혹시 마음에 걸리는 일이 있으신가요?",
  "가족분이나 돌봄 제공자와 이야기를 나누고 싶은 것이 있으신지요?",
  "오늘 기분이 좋아지거나 성취감을 느끼신 활동이나 취미가 있으셨나요?",
  "앞으로 있을 약속이나 계획에 대해 생각하시거나 준비하고 계신 것이 있으신가요?",
  "오늘 하루 중 미소 짓게 하거나 긍정적인 기분이 들게 한 일이 있으셨다면 어떤 것이었는지요?",
];