{
    "identifiers": [
        "angular",
        "angular",
        "name",
        "config",
        "config",
        "name",
        "decorator",
        "state",
        "parent",
        "pattern",
        "path",
        "searchParams",
        "values",
        "pattern",
        "o",
        "name",
        "definition",
        "definitionFn",
        "value",
        "value",
        "value",
        "angular",
        "whenPath",
        "handler",
        "whenPath",
        "handler",
        "whenPath",
        "toPath",
        "whenPath",
        "hanlder",
        "whenPath",
        "handler",
        "whenPath",
        "toPath",
        "whenPath",
        "handler",
        "whenPath",
        "handler",
        "whenPath",
        "toPath",
        "handler",
        "handler",
        "path",
        "handler",
        "handler",
        "to",
        "options",
        "angular",
        "state",
        "updateLocation",
        "state",
        "options",
        "state",
        "state",
        "state",
        "state",
        "options",
        "state",
        "options",
        "state",
        "key"
    ],
    "literals": [
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string",
        "string"
    ],
    "variables": [],
    "comments": [
        "Type definitions for Angular JS 1.1.5+ (ui.router module)",
        "Project: https://github.com/angular-ui/ui-router",
        "Definitions by: Michel Salib <https://github.com/michelsalib>",
        "Definitions: https://github.com/borisyankov/DefinitelyTyped",
        "<reference path=\"../angularjs/angular.d.ts\" />"
    ],
    "docstrings": [
        "* String HTML content, or function that returns an HTML string",
        "* String URL path to template file OR Function, returns URL path string",
        "* Function, returns HTML content string",
        "* A controller paired to the state. Function OR name as String",
        "* Function (injectable), returns the actual controller function or string.",
        "* Specifies the parent state of this state",
        "* A url with optional parameters. When a state is navigated or transitioned to, the $stateParams service will be populated with any parameters that were passed.",
        "* A map which optionally configures parameters declared in the url, or defines additional non-url parameters. Only use this within a state if you are not using url. Otherwise you can specify your parameters within the url. When a state is navigated or transitioned to, the $stateParams service will be populated with any parameters that were passed.",
        "* Use the views property to set up multiple views. If you don't need multiple views within a single state this property is not needed. Tip: remember that often nested views are more useful and powerful than multiple sibling views.",
        "* Callback function for when a state is entered. Good way to trigger an action or dispatch an event, such as opening a dialog.\n         * If minifying your scripts, make sure to explictly annotate this function, because it won't be automatically annotated by your build tools.",
        "* Callback functions for when a state is entered and exited. Good way to trigger an action or dispatch an event, such as opening a dialog.\n         * If minifying your scripts, make sure to explictly annotate this function, because it won't be automatically annotated by your build tools.",
        "* Arbitrary data object, useful for custom configuration.",
        "* Boolean (default true). If false will not retrigger the same state just because a search/query parameter has changed. Useful for when you'd like to modify $location.search() without triggering a reload.",
        "* {boolean=true|string=} - If true will update the url in the location bar, if false will not. If string, must be \"replace\", which will update url and also replace last history record.",
        "*  {boolean=true}, If true will inherit url parameters from current url.",
        "* {object=$state.$current}, When transitioning with relative path (e.g '^'), defines which state to be relative from.",
        "* {boolean=true}, If true will broadcast $stateChangeStart and $stateChangeSuccess events.",
        "* {boolean=false}, If true will force transition even if the state or params have not changed, aka a reload of the same state. It differs from reloadOnSearch because you'd use this when you want to force a reload when everything is the same, including search params.",
        "* Convenience method for transitioning to a new state. $state.go calls $state.transitionTo internally but automatically sets options to { location: true, inherit: true, relative: $state.$current, notify: true }. This allows you to easily use an absolute or relative to path and specify only the parameters you'd like to update (while letting unspecified parameters inherit from the currently active ancestor states).\n         *\n         * @param to Absolute state name or relative state path. Some examples:\n         *\n         * $state.go('contact.detail') - will go to the contact.detail state\n         * $state.go('^') - will go to a parent state\n         * $state.go('^.sibling') - will go to a sibling state\n         * $state.go('.child.grandchild') - will go to grandchild state\n         *\n         * @param params A map of the parameters that will be sent to the state, will populate $stateParams. Any parameters that are not specified will be inherited from currently defined parameters. This allows, for example, going to a sibling state that shares parameters specified in a parent state. Parameter inheritance only works between common ancestor states, I.e. transitioning to a sibling will get you the parameters for all parents, transitioning to a child will get you all current parameters, etc.\n         *\n         * @param options Options object.",
        "* Triggers an update; the same update that happens when the address bar\n    \t * url changes, aka $locationChangeSuccess.\n    \t *\n    \t * This method is useful when you need to use preventDefault() on the\n    \t * $locationChangeSuccess event, perform some custom logic (route protection,\n    \t * auth, config, redirection, etc) and then finally proceed with the transition\n    \t * by calling $urlRouter.sync().\n    \t *",
        "* Reverts back to using the core $anchorScroll service for scrolling\n         * based on the url anchor."
    ],
    "functions": [],
    "classes": []
}