{
    "identifiers": [
        "frc",
        "robot",
        "DRIVETRAIN_TRACKWIDTH_METERS",
        "DRIVETRAIN_WHEELBASE_METERS",
        "DRIVETRAIN_PIGEON_ID",
        "FRONT_LEFT_MODULE_DRIVE_MOTOR",
        "FRONT_LEFT_MODULE_STEER_MOTOR",
        "FRONT_LEFT_MODULE_STEER_ENCODER",
        "FRONT_LEFT_MODULE_STEER_OFFSET",
        "toRadians",
        "FRONT_RIGHT_MODULE_DRIVE_MOTOR",
        "FRONT_RIGHT_MODULE_STEER_MOTOR",
        "FRONT_RIGHT_MODULE_STEER_ENCODER",
        "FRONT_RIGHT_MODULE_STEER_OFFSET",
        "toRadians",
        "BACK_LEFT_MODULE_DRIVE_MOTOR",
        "BACK_LEFT_MODULE_STEER_MOTOR",
        "BACK_LEFT_MODULE_STEER_ENCODER",
        "BACK_LEFT_MODULE_STEER_OFFSET",
        "toRadians",
        "BACK_RIGHT_MODULE_DRIVE_MOTOR",
        "BACK_RIGHT_MODULE_STEER_MOTOR",
        "BACK_RIGHT_MODULE_STEER_ENCODER",
        "BACK_RIGHT_MODULE_STEER_OFFSET",
        "toRadians"
    ],
    "literals": [],
    "variables": [],
    "comments": [
        "Copyright (c) FIRST and other WPILib contributors.",
        "Open Source Software; you can modify and/or share it under the terms of",
        "the WPILib BSD license file in the root directory of this project.",
        "FIXED Set Pigeon ID",
        "FIXED Set front left module drive motor ID",
        "FIXED Set front left module steer motor ID",
        "FIXED Set front left steer encoder ID",
        "FIXED Measure and set front left steer offset",
        "FIXED Set front right drive motor ID",
        "FIXED Set front right steer motor ID",
        "FIXED Set front right steer encoder ID",
        "FIXED Measure and set front right steer offset",
        "FIXED Set back left drive motor ID",
        "FIXED Set back left steer motor ID",
        "FIXED Set back left steer encoder ID",
        "FIXED Measure and set back left steer offset",
        "FIXED Set back right drive motor ID",
        "FIXED Set back right steer motor ID",
        "FIXED Set back right steer encoder ID",
        "FIXED Measure and set back right steer offset"
    ],
    "docstrings": [
        "* The Constants class provides a convenient place for teams to hold robot-wide numerical or boolean\n * constants. This class should not be used for any other purpose. All constants should be declared\n * globally (i.e. public static). Do not put anything functional in this class.\n *\n * <p>It is advised to statically import this class (or one of its inner classes) wherever the\n * constants are needed, to reduce verbosity.",
        "* The left-to-right distance between the drivetrain wheels\n     *\n     * Should be measured from center to center.",
        "* The front-to-back distance between the drivetrain wheels.\n     *\n     * Should be measured from center to center."
    ],
    "functions": [],
    "classes": [
        "Constants"
    ]
}