{
    "identifiers": [
        "argparse",
        "argparse",
        "ArgumentParser",
        "parser",
        "add_argument",
        "help",
        "parser",
        "add_argument",
        "help",
        "action",
        "parser",
        "add_argument",
        "help",
        "parser",
        "add_argument",
        "help",
        "parser",
        "add_argument",
        "help",
        "action",
        "parser",
        "add_argument",
        "help",
        "parser",
        "add_argument",
        "help",
        "parser",
        "parse_args",
        "args",
        "debug",
        "args",
        "no_pull",
        "args",
        "targets",
        "args",
        "targets",
        "main"
    ],
    "literals": [
        "\"-b\"",
        "\"--branch\"",
        "\"-d\"",
        "\"--debug\"",
        "\"store_true\"",
        "\"-i\"",
        "\"--incremental\"",
        "\"-I\"",
        "\"--install-folder\"",
        "\"-n\"",
        "\"--no-pull\"",
        "\"store_true\"",
        "\"-p\"",
        "\"--projects\"",
        "\"-t\"",
        "\"--targets\"",
        "\"Debug enabled\"",
        "\"Not pulling\"",
        "f\"Targets: {args.targets}\"",
        "'__main__'"
    ],
    "variables": [
        "parser",
        "args"
    ],
    "comments": [
        "!/usr/bin/env python3.7",
        "FIXME: Formatting for help could use some work"
    ],
    "docstrings": [
        "\"\"\"\n                        By default, the script builds the master branch (tip of tree) of LLVM. If you would\n                        like to build an older branch, use this parameter. This may be helpful in tracking\n                        down an older bug to properly bisect. This value is just passed along to 'git checkout'\n                        so it can be a branch name, tag name, or hash.\n                        \"\"\"",
        "\"\"\"\n                        By default, the script builds LLVM in the release configuration with all of\n                        the tests turned off and optimization at O2. This disables that optimization,\n                        builds the tests, and changes the configuration to debug. This can help with\n                        reporting problems to LLVM developers but will make compilation of both LLVM\n                        and the kernel go slower.\n                        \"\"\"",
        "\"\"\"\n                        By default, the script removes all build artifacts from previous compiles. This\n                        prevents that, allowing for dirty builds and faster compiles.\n                        \"\"\"",
        "\"\"\"\n                        By default, the script will create a \"usr\" folder in the same folder as this script\n                        and install the LLVM toolchain there. If you'd like to have it installed somewhere\n                        else, pass it to this parameter. This can either be an absolute or relative path.\n\n                        Example: ~/llvm\n                        \"\"\"",
        "\"\"\"\n                        By default, the script always updates the LLVM repo before building. This prevents\n                        that, which can be helpful during something like bisecting.\n                        \"\"\"",
        "\"\"\"\n                        Currently, the script only enables the clang, compiler-rt, and lld folders in LLVM. If\n                        you would like to override this, you can use this parameter and supply a list that is\n                        supported by LLVM_ENABLE_PROJECTS.\n\n                        See step #5 here: https://llvm.org/docs/GettingStarted.html#getting-started-quickly-a-summary\n\n                        Example: -p \\\"clang;lld;libcxx\\\"\n                        \"\"\"",
        "\"\"\"\n                        LLVM is multitargeted by default. Currently, this script only enables the arm32, aarch64,\n                        powerpc, and x86 backends because that's what the Linux kernel is currently concerned with.\n                        If you would like to override this, you can use this parameter and supply a list that is\n                        supported by LLVM_TARGETS_TO_BUILD: https://llvm.org/docs/CMake.html#llvm-specific-variables\n\n                        Example: -t \"AArch64;X86\"\n                        \"\"\""
    ],
    "functions": [
        "main"
    ],
    "classes": []
}