{
    "identifiers": [
        "jenkins",
        "management",
        "edu",
        "umd",
        "cs",
        "findbugs",
        "annotations",
        "NonNull",
        "hudson",
        "diagnosis",
        "OldDataMonitor",
        "hudson",
        "model",
        "AdministrativeMonitor",
        "hudson",
        "model",
        "ManagementLink",
        "java",
        "util",
        "Locale",
        "text",
        "tooltip",
        "severity",
        "NonNull",
        "text",
        "NonNull",
        "tooltip",
        "NonNull",
        "severity",
        "text",
        "text",
        "tooltip",
        "tooltip",
        "severity",
        "severity",
        "text",
        "tooltip",
        "severity",
        "toString",
        "toLowerCase",
        "Locale",
        "US",
        "Severity",
        "DANGER",
        "WARNING",
        "INFO"
    ],
    "literals": [],
    "variables": [
        "text",
        "tooltip",
        "severity"
    ],
    "comments": [],
    "docstrings": [
        "* The MIT License\n *\n * Copyright (c) 2022, Markus Winter\n *\n * Permission is hereby granted, free of charge, to any person obtaining a copy\n * of this software and associated documentation files (the \"Software\"), to deal\n * in the Software without restriction, including without limitation the rights\n * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell\n * copies of the Software, and to permit persons to whom the Software is\n * furnished to do so, subject to the following conditions:\n *\n * The above copyright notice and this permission notice shall be included in\n * all copies or substantial portions of the Software.\n *\n * THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\n * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\n * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\n * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\n * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,\n * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN\n * THE SOFTWARE.",
        "*  Definition of a badge that can be returned by a {@link ManagementLink} implementation.\n *  The badge is shown as a small overlay over the corresponding icon on the {@code Manage Jenkins} page,\n *  it can display additional information in a tooltip and change it's color depending on the severity.\n *\n *  <p>\n *  A badge mainly serves as a fast feedback for the corresponding management page.\n *  It could be used to just display some short status information or hint that some action can be taken.\n *  For example the badge on {@code Manage Plugins} shows information about the number of available updates\n *  and in its tooltip additionally how many updates contain incompatible changes or fix\n *  security vulnerabilities. It also changes its color when there are security fixes available.\n *\n *  <p>\n *  A badge might display the same information as an {@link AdministrativeMonitor}. While an {@link AdministrativeMonitor}\n *  can be disabled, a badge will always be shown. E.g. the badge of {@link OldDataMonitor.ManagementLinkImpl} always shows the number of old data entries.\n *\n *  @since TODO",
        "* Create a new Badge\n     *\n     * @param text  The text to be shown in the badge.\n     *      Keep it short, ideally just a number. More than 6 or 7 characters do not look good. Avoid spaces as they will lead to line breaks.\n     *      as this might lead to line breaks.\n     * @param tooltip  The tooltip to show for the badge.\n     *      Do not include html tags.\n     * @param severity  The severity of the badge (danger, warning, info)",
        "* The text to be shown in the badge.\n     *\n     * @return badge text",
        "* The tooltip of the badge.\n     *\n     * @return tooltip",
        "* The severity of the badge.\n     * Influences the background color of the badge.\n     *\n     * @return severity as String"
    ],
    "functions": [
        "Badge",
        "getText",
        "getTooltip",
        "getSeverity"
    ],
    "classes": [
        "Badge"
    ]
}