{
    "identifiers": [
        "sim",
        "bot",
        "command",
        "org",
        "javacord",
        "api",
        "message",
        "MessageCreateEvent",
        "sim",
        "bot",
        "audio",
        "SimPlayer",
        "java",
        "util",
        "java",
        "util",
        "Random",
        "KEY_SAYINGS",
        "add",
        "add",
        "add",
        "add",
        "add",
        "add",
        "add",
        "add",
        "add",
        "add",
        "add",
        "add",
        "add",
        "add",
        "add",
        "add",
        "add",
        "add",
        "add",
        "Override",
        "player",
        "mce",
        "args",
        "index",
        "nextInt",
        "KEY_SAYINGS",
        "size",
        "mce",
        "getMessage",
        "reply",
        "KEY_SAYINGS",
        "get",
        "index",
        "Override"
    ],
    "literals": [
        "\"Life is ultimately meaningless, and our existence is nothing more than a fleeting moment in an infinite, uncaring universe.\"",
        "\"The universe is a cold, empty void, and our actions are insignificant in the grand scheme of things. Our existence is a mere accident, and death is the only true certainty.\"",
        "\"All human endeavors, beliefs, and emotions are ultimately futile, as we are just biological machines destined to return to dust.\"",
        "\"In the face of an uncaring, infinite universe, human existence is a cruel joke, and all efforts to find purpose or meaning in life are in vain.\"",
        "\"The ultimate truth is that we are nothing and our actions have no consequence. The universe will continue on long after we are gone, and our time here is nothing but a temporary blip in the grand scheme of things.\"",
        "\"Life is a meaningless cycle of birth, suffering, and death. In the end, we will all be forgotten, and our time here will have been for nothing.\"",
        "\"The world is indifferent to our struggles and suffering. We are alone in a meaningless existence, and our fate is ultimately determined by forces beyond our control.\"",
        "\"In the end, all of our hopes, dreams, and accomplishments will be for naught, as death will ultimately claim us all, rendering our lives meaningless.\"",
        "\"The only thing that is certain in life is that it will end. The universe will continue on without us and our time here is but a fleeting instant in the grand scheme of things.\"",
        "\"Life is a meaningless journey towards a predetermined end.\"",
        "\"The universe is vast and uncaring, and our existence is nothing more than a drop in the ocean.\"",
        "\"The only thing that is truly certain in life is death, and all our efforts to achieve meaning and purpose are ultimately futile.\"",
        "\"The world is a cruel and indifferent place, and our time here is but a fleeting moment in the grand scheme of things.\"",
        "\"The universe is a cold, dark void, and our existence is nothing more than a temporary blip in the grand scheme of things.\"",
        "\"In the face of an uncaring universe, human existence is a cruel joke, and all efforts to find purpose or meaning in life are in vain.\"",
        "\"Life is a cycle of suffering, and all our hopes and dreams are nothing more than illusions.\"",
        "\"In the end, all of our struggles and accomplishments will be for naught, as death will ultimately claim us all.\"",
        "\"All human endeavors, beliefs, and emotions are ultimately futile, as we are just biological machines destined to return to dust.\"",
        "\"The ultimate truth is that we are nothing and our actions have no consequence, the universe will continue on without us\"",
        "\"- [keyspeak | keyemulate | keysimulate | whatissomethingkeywouldsay]\""
    ],
    "variables": [],
    "comments": [],
    "docstrings": [],
    "functions": [
        "execute",
        "help"
    ],
    "classes": [
        "KeySpeakCmd"
    ]
}