import varvara from '@/public/assets/imgs/lectorium/reviews/varvara.jpg'
import sofya from '@/public/assets/imgs/lectorium/reviews/sofya.jpeg'

const reviewsDefault = [
  {
    name: 'Лаврова Софья',
    date: '2024-10-10',
    picture: sofya,
    text: 'С МИП я уже давно знакома! Прослушала два дистанционных психологических курса и вебинар на тему «Норма и патология в психологии». Рада, что есть возможность принять участие и в очных тренингах. Недавно посетила семинар «Психология успешного выступления». Осталась в восторге! Приятно, что во время обучения можно лично задавать вопросы ведущим экспертам. Спасибо за предоставленные возможности повышения своей квалификации и личностного роста!'
  },
  {
    name: 'Зайцева Варвара',
    date: '2024-10-16',
    picture: varvara,
    text: 'Хочу сразу отметить свою любовь к МИП! Считаю этот институт одним из лучших по качеству учебных программ и соотношению теория-практика на рынке психологического образования. Уже прошла курс переподготовки и присоединилась к потоку программы практической отработки навыков психологического консультирования, а недавно посетила семинар «Психология успешного выступления» Институт стабильно радует новыми мероприятиями, которые я рекомендую всем неравнодушным к психологии!'
  }
]

export default reviewsDefault