{
    "identifiers": [
        "imports",
        "imports",
        "imports",
        "imports",
        "domain",
        "ExtensionUtils",
        "domain",
        "domain",
        "extension",
        "extension",
        "localeDir",
        "Gettext",
        "domain",
        "localeDir",
        "Gettext",
        "domain",
        "Config",
        "schema",
        "ExtensionUtils",
        "schema",
        "schema",
        "extension",
        "Gio",
        "extension",
        "schemaDir",
        "schemaSource",
        "GioSSS",
        "schemaDir",
        "GioSSS",
        "schemaSource",
        "GioSSS",
        "schemaSource",
        "schema",
        "schemaObj",
        "schema",
        "extension",
        "Gio",
        "schemaObj"
    ],
    "literals": [
        "'gettext-domain'",
        "'locale'",
        "'settings-schema'",
        "'schemas'",
        "'Schema '",
        "' could not be found for extension '",
        "'. Please check your installation.'"
    ],
    "variables": [
        "Gettext",
        "Gio",
        "Config",
        "ExtensionUtils",
        "extension",
        "localeDir",
        "extension",
        "GioSSS",
        "schemaDir",
        "schemaSource",
        "schemaObj"
    ],
    "comments": [
        "-*- mode: js; js-basic-offset: 4; indent-tabs-mode: nil -*-",
        "Copyright (c) 2011-2012, Giovanni Campagna <scampa.giovanni@gmail.com>\n\n  Redistribution and use in source and binary forms, with or without\n  modification, are permitted provided that the following conditions are met:\n    * Redistributions of source code must retain the above copyright\n      notice, this list of conditions and the following disclaimer.\n    * Redistributions in binary form must reproduce the above copyright\n      notice, this list of conditions and the following disclaimer in the\n      documentation and/or other materials provided with the distribution.\n    * Neither the name of the GNOME nor the\n      names of its contributors may be used to endorse or promote products\n      derived from this software without specific prior written permission.\n\n  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND\n  ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED\n  WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE\n  DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER BE LIABLE FOR ANY\n  DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n  (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\n  LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND\n  ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS\n  SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.",
        "check if this extension was built with \"make zip-file\", and thus",
        "has the locale files in a subfolder",
        "otherwise assume that extension has been installed in the",
        "same prefix as gnome-shell",
        "check if this extension was built with \"make zip-file\", and thus",
        "has the schema files in a subfolder",
        "otherwise assume that extension has been installed in the",
        "same prefix as gnome-shell (and therefore schemas are available",
        "in the standard folders)"
    ],
    "docstrings": [
        "* initTranslations:\n * @domain: (optional): the gettext domain to use\n *\n * Initialize Gettext to load translations from extensionsdir/locale.\n * If @domain is not provided, it will be taken from metadata['gettext-domain']",
        "* getSettings:\n * @schema: (optional): the GSettings schema id\n *\n * Builds and return a GSettings schema for @schema, using schema files\n * in extensionsdir/schemas. If @schema is not provided, it is taken from\n * metadata['settings-schema']."
    ],
    "functions": [
        "initTranslations",
        "getSettings"
    ],
    "classes": []
}