using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Task4
{
    /*
     А.) Для кожного завдання класи (чи інтерфейси) повинні наслідувати інтерфейси ICloneable, IComparable. 
     В завданні додатково необхідно утворити клонований масив, який посортувати за певним критерієм і вивести результат.
     Б) Також покрити код юніт тестами

     4.	Визначити інтерфейс IFunction, з методами знаходження значення функції в точці, та методом обчислення n-ої похідної в точці, 
     а також інтерфейс IInputOutput для форматного введення-виведенням IFunction. Клас «степенева функція ax^n»  та клас 
     «Тригонометрична функція a*sin(b*x), cos,tg, ctg) повинні реалізувати ці інтерфейси. В масив IFunction ввести доданки деякого 
     многочлена – степеневі та тригонометричні функції. Обчислити значення многочлена в точці, та значення в цій точці похідних першого, 
     другого та третього порядків. */

    class Program
    {
        static void Main(string[] args)
        {
        }
    }
}