{
    "identifiers": [
        "org",
        "apache",
        "solr",
        "client",
        "api",
        "endpoint",
        "org",
        "apache",
        "solr",
        "client",
        "api",
        "util",
        "Constants",
        "OMIT_FROM_CODEGEN_PROPERTY",
        "io",
        "swagger",
        "v3",
        "oas",
        "annotations",
        "Operation",
        "io",
        "swagger",
        "v3",
        "oas",
        "annotations",
        "Parameter",
        "io",
        "swagger",
        "v3",
        "oas",
        "annotations",
        "extensions",
        "Extension",
        "io",
        "swagger",
        "v3",
        "oas",
        "annotations",
        "extensions",
        "ExtensionProperty",
        "jakarta",
        "ws",
        "rs",
        "GET",
        "jakarta",
        "ws",
        "rs",
        "Path",
        "jakarta",
        "ws",
        "rs",
        "PathParam",
        "jakarta",
        "ws",
        "rs",
        "QueryParam",
        "org",
        "apache",
        "solr",
        "client",
        "api",
        "model",
        "SolrJerseyResponse",
        "Path",
        "NodeFileStoreApis",
        "GET",
        "Operation",
        "summary",
        "tags",
        "extensions",
        "Extension",
        "properties",
        "ExtensionProperty",
        "name",
        "OMIT_FROM_CODEGEN_PROPERTY",
        "value",
        "Path",
        "Parameter",
        "description",
        "PathParam",
        "path",
        "Parameter",
        "description",
        "QueryParam",
        "sync",
        "Parameter",
        "description",
        "QueryParam",
        "getFrom",
        "Parameter",
        "description",
        "QueryParam",
        "meta"
    ],
    "literals": [
        "\"/node\"",
        "\"Retrieve file contents or metadata from the filestore.\"",
        "\"file-store\"",
        "\"true\"",
        "\"/files{path:.+}\"",
        "\"Path to a file or directory within the filestore\"",
        "\"path\"",
        "\"If true, triggers syncing for this file across all nodes in the filestore\"",
        "\"sync\"",
        "\"An optional Solr node name to fetch the file from\"",
        "\"getFrom\"",
        "\"Indicates that (only) file metadata should be fetched\"",
        "\"meta\""
    ],
    "variables": [],
    "comments": [
        "The response of this v2 API is highly variable based on the parameters specified.  It can",
        "return raw (potentially binary) file data, a JSON-ified representation of that file data,",
        "metadata regarding one or multiple file store entries, etc.  This variability can be",
        "handled on the Jersey server side, but would be prohibitively difficult to accommodate in",
        "our code-generation templates.  Ideally, cosmetic improvements (e.g. splitting it up into",
        "multiple endpoints) will make this unnecessary in the future.  But for now, the extension",
        "property below ensures that this endpoint is ignored entirely when doing code generation."
    ],
    "docstrings": [
        "* Licensed to the Apache Software Foundation (ASF) under one or more\n * contributor license agreements.  See the NOTICE file distributed with\n * this work for additional information regarding copyright ownership.\n * The ASF licenses this file to You under the Apache License, Version 2.0\n * (the \"License\"); you may not use this file except in compliance with\n * the License.  You may obtain a copy of the License at\n *\n *     http://www.apache.org/licenses/LICENSE-2.0\n *\n * Unless required by applicable law or agreed to in writing, software\n * distributed under the License is distributed on an \"AS IS\" BASIS,\n * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n * See the License for the specific language governing permissions and\n * limitations under the License.",
        "* V2 APIs for fetching filestore files, syncing them across nodes, or fetching related metadata."
    ],
    "functions": [
        "SolrJerseyResponse",
        "getFile"
    ],
    "classes": []
}