{
    "identifiers": [],
    "literals": [
        "This is my PC. I work mostly in JavaScript/TypeScript these days.\n      I've made a couple of games in that language. I also like Golang and Python. Anyway regardless of the language, I just like programming.\n      Here is my <a href=\"https://github.com/RasulGhatane\" target=\"_blank\">Github</a>!",
        "\"cs-degree\"",
        "CS Degree - Under Development.",
        "\"sofa-table\"",
        "That's my sofa. I like to relax here and watch YouTube. \n    I also make game programming tutorials on YouTube. Go sub to <a href=\"https://youtube.com/@rasulghatane\" target=\"_blank\">my channel</a>! (If you like the content)\n    You'll learn how I built this portfolio you're currently playing through!",
        "That's my TV. I've been watching tech youtubers a lot recently like :\n     <a href=\"https://www.youtube.com/@ThePrimeTimeagen\" target=\"_blank\">Theprimeagen</a>, <a href=\"https://www.youtube.com/@t3dotgg\" target=\"_blank\">Theo - t3.gg</a>,\n    <a href=\"https://www.youtube.com/@PirateSoftware\" target=\"_blank\">PirateSoftware</a> (sometimes) and <a href=\"https://www.youtube.com/@MelkeyDev\" target=\"_blank\">Melkey</a>!",
        "This where I sleep. Great ideas comes when I'm lying on my bed. When an idea strikes, I often have to write it down or else I won't be able to sleep because my mental energy is consumed by it.",
        "This is my desk and on it is my resume. <a href=\"https://github.com/RasulGhatane/RasulGhatane/blob/main/Rasul%20Ghatane%20CV.pdf\" target=\"_blank\">Check it out?</a>\n    Contact me at rasulghatane@gmail.com if you have any interesting job opportunities!",
        "Info about this portfolio : It's made with the Kaboom.js library which is a library for making games in JavaScript.\n    Text is rendered with HTML/CSS. So the textbox you're currently reading is not rendered within canvas.",
        "There are a lot of programming books on my shelves. There is even one in French (I also speak French btw).\n    I probably only read one of them. Who else compulsively buys technical books without ever finishing them?",
        "If you want to exit JSLegendDev's portfolio, just close the tab."
    ],
    "variables": [
        "scaleFactor",
        "dialogueData"
    ],
    "comments": [],
    "docstrings": [],
    "functions": [],
    "classes": []
}