{
    "identifiers": [
        "Component",
        "Component"
    ],
    "literals": [
        "'@angular/core'",
        "'app-vision'",
        "<section>\n      <div class=\"container-fluid\">\n        <div class=\"row\">\n          <div class=\"col-xs-10 col-xs-offset-1 mar-top-50\">\n            <h3 class=\"text-uppercase\">Vision</h3>\n            <p>\n            Escribir documentos es el principal medio de la humanidad para desarrollar\n            ideas y proyectos y es uno de los principales usos de la inform&aacute;tica.\n            </p>\n            <p>\n            Sin embargo, a&uacute;n siendo Internet la plataforma universal de\n            comunicaci&oacute;n y colaboraci&oacute;n, las ventajas que aporta\n            para la escritura de documentos en grupo siguen estando controladas por\n            productos privados (Google Docs, Dropbox paper, Microsoft Word online…).\n            Estos productos obligan a los usuarios a un uso exclusivo y desconectado\n            de los otros, con la intenci&oacute;n de acaparar clientes. Esto debilita\n            la colaboraci&oacute;n abierta y la libertad en Internet.\n            Jetpad quiere ser un servicio universal en Internet para la colaboraci&oacute;n\n            descentralizada basado principalmente en documentos. Cualquier persona\n            u organizaci&oacute;n podr&aacute; tener su propio servidor JetPad y editar\n            sus documentos en tiempo real con cualquier otro (de la misma forma que el Email).\n            </p>\n            <p>\n            Al igual que Wikipedia, que es la plataforma universal de conocimiento,\n            JetPad quiere ser la plataforma universal para construir nuevo conocimiento.\n            </p>\n          </div>\n          <div class=\"col-xs-10 col-xs-offset-1 mar-top-50\">\n            <h3 class=\"text-uppercase\">History</h3>\n            <p>\n            Escribir documentos es el principal medio de la humanidad para desarrollar\n            ideas y proyectos y es uno de los principales usos de la inform&aacute;tica.\n            </p>\n            <p>\n            Jetpad hereda su tecnolog&iacute;a de uno de los primeros productos online\n            que proporcion&oacute; escritura colaborativa de texto en tiempo real,\n            Google Wave. Tras el cierre del proyecto, Google decidi&oacute; liberar\n            el c&oacute;digo fuente a trav&eacute;s del proyecto Open Source Apache Wave.\n            Esta misma tecnolog&iacute;a ha sido la base para los productos Google Docs\n            (Referencia en Wikipedia). Jetpad se basa en un proyecto derivado Apache Wave,\n            SwellRT, que expande y mejora su objetivo original.\n            </p>\n            <p>\n            A&uacute;n existen proyectos gratuitos y abiertos para la escritura\n            colaborativa de textos, como Etherpad, pero estos han evolucionado poco\n            y proporcionan una mala experiencia de uso. Otros valiosos esfuerzos han\n            sido devorados por grandes empresas (v&eacute;ase Hackpad y Dropbox).\n            </p>\n          </div>\n        </div>\n      </div>\n    </section>\n    <app-footer></app-footer>"
    ],
    "variables": [],
    "comments": [],
    "docstrings": [],
    "functions": [],
    "classes": [
        "VisionComponent"
    ]
}