{
    "identifiers": [
        "org",
        "firstinspires",
        "ftc",
        "teamcode",
        "auto",
        "com",
        "qualcomm",
        "robotcore",
        "eventloop",
        "opmode",
        "Autonomous",
        "com",
        "qualcomm",
        "robotcore",
        "eventloop",
        "opmode",
        "LinearOpMode",
        "com",
        "qualcomm",
        "robotcore",
        "util",
        "ElapsedTime",
        "org",
        "firstinspires",
        "ftc",
        "teamcode",
        "supp",
        "Drive",
        "org",
        "firstinspires",
        "ftc",
        "teamcode",
        "supp",
        "HardwareHiveBot",
        "org",
        "firstinspires",
        "ftc",
        "teamcode",
        "supp",
        "ServoMap",
        "Autonomous",
        "name",
        "group",
        "robot",
        "clawOffset",
        "CLAW_SPEED",
        "Serv",
        "Override",
        "timer",
        "DRIVE",
        "robot",
        "init",
        "hardwareMap",
        "telemetry",
        "addData",
        "telemetry",
        "update",
        "waitForStart",
        "opModeIsActive",
        "robot",
        "leftMotor",
        "getCurrentPosition",
        "robot",
        "leftMotor",
        "getCurrentPosition",
        "DRIVE",
        "controlLeft",
        "DRIVE",
        "controlRight",
        "telemetry",
        "addData",
        "robot",
        "rightMotor",
        "getCurrentPosition",
        "telemetry",
        "addData",
        "robot",
        "leftMotor",
        "getCurrentPosition",
        "telemetry",
        "addData",
        "telemetry",
        "update"
    ],
    "literals": [
        "\"Cap Ball Autonomous\"",
        "\"Pushbot\"",
        "\"Say\"",
        "\"Yo, driver! Wazzup, man??? \\nI know you be wantin' to drive this robo-bot all around this didgeridoo,\\n but first you gotta press that there INIT button!\"",
        "\"Say\"",
        "\"Right Val: \"",
        "\"Say\"",
        "\"Left Val: \"",
        "\"Say\"",
        "\"I am a sentient being.\""
    ],
    "variables": [],
    "comments": [
        "@Disabled // Remove if you want to disable this for some obscure reason",
        "Use a Pushbot's hardware",
        "could also use HardwarePushbotMatrix class.",
        "Servo mid position",
        "sets rate to move servo",
        "Send telemetry message to signify robot waiting;",
        "Yo",
        "Wait for the game to start (driver presses PLAY)",
        "run until the end of the match (driver presses STOP)",
        "Pause for metronome tick.  40 mS each cycle = update 25 times a second."
    ],
    "docstrings": [
        "PROGRAMMING TEAM:\n\nLead - Gus Gopher Lol\nProgrammer - Anthony Denver RAFFLED\n\nBUILD TEAM:\n\nBuilder - Luc Krishna's\nBuilder - Nathan Vices\nBuilder - Cabin Choir\nBuilder - Logan Sober\nBuilder - Nicholas Miller\n\nDESIGN TEAM:\n\nDesigner - Elijah Polygon\nAssistant Designer - Luc Krishna's\n\nGAMING TEAM:\n\nLead Gamer - Charley Davis\nAssistant Gamer - Bar Hodge\n\nMENTORS:\n\nLead - Mike Dennis\nProgramming and Design Mentor - Valid Polygon\nProgramming Mentor - Aaron Elie \"The Butt\"\nProfessional Breaker Mentor - Dan Denver\n\n\n\n\n\n\nCopyright (c) 2016 Robert Atkinson, The Hive Programming Team\n\nAll rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification,\nare permitted (subject to the limitations in the disclaimer below) provided that\nthe following conditions are met:\n\nRedistributions of source code must retain the above copyright notice, this list\nof conditions and the following disclaimer.\n\nRedistributions in binary form must reproduce the above copyright notice, this\nlist of conditions and the following disclaimer in the documentation and/or\nother materials provided with the distribution.\n\nNeither the name of Robert Atkinson nor the names of his contributors may be used to\nendorse or promote products derived from this software without specific prior\nwritten permission.\n\nNO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS\nLICENSE. THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,\nTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESSFOR A PARTICULAR PURPOSE\nARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE\nFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL\nDAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR\nSERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER\nCAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR\nTORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF\nTHIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.",
        "* This OpMode uses the common Pushbot hardware class to defined the devices on the robot.\n * All device access is managed through the HardwarePushbot class.\n * The code is structured as a LinearOpMode\n *\n * This particular OpMode executes a POV Game style Teleop for a PushBot\n * It raises and lowers the claw using the Gampad Y and A buttons respectively. * In this mode the left stick moves the robot FWD and back, the Right stick turns left and right.\n\n * It also opens and closes the claws slowly using the left and right Bumper buttons.\n *\n * Use Android Studios to Copy this Class, and Paste it into your team's code folder with a new name.\n * Remove or comment out the @Disabled line to add this opmode to the Driver Station OpMode list",
        "Declare OpMode members.",
        "Initialize the hardware variables.\n         * The init() method of the hardware class does all the work here",
        "obot.waitForTick(40);"
    ],
    "functions": [
        "runOpMode"
    ],
    "classes": [
        "HiveBotAutonomousShooter"
    ]
}