{
    "identifiers": [
        "arr",
        "arr",
        "arr",
        "nums",
        "nums",
        "n",
        "n",
        "a",
        "b",
        "a",
        "b",
        "arr",
        "arr",
        "item",
        "item",
        "num",
        "num",
        "reversed",
        "arr",
        "i",
        "arr",
        "i",
        "i",
        "arr",
        "i",
        "i",
        "arr",
        "i",
        "arr",
        "i",
        "arr",
        "i",
        "arr",
        "i",
        "count",
        "count",
        "obj",
        "obj",
        "num",
        "length",
        "i",
        "length",
        "i",
        "result",
        "num",
        "i",
        "result",
        "d",
        "d",
        "sum",
        "num",
        "sum",
        "num",
        "total",
        "n",
        "n",
        "digit",
        "digit"
    ],
    "literals": [
        "'number'",
        "''",
        "''",
        "''",
        "''"
    ],
    "variables": [
        "reversed",
        "i",
        "count",
        "i",
        "result",
        "i",
        "total"
    ],
    "comments": [
        "Find the Smallest and Biggest Numbers",
        "Create a function that takes an array of numbers \nand return both the minimum and maximum numbers, in that order.",
        "sum of cubes",
        "Create a function that takes in an array of numbers and returns the sum of its cubes.",
        "Filter out Strings from an Array",
        "Create a function that takes an array of non-negative integers \nand strings and return a new array without the strings.",
        "Is the Number Symmetrical?",
        "Create a function that takes a number as an argument and returns true or false depending\non whether the number is symmetrical or not. A number is symmetrical when it is the same as its reverse.",
        "Special Arrays",
        "An array is special if every even index contains an even number and every odd index contains an odd number.\nCreate a function that returns true if an array is special, and false otherwise.",
        "How Much is True?",
        "Create a function which returns the number of true values there are in an array.",
        "Convert Key, Values in an Object to Array",
        "Write a function that converts an object into an array of keys and values.",
        "Array of Multiples",
        "Create a function that takes two numbers as arguments (num, length) and returns an array of multiples of num until the array length reaches length.",
        "25-Mile Marathon",
        "Mary wants to run a 25-mile marathon. When she attempts to sign up for the marathon,",
        "she notices the sign-up sheet doesn't directly state the marathon's length. Instead,\nthe marathon's length is listed in small, different portions. Help Mary find out how\nlong the marathon actually is.\nReturn true if the marathon is 25 miles long, otherwise, return false.",
        "Square Every Digit",
        "Create a function that squares every digit of a number."
    ],
    "docstrings": [],
    "functions": [
        "minMax",
        "sumOfCubes",
        "filterArray",
        "isSymmetrical",
        "isSpecialArray",
        "countTrue",
        "objectToArray",
        "arrayOfMultiples",
        "marathonDistance",
        "squareDigits"
    ],
    "classes": []
}