{
    "identifiers": [
        "net",
        "sf",
        "launch4j",
        "example",
        "java",
        "io",
        "BufferedReader",
        "java",
        "io",
        "java",
        "io",
        "InputStreamReader",
        "args",
        "sb",
        "sb",
        "append",
        "getProperty",
        "sb",
        "append",
        "sb",
        "append",
        "getProperty",
        "sb",
        "append",
        "sb",
        "append",
        "getProperty",
        "args",
        "length",
        "sb",
        "append",
        "i",
        "i",
        "args",
        "length",
        "i",
        "sb",
        "append",
        "args",
        "i",
        "sb",
        "append",
        "sb",
        "append",
        "sb",
        "toString",
        "line",
        "line",
        "readLine",
        "line",
        "equalsIgnoreCase",
        "line",
        "close",
        "exit",
        "e",
        "err",
        "e"
    ],
    "literals": [
        "\"Hello World!\\n\\nJava version: \"",
        "\"java.version\"",
        "\"\\nJava home: \"",
        "\"java.home\"",
        "\"\\nCurrent dir: \"",
        "\"user.dir\"",
        "\"\\nArgs: \"",
        "\"\\n\\nEnter a line of text, 'quit' or Ctrl-C to stop.\\n\\n>\"",
        "\"quit\"",
        "\"You wrote: \"",
        "\"\\n\\n>\""
    ],
    "variables": [
        "line"
    ],
    "comments": [],
    "docstrings": [
        "Launch4j (http://launch4j.sourceforge.net/)\n\tCross-platform Java application wrapper for creating Windows native executables.\n\n\tCopyright (c) 2004, 2015 Grzegorz Kowal\n\tAll rights reserved.\n\n\tRedistribution and use in source and binary forms, with or without modification,\n\tare permitted provided that the following conditions are met:\n\t\n\t1. Redistributions of source code must retain the above copyright notice,\n\t   this list of conditions and the following disclaimer.\n\t\n\t2. Redistributions in binary form must reproduce the above copyright notice,\n\t   this list of conditions and the following disclaimer in the documentation\n\t   and/or other materials provided with the distribution.\n\t\n\t3. Neither the name of the copyright holder nor the names of its contributors\n\t   may be used to endorse or promote products derived from this software without\n\t   specific prior written permission.\n\t\n\tTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\"\n\tAND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,\n\tTHE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE\n\tARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE\n\tFOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES\n\t(INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;\n\tLOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED\n\tAND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,\n\tOR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\n\tOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.",
        "* @author Copyright (C) 2005 Grzegorz Kowal"
    ],
    "functions": [
        "main"
    ],
    "classes": [
        "ConsoleApp"
    ]
}