/* eslint-disable max-len */
const AgreementSource: any = [
  {
    title: '제 1조 목적',
    text: '본 약관은 트루포인트(이하 “회사”라 한다)가 운영하는 TRUE POINT(이하 “서비스”라한다.)에서 제공하는 가공 데이터 제휴 서비스를 이용함에 있어 회사와 회원간의 이용계약 체결, 서비스 제공, 권리와 의무, 책임 사항, 결제 관리 및 기타 필요한 사항 등 서비스 운영을 위한 기본적인 사항을 규정하는 것을 목적으로 한다. ',
  },
  {
    title: '제 2조 정의',
    text: `
      1. “서비스”라 함은 회사가 제공하는 가공 및 분석된 데이터를 제공하는 결제 형태에 따라 제공 받는 데이터 제휴서비스를 의미합니다.
      
      2. 회원이라 함은 서비스에 접속하여 “약관”에 따라 회사와 이용 계약을 체결하고 회사가 제공하는 서비스를 이용하는 이용고객을 의미합니다.
      
      3. “이용 제한”이라 함은 회원이 약관 또는 운영정책 위반, 관계 법령 위반 등의 사유로 회사로부터 이용을 제한받은 상태를 의미하며, 이용제한 상태는 위반 사유가 치유되기 전까지 서비스 이용을 제한하는 제재상태와 회사의 이용을 영구히 제한하는 "영구정지" 상태로 구분됩니다.
      
      4. “결제 금액”이라 함은 데이터 제휴 체결에 있어 회원이 회사에 지급하는 금액을 말합니다.
      
      5. “결제기관”이라 함은 통신사, 신용카드사, 선불결제수단의 발행기관 등을 말합니다.
      `,

  },

  {
    title: '제 3조 약관 등의 명시와 설명 및 개정',
    text: `1. 본 약관은 서비스를 이용하고자 하는 모든 회원에 대하여 그 효력을 발생한다.

      2. 회사는 이 약관의 내용을 이용자가 쉽게 알 수 있도록 서비스 초기 화면 또는 연결화면, 필요시 "공지사항”을 통해 약관 개정 내용을 게시합니다.
      
      3. 회사는 필요한 경우 관련 법령을 위배하지 않는 범위 내에서 약관을 개정할 수 있습니다.
      
      4. 회사는 약관을 개정할 경우 개정내용과 적용일자를 명시하여 서비스에서 적용일자 7일전까지 공지합니다. 다만, 회원에게 불리하게 개정되는 경우 적용일자 30일전부터 공지합니다.
      
      5. 회사가 제 10조에 따른 방법으로 통지하였음에도 회원이 명시적으로 거부의 의사표시를 하지 않은 경우 회원이 이 개정 약관에 동의한 것으로 봅니다.
      
      6. 회원은 개정 약관에 동의하지 않는 경우 적용일자 전일까지 회사에 거부의사를 표시하고 이용 계약을 해지할 수 있습니다.
      `,
  },

  {
    title: '제 4조 운영정책',
    text: `
      1. 회사는 공정한 서비스의 유지 및 회원의 보호 등을 위해 별도의 운영정책을 운영할 수 있으며, 회원은 회사가 정한 운영정책을 반드시 확인하고 준수하여야 합니다.

      2. "약관"에서 정하지 않은 사항이나 해석에 대해서는 운영정책, 이용안내, 관련 법령에 따릅니다.
      `,

  },
  {
    title: '제 5조 회원가입 및 이용계약의 성립',
    text: `
      1. 서비스를 이용하고자 하는 이용고객은 회사가 정한 절차에 따라 이 약관에 동의하고 회원가입 신청을 하고 이러한 신청에 대하여 승인함으로써 이용계약이 체결됩니다.

      2. 회사는 제1항과 같이 신청을 한 이용고객 중 아래 각호에 해당되는 경우에는 승인을 거부할 수 있으며, 등록이 된 이후에도 아래 각호의 사유가 확인된 경우에는 승낙을 취소할 수 있습니다.
      
      (1) 이용고객이 이 약관에 의하여 이전에 자격을 상실한 적이 있는 경우.
      
      (2) 실명이 아니거나 타인의 명의(예)주민등록번호,사업자번호 등)를 이용한 경우.
      
      (3) 허위의 정보를 기재하거나, 회사가 제시하는 내용을 기재하지 않은 경우.
      
      (4) 이용고객의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을 위반하여 신청하는 경우.
      
      (5) 다른 회원으로부터 이용 불편에 대한 신고가 접수된 경우
      
      (6) 기타 회사가 필요하다고 인정한 경우.
      
      3. 제1항에 따른 신청에 있어 회사는 회원의 종류에 따라 이용계약은 아이디 단위로 체결됩니다.
      
      4. 회원이 본 약관에 동의함은 본 서비스와 관련하여 회사에서 제공하거나 제공할 모든 서비스에 동의하는 것으로 봅니다.
      `,
  },
  {
    title: '제 6조 회원계정에 대한 관리',
    text: `
      1. 회원의 아이디와 비밀번호에 관한 관리책임은 회원에게 있으며, 이를 의도하지 않은 제3자가 이용하도록 하여서는 안 됩니다.

      2. 회원은 아이디 및 비밀번호가 도용되거나 의도하지 않은 제3자에 의해 사용되고 있음을 인지한 경우에는 이를 즉시 회사에 통지하고 회사의 안내에 따라야 합니다.
      
      3. 회원은 회원 가입신청 시 기재한 사항이 변경되었을 경우 "정보수정"에서 변경을 하거나 회사의 고객센터를 통하여 회사에게 그 변경사항을 알려야 합니다.
      
      4. 제2항 및 제3항의 경우에 해당 회원이 회사에 그 사실을 통지하지 않거나, 통지한 경우에도 회사의 안내에 따르지 않아 발생한 불이익에 대하여 회사는 책임지지 않습니다.
      `,
  },
  {
    title: '제 7조 결제서비스의 내용과 회사와 회원의 의무 등',
    text: `
      1. 회사는 서비스를 상시 제공함을 원칙으로 합니다.

      2. 회사의 의무는 아래와 같습니다.
      
      (1) 트루포인트 데이터 분석 시스템 구축, 개선 및 시스템 연동
      
      (2) 회사의 시스템에 장애 발생 시 신속한 복구
      
      3. 회원의 의무는 아래와 같습니다.
      
      (1) 회원은 회원가입을 통해 이용신청을 할 경우 사실에 근거하여 작성하여야 함(회원이 허위 또는 타인의 정보를 등록한 경우 회사에 대하여 일체의 권리를 주장할 수 없으며, 이로 인하여 발생하는 손해에 대해 회사는 책임지지 않음)
      
      (2) 서비스 이용에 필요한 아이디, 비밀번호 등의 개인정보 기밀 유지(관리소홀로 인해 발생하는 책임은 회원 본인에게 있음)
      
      (3) 청소년 보호법 등 관계 법령을 준수
      
      (4) 필요한 서비스에 있어서 회사에 대한 비용의 지급
      
      (5) 정산 처리를 위한 개인정보(이름, 주민등록번호) 및 통장 정보 제공
      
      4. 회사는 결제기관 또는 회사의 시스템 정기점검 및 기타 일시 중단하여야 할 필요가 있는 경우 회원에게 사전 통지 후 일시 중단할 수 있습니다. 단, 불가항력적인 이유로 중단되는 경우 회사는 회원에게 사후 통보할 수 있습니다.
      `,
  },
  {
    title: '제 8조 거래 취소 및 결제금액 환불 등',
    text: '1. 회원이 구독의 취소 또는 환불을 요청할 경우, 회사가 응대 및 처리하는 것을 원칙으로 하며, 회사와 회원의 협의가 있거나, 관계법령 또는 정부기관의 명령이 있을 경우 회사가 처리할 수 있습니다.',
  },
  {
    title: '제 9조 회원에 대한 통지',
    text: `
      1. 회원에 대한 통지를 하는 경우 회사는 회원이 제공한 이메일 주소 또는 SMS, 서비스의 "알림” 등으로 할 수 있습니다.

      2. 회사는 불특정 다수 회원에 대한 통지의 경우 서비스 공지사항 등에 게시함으로써 개별 통지에 갈음할 수 있습니다.
      
      3. 회사가 상기와 같이 정상적으로 통지하였음에도, 회원이 통지된 내용을 확인하지 않음으로써 회원에게 발생한 불이익에 대해 회사는 책임지지 않습니다.
      `,
  },
  {
    title: '제 10조 서비스 이용제한 등',
    text: `
      1. 회사는 다음 각 호에 해당하는 경우 회원에 대하여 서비스 제공을 제한하거나 중지할 수 있습니다.

      (1) 회사와 회원간에 서비스 제공과 관련된 약정이 종료되는 경우
      
      (2) 회원이 본 약관에서 정한 의무사항을 위반하여 서비스의 정상적인 운영을 방해한 경우
      
      (3) 회원이 타인의 명의를 도용하여 회원가입을 한 경우
      
      (4) 유료결제를 함에 있어서 타인 명의 결제 도용,전화번호 도용 등 불법적인 결제를 한 경우
      
      (5) 불법프로그램의 제공 및 운영 방해, 정보통신망법을 위반한 불법 통신 및 해킹, 악성프로그램의 배포, 접속 권한 초과 행위 등과 같이 회원이 관련 법령을 위반한 경우
      
      (6) 회원 간 또는 회사와 회원 간에 분쟁이 발생하여 분쟁이 해결되지 않는 경우
      
      2. 본 조 제1항에 따라 서비스 이용이 제한되는 경우 회원이 획득한 혜택과 보유한 권리 등도 모두 소멸되며, 회사는 이에 대해 별도로 보상하지 않습니다.
      
      3. 본 조 제1항에 따라 서비스 이용이 제한 또는 중지된 회원에게 통지로써 회원 자격을 상실 또는 1년 동안 정지, 휴면시킬 수 있습니다.
      `,
  },
  {
    title: '제 11조 서비스 이용제한 등',
    text: `

  1. 회사는 다음 각 호에 해당하는 경우 회원에 대하여 서비스 제공을 제한하거나 중지할 수 있습니다.

  (1) 회사와 회원간에 서비스 제공과 관련된 약정이 종료되는 경우

  (2) 회원이 본 약관에서 정한 의무사항을 위반하여 서비스의 정상적인 운영을 방해한 경우

  (3) 회원이 타인의 명의를 도용하여 회원가입을 한 경우

  (4) 유료결제를 함에 있어서 타인 명의 결제 도용,전화번호 도용 등 불법적인 결제를 한 경우

  (5) 불법프로그램의 제공 및 운영 방해, 정보통신망법을 위반한 불법 통신 및 해킹, 악성프로그램의 배포, 접속 권한 초과 행위 등과 같이 회원이 관련 법령을 위반한 경우

  (6) 회원이 계속해서 1년 이상 로그인하지 않는 경우

  (7) 회원간 또는 회사와 회원간에 분쟁이 발생하여 분쟁이 해결되지 않는 경우

  2. 본 조 제1항에 따라 서비스 이용이 제한되는 경우 회원이 획득한 혜택과 보유한 권리 등도 모두 소멸되며, 회사는 이에 대해 별도로 보상하지 않습니다.

  3. 본 조 제1항에 따라 서비스 이용이 제한 또는 중지된 회원에게 통지로써 회원 자격을 상실 또는 1년 동안 정지, 휴면시킬 수 있습니다.`,
  },
  {
    title: '제 12조 서비스의 해제, 해지 및 청약 철회',
    text: `
      1. 회원이 이용계약을 해지하고자 할 때에는 언제든지 회사가 정한 방법을 통해 이용계약 해지를 요청할 수 있습니다. 단, 신규가입 후 일정시간 이내에는 서비스 부정이용 방지 등의 사유로 즉시 탈퇴가 제한될 수 있습니다.

      2. 회사는 회원이 본 약관에서 정한 회원의 의무를 위반한 경우 등 비정상적인 이용 또는 부당한 이용과 이용자 금지프로그램을 사용하는 계약을 해지할 수 있습니다.
      
      3. 회원이 계약을 해지할 경우, 관련법 및 개인정보취급방침에 따라 회사가 회원정보를 보유하는 경우를 제외하고는 해지 후 일정 기간 내에 회원의 개인정보 데이터는 소멸된다.
      
      4. 회사에서 제공하는 서비스를 이용하는데 있어 각 호에 해당하는 사항들을 엄격하게 금지하고 있으며, 이를 위반할 시 당사는 어떠한 책임도 지지 않는다. 또한, 아래와 같은 행위가 적발될 경우 계약을 해지할 수 있으며, 광고 수익금을 무효화 할 수 있다.
      
      (1) 회사 및 기타 제 3자의 명예를 손상시키거나 업무를 방해하는 경우
      
      (2) 부정한 용도로 서비스를 이용하고자 하는 경우
      
      (3) 회사의 정책에 적합하지 않는 이용자로 판단되는 경우나 서비스 제공이 곤란한 경우
      
      (4) 회사가 정하는 이용 목적과 방법에 반하여 서비스를 이용하고자 하는 경우
      
      (5) 본 약관이나 기타 규정을 위반하여 서비스를 이용하는 경우
      `,
  },
  {
    title: '제 13조 개인정보의 수집, 이용 및 보호 의무',
    text: `
      1. 회사는 서비스의 원활한 제공을 목적으로 개인정보를 수집 및 이용합니다. 이를 위해서는 회사는 회원에게 별도의 동의를 구합니다.

      2. 회사는 정보통신망법 등 관계 법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위해 노력합니다. 개인정보의 보호 및 사용에 대해서는 관련 법령 및 회사의 개인정보취급방침이 적용됩니다. 다만, 회사의 공식 사이트 이외의 링크된 사이트에서는 회사의 개인정보취급방침이 적용되지 않습니다.
      `,
  },

  {
    title: '제 14조 서비스 관리 책임',
    text: `

  회사의 서비스 관리책임자는 다음과 같습니다.

  1. 성명 : 강동기

  2. 직위 : 대표

  3. 연락처 : 051-515-6309`,
  },
  {
    title: '제 15조 개인정보의 동의철회',
    text:

  `회원은 서비스 해지(이용 중지의 통보)의 방법으로 회사의 개인정보의 수집, 이용, 제공에 대한 동의를 언제든지 철회하실 수 있습니다.
`,
  },
  {
    title: '제 16조 개인정보의 보유기간 및 이용기간',
    text: '회원의 개인정보는 회사가 서비스를 제공하는 기간 동안에 한하여 보유 및 이용되며, 회사는 개인정보의 수집 및 이용목적을 달성한 때에는 당해 개인정보를 지체없이 파기합니다. 다만, 국세기본법, 법인세법, 부가가치세법 기타 관계법령의 규정에 의하여 보존할 필요성이 있는 경우에는 관계법령에 따라 보존합니다.',
  },
  {
    title: '제 17조 손해배상 등',
    text:

 `1. 회사는 회원이 서비스를 이용함에 있어 회사의 고의 또는 과실로 인해 손해가 발생한 경우, 회사는 민법 등 관련 법령이 규율하는 범위 이내에서 그 손해를 배상한다.

 2. 회원이 본 약관 및 운영정책을 위반하거나 관계법령을 위반하여 회사에 손해가 발생한 경우, 회원은 회사에 그 손해를 배상하여야 한다.
 
 3. 회원이 약관 및 운영정책을 위반하거나 관계법령을 위반하여 제 3자가 회사를 상대로 민형사상의 조치를 위하는 경우, 회원은 자신의 비용과 책임으로 회사를 면책시켜야 하며 이로 인해 발생하는 손해에 대해 책임을 진다.
 
 4. 회사에 대한 손해배상의 책임은 회원의 계약해지로 해지, 해제되지 않고, 법적 기간 내까지 유효하다. 
`,
  },
  {
    title: '제 18조 서비스 제공의 중지',
    text: `
      1. 회사는 다음 각 호에 해당하는 경우 서비스 제공을 중지할 수 있습니다.

      (1) 서비스용 설비의 보수 등 공사로 인한 부득이한 경우
      
      (2) 전기통신사업법에 규정된 기간통신사업자가 전기통신서비스를 중지했을 경우
      
      (3) 기타 불가항력적 사유가 있는 경우
      
      2. 회사는 국가비상사태, 정전, 서비스 설비의 장애 또는 서비스 이용의 폭주 등으로 정상적인 서비스 이용에 지장이 있는 때에는 서비스의 전부 또는 일부를 제한하거나 정지할 수 있습니다.
      `,
  },
  {
    title: '제 19조 저작권의 귀속 및 이용제한',
    text:
 ` 1. 회사가 작성한 저작물에 대한 저작권 기타 지적재산권은 회사에 귀속합니다.

 2. 회원은 서비스를 이용함으로써 얻은 정보를 회사의 사전 승낙없이 복제, 송신, 출판, 배포, 방송 기타 방법에 의하여 영리목적으로 이용하거나 제3자가 이용하도록 하여서는 안됩니다.
 `,
  },

  {
    title: '제 20조 면책 및 책임제한 등',
    text:

  `
  1. 회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다.

  2. 회사는 회원의 귀책사유로 인한 서비스 이용의 장애에 대하여 책임을 지지 않습니다.
  
  3. 회사는 회원이 서비스를 이용하여 기대하는 수익을 상실한 것에 대하여 책임을 지지 않으며 그 밖에 서비스를 통하여 얻은 자료로 인한 손해에 관하여 책임을 지지 않습니다.
  
  4. 회사는 회원이 서비스에 게재한 정보, 자료, 사실의 신뢰도, 정확성 등 내용에 관하여는 책임을 지지 않습니다.
  
  5. 회사는 회원 상호간 또는 회원과 제3자 간에 서비스를 매개로 발생한 분쟁에 대하여는 개입할 의무, 손해를 배상할 책임이 없습니다.
  `,
  },
  {
    title: '제 21조 서비스 종료',
    text:

  `1. 회사가 서비스를 종료하고자 할 경우 회사는 서비스를 종료하고자 하는 날로부터 3개월 이전에 본 약관 제10조 제2항에서 정한 방법으로 회원에게 알려드립니다.

  2. 본 조 제1항에 따라 서비스가 종료되는 경우 회사는 관계법령에 따라 보유하고 있는 개인정보를 파기합니다.
  `,
  },

  {
    title: '부칙',
    text:
  '1. 본 약관은 2020년 10월 O1일부터 시행합니다.',
  },

];

export default AgreementSource;