{
    "identifiers": [
        "array",
        "array",
        "currentIndex",
        "randomIndex",
        "currentIndex",
        "currentIndex",
        "temporaryValue",
        "array",
        "currentIndex",
        "array",
        "currentIndex",
        "array",
        "randomIndex",
        "array",
        "randomIndex",
        "temporaryValue",
        "array"
    ],
    "literals": [
        "string",
        "string",
        "string",
        "string",
        "'../../assets/images/'"
    ],
    "variables": [
        "prefix",
        "currentIndex",
        "temporaryValue",
        "randomIndex"
    ],
    "comments": [
        "While there remain elements to shuffle...",
        "Pick a remaining element...",
        "And swap it with the current element.",
        "export let Shapers: Shaper[] = [",
        "{",
        "first: 'Tom',",
        "last: 'Hopkins',",
        "imageFile: prefix + 'githopProf.jpg',",
        "bio: ''",
        "},",
        "{",
        "first: 'Etan',",
        "last: 'Weiss',",
        "imageFile: prefix + 'Etan-17.jpg',",
        "bio: 'I work for Crestone Capital as an Investment Analyst. I assist with a range of investment research services for Crestone, including investment manager reporting, monitoring and due diligence. Prior to joining Crestone, I completed four internships with Blue Ridge Capital in New York. I earned a Bachelor of Arts in sociology from Hamilton College. I moved to Boulder in late 2014, and joined Global Shapers in mid-2016. I also serve as a weekly volunteer for Attention Homes in Boulder.'",
        "},",
        "{",
        "first: 'Charlie',",
        "last: 'Kuhn',",
        "imageFile: prefix + 'ck.headshot.fl.png',",
        "bio: 'In August 2012, Charlie began working with NYT Best Selling author, Rosalind Wiseman and over two hundred teen boys to write Masterminds & Wingmen. In 2016 Charlie founded Cultures of Dignity and as CEO he oversees business operations, strategic vision, and partnerships with innovative educational institutions to increase young people’s academic engagement, emotional wellbeing, and physical safety. He serves on the Board of Directors and is the Chair of Program Committee at Attention Homes, a non-profit organization providing housing and services for homeless and run-away youth. He also is the Curator of the Global Shapers Boulder Hub, an Initiative of the World Economic Forum, and is an advisor to the Boys’ School of Denver.'",
        "},",
        "{",
        "first: 'Matt ',",
        "last: 'Kobzik',",
        "imageFile: prefix + 'matt-k.jpg',",
        "bio: `Originally from New England, Matt moved to Boulder in 2014 and joined the Global Shapers community in 2015. His inspiration for joining came from the initial Grow event, which is now a featured part of the Boulder Hub's project scope. Since joining, Matt has engaged in several community initiatives. More recently, he created a partnership with the CU Boulder community to connect students with the Hub in Boulder.",
        "",
        "Matt currently works in the eCommerce department for Eco-Products, a Boulder-based company that makes innovative products for the food service industry. He enjoys challenges, learning new skills, and interacting with the community at large to spread the \"green\" gospel. In his spare time, Matt loves mountain biking, swimming, skiing, camping, and reading a great book.`",
        "},",
        "{",
        "first: 'Emma',",
        "last: 'Ruffin',",
        "imageFile: prefix + 'emmaProfpic.jpg',",
        "bio: 'Emma is a vision-holder and chief collaborator with C3 Boulder: The Climate Culture Collaborative, a community capacity building group that seeks to break down silos and bring people together for a magnified impact around climate action in Boulder. She also serves as the director of the Climate Action track with Impact Hub Boulder. She employs permaculture principals and Theory U into her everyday work and play, and loves to garden, create art, laugh with people and explore the wildness of ourselves and our planet. She believes that change happens at the local level, which is one of the many reasons why she was excited to co-create among peers in the Global Shapers Boulder Hub. She also serves as a mentor with the Youth Global Leaders program out of Philanthropiece. Her general motto: life I love you, all is groovy (thank you Simon and G-funk!)'",
        "},",
        "{",
        "first: 'Christopher',",
        "last: 'Senesi',",
        "imageFile: prefix + 'Senesi4.jpg',",
        "bio: 'Christopher Senesi is a huge proponent of connection and is motivated by what people can accomplish when working together. He is a strategic consultant, social entrepreneur and human rights activist. He provides strategic and business consulting to transit agencies, specifically around infrastructure asset management, and is also the co-founder of FuzeAct, a project sharing platform that brings the world together to take action for the global good. Christopher is originally from Cleveland, Ohio, and moved to Boulder in 2010 to pursue his master’s degree in civil engineering. He has been a Global Shaper since 2013 and helped start the Global Shapers Boulder Hub. He is an avid snowboarder and golfer, and is a huge fan of roller coasters.'",
        "},",
        "{",
        "first: 'Chris',",
        "last: 'Smith',",
        "imageFile: prefix + 'cSmithProfpic.jpg',",
        "bio: `Christopher Smith is a freelance web designer and content writer, and aspiring web developer. He graduated from the University of Colorado Boulder in May of 2014 with a BA in Chinese Languages and Civilizations. Shortly thereafter he relocated to Sichuan,China to teach English at a private university. However after a year abroad of travel and work the allure of Colorado's Front Range brought him back to Boulder where he is currently pursuing his personal and professional goals. When he is not traveling abroad you can find him holed up in your local coffee shop learning computer languages or planning his next adventure. He someday hopes to use web development as a tool to collaborate with companies and organizations engaged in conscious enterprise`,",
        "},",
        "{",
        "first: 'Molly',",
        "last: 'Ganley',",
        "imageFile: '',",
        "bio: ''",
        "},",
        "{",
        "first: 'Marissa',",
        "last: 'Sutera',",
        "imageFile: prefix + 'Marissa-Sutera.jpg',",
        "bio: 'Marissa has a background in marketing and international education and is the founder of Little Things Travel, where she writes about overcoming barriers in order to explore the world and ultimately appreciate the little things in life. Most recently, she launched a project called #littleBIGthings to show how travel can be a driver of positive change in big and little ways. She also works at the University of Colorado Boulder advising mechanical engineering graduate students. She is a Chicago native, but in 2014 she moved to Boulder where she later joined Global Shapers in 2016.'",
        "},",
        "{",
        "first: 'Mascot',",
        "last: 'hey oh',",
        "imageFile: prefix + 'mascotProfpic.png',",
        "bio: ''",
        "}",
        "];",
        "console.log('shapers hah', JSON.stringify(Shapers));"
    ],
    "docstrings": [
        "* Created by githop on 3/11/17."
    ],
    "functions": [
        "shuffle"
    ],
    "classes": []
}