{
    "identifiers": [
        "en"
    ],
    "literals": [
        "'Profile'",
        "'Sign out'",
        "'Sign up'",
        "'Sign in'",
        "'Main'",
        "'Game'",
        "'Forum'",
        "'Leaderboard'",
        "'Start game'",
        "'Game over'",
        "'You can replay the game or view the leaderboard'",
        "'Retry'",
        "'Fullscreen'",
        "'Exit fullscreen'",
        "'Login'",
        "'Password'",
        "'Repeat password'",
        "'First name'",
        "'Second name'",
        "'E-mail'",
        "'Phone'",
        "'High score'",
        "'Display name'",
        "'Edit profile'",
        "'Change'",
        "'Change password'",
        "'Change avatar'",
        "'Update'",
        "'Update profile'",
        "'Old password'",
        "'New password'",
        "'Repeat new password'",
        "'Update password'",
        "'Update avatar'",
        "'New avatar'",
        "'Create topic'",
        "'Theme'",
        "'Send'",
        "'Comments'",
        "'Leave a comment'",
        "'Welcome to Pacman'",
        "'Immerse yourself in the fascinating world of Pacman, a modern arcade game that takes the spirit of the classics and brings new elements to the gameplay.'",
        "'The goal of the game'",
        "'is to collect all the dots on the field.'",
        "'Beware of four elusive ghosts that persistently pursue Pacman.'",
        "'Energy bonuses scattered throughout the maze give Pacman temporary attack power and allow him to turn against ghosts for a short time. At this point, annoying pursuers are stunned into blue ghosts, and Pacman can eat them, earning extra points.'",
        "'Rules of the game'",
        "'1. Control and movement: Use the arrow keys on your keyboard to move Pacman up, down, left and right.'",
        "'2. Purpose of the game: Your goal is to collect all the dots on the playing field while avoiding the ghosts. The collected points are displayed at the top of the screen.'",
        "'3. Ghosts: There are four ghosts in the game that will haunt Pacman in the maze. If Pacman hits a ghost, the game will end. Avoid ghosts and be on your guard.'",
        "'4. Energizers: Placed throughout the maze, energizers give Pacman a temporary ability to attack ghosts. At this point, you can eat ghosts to get extra points.'",
        "'5. Points and records: The number of points scored in the game is displayed on the screen. Try to score as many points as possible by dodging ghosts and collecting all the dots on the field. You can set a new record and compete with your friends.'",
        "'Game creators'",
        "'The project'",
        "' was developed as part of the \"Middle Frontend Developer\", course by the \"GOLOVOLOMKA\" team ©'",
        "'Tolkachev Peter'",
        "'Fenin Alexander'",
        "'Usova Dasha'",
        "'Kustov Ilya'",
        "'Chumakov Stanislav'"
    ],
    "variables": [
        "en"
    ],
    "comments": [
        "eslint-disable-next-line max-len",
        "eslint-disable-next-line max-len",
        "eslint-disable-next-line max-len",
        "eslint-disable-next-line max-len",
        "eslint-disable-next-line max-len",
        "eslint-disable-next-line max-len",
        "eslint-disable-next-line max-len",
        "eslint-disable-next-line max-len"
    ],
    "docstrings": [],
    "functions": [],
    "classes": []
}