{
    "identifiers": [
        "artists"
    ],
    "literals": [
        "es",
        "Jesús Reina",
        "Jesús Reina ES",
        "Dirección Artística, violín",
        "Más allá de su virtuosismo y dominio del instrumento, el violinista malagueño Jesús Reina es ensalzado por la crítica gracias a su “personalidad radiante y llena de alma” -John Rockwell y la “belleza de su sonido caracterizado por una verdadera musicalidad, temperamento y carisma” -El País.",
        "Se ha presentado en grandes salas como el Wigmore Hall y el Royal Festival Hall de Londres, el Carnegie Hall de Nueva York, el National Arts Centre de Ottawa, la Filarmónica de San Petersburgo, el Auditorio Nacional de Madrid o el Palau de la Música de Barcelona y en festivales internacionales como el Miami Piano Festival o el Music@Menlo de California, así como en algunas de las programaciones más importantes españolas como el Auditorio de Zaragoza, el Festival del Escorial, el Festival Musika-Música de Bilbao, la Sociedad de Conciertos de Alicante, la Sociedad Filarmónica de Valencia, Sociedad Filarmónica de Málaga o la Quincena Musical de San Sebastián.",
        "Ha actuado con la Orquesta Filarmónica del Teatro Mariinsky, la Orquesta de Cámara de Munich, la Orquesta de Baja California, la Orquesta Sinfónica de Yucatán, la Sinfónica de Barcelona o la Sinfónica del Principado de Asturias, invitado por directores como Valery Gergiev, Pinchas Zukerman, Manuel Hernández Silva, Oliver Díaz, Virginia Martínez, Juan Carlos Lomónaco, Sebastian Hamman, Tomàs Grau, Francisco Valero, Eiji Oue o Ari Rasilainen.",
        "Su entusiasmo por la música de cámara le ha llevado a unirse a otros músicos como el violinista Guy Braunstein, el violista Paul Neubauer, los pianistas Judith Jáuregui y Josu de Solaun o los violonchelistas Øyvind Gimse, Amanda Forsyth y Kyril Slotnikov, y es miembro fundador del Cuarteto Picasso. Entre sus próximos compromisos destacan conciertos con la Orquesta de Timisoara en Rumanía, con la Sinfónica de la Región de Murcia, la Filarmónica de Málaga y la Franz Schubert Fiharmonía con el director Tomàs Grau, realiando una gira por España.",
        "Adicionalmente, grabará la integral de Enescu para violín producido por el sello Aria Classics. Jesús es cofundador de Málaga Clásica, junto a la violinista Anna Nilsen, y de la Academia Galamian, un centro de alta especialización musical. Su labor y compromiso con la ciudad le han valido la Medalla de Honor de Málaga y el Premio Puerta de Andalucía, reconocimiento otorgado a personas, entidades e instituciones que resaltan los valores andaluces por el mundo.",
        "Jesús se inicio al violín con su abuelo José Reina en el ámbito del folclore. Entre sus maestros posteriores se encuentran Vincenzo Puma, Ara Vartanian, Mauricio Fuks, Natasha Boyarsky, Yehudi Menuhin, José Luis García Asensio y Mauricio Fuks. Obtuvo un máster en la Manhattan School of Music con Patinka Kopec y Pinchas Zukerman. Aparece semanalmente en el exito televisivo de Canal Sur, “Tierra de Talento”, conducido por el humorista Manu Sánchez. Además de ejercer de jurado, ha colaborado con grandes artistas de diversos géneros musicales, como José Mercé, India Martínez, Mariola Cantarero, Pasión Vega, el Kanka y Ale Romero.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/Jes%C3%BAs%20Reina/general/image-03-small_ccpydm.jpg",
        "en",
        "Jesús Reina",
        "Jesús Reina EN",
        "Artistic Director, violin",
        "Beyond his virtuosity and mastery of the instrument, the violinist Jesús Reina, from Malaga, is praised by critics for his \"radiant and soulful personality\" -John Rockwell and the \"beauty of his sound characterized by a true musicality, temperament and charisma \" -El País.",
        "He has appeared in great venues such as Wigmore Hall and the Royal Festival Hall in London, Carnegie Hall in New York, the National Arts Center in Ottawa, the Saint Petersburg Philharmonic, the National Auditorium in Madrid and the Palau de la Música in Barcelona and international festivals such as the Miami Piano Festival and Music@Menlo in California, as well as in some of the most important Spanish programs such as the Zaragoza Auditorium, the Escorial Festival, the Bilbao Musika-Música Festival, the Alicante Concert Society, the Valencia Philharmonic Society, the Malaga Philharmonic Society or the Quincena Musical in San Sebastian.",
        "He has performed with the Mariinsky Theater Philharmonic Orchestra, the Munich Chamber Orchestra, the Baja California Orchestra, the Yucatan Symphony Orchestra , the Barcelona Symphony and the Principality of Asturias Symphony, invited by conductors such as Valery Gergiev, Pinchas Zukerman, Manuel Hernández Silva, Oliver Díaz, Virginia Martínez, Juan Carlos Lomónaco, Sebastian Hamman, Tomàs Grau, Francisco Valero, Eiji Oue and Ari Rasilainen.",
        "His enthusiasm for chamber music has led him to join other musicians such as the violinist Guy Braunstein, the violist Paul Neubauer, the pianists Judith Jáuregui and Josu de Solaun, the cellists Øyvind Gimse, Amanda Forsyth and Kyril Slotnikov, and he is a founding member of the Picasso Quartet. Upcoming highlights include concerts with the Timisoara Orchestra in Romania, with the Murcia Region Symphony, the Malaga Philharmonic and the Franz Schubert Fiharmonía with conductor Tomàs Grau, touring Spain.",
        "Additionally, he will record the entirety of Enescu’s repertoire for violin produced by the Aria Classics label. Jesús is co-founder of Málaga Clásica, together with the violinist Anna Nilsen, and of the Galamian Academy, a highly specialized musical center. His work and commitment to the city have earned him the Malaga Medal of Honor and the Puerta de Andalucía Prize, a recognition given to people, entities and institutions that highlight Andalusian values ​​throughout the world.",
        "Jesús began playing the violin with his grandfather José Reina in the realm of folklore. His teachers include Vincenzo Puma, Ara Vartanian, Mauricio Fuks, Natasha Boyarsky, Yehudi Menuhin, José Luis García Asensio, and Mauricio Fuks. He earned a master's degree from the Manhattan School of Music with Patinka Kopec and Pinchas Zukerman. Jesús appears weekly on Canal Sur's hit television show, “Tierra de Talento”, hosted by comedian Manu Sánchez. In addition to serving as a jury member, he has collaborated with great artists from various musical genres, such as José Mercé, India Martínez, Mariola Cantarero, Pasión Vega, el Kanka and Ale Romero.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/Jes%C3%BAs%20Reina/general/image-03-small_ccpydm.jpg",
        "es",
        "Anna Nilsen",
        "Anna Nilsen ES",
        "Dirección Artística, violín",
        "Anna Margrethe Nilsen ha sido elogiada por su “virtuosismo, expresividad y una acertadísima convergencia de líneas interpretativas sensibles junto a un exquisito trato melódico” (Revista “Ritmo”).",
        "A la edad de nueve años hizo su debut como solista con la Orquesta de Radiotelevisión de Noruega, y luego fue invitada a actuar como solista con la Orquesta Filarmónica de Bergen, la Orquesta de Cámara de Kaliningrado, la Orquesta Sinfónica de Murcia, la Orquesta Sinfónica de Trondheim, la Orquesta Sinfónica de Kristiansand, las Orquestas Sinfónicas de Asker y Bærum, Orquesta de Cámara de Novgorod, Orquesta de Ópera de Noruega, Orquesta de Cámara de Galicia, la Orquesta Filarmónica Manhattan School of Music, Orquesta Sinfónica Estatal de San Petersburgo y Orquesta de Cámara Estatal de Bielorrusia.",
        "Ha actuado por toda Europa, en Asia, Norteamérica y Sudamérica, en prestigiosos escenarios como Wiener Konzerthaus, Oslo Concert Hall, Carnegie Hall, Grieg Hall de Bergen, Teatro Cervantes de Málaga, Leon Auditorio, St. Petersburg Philharmonic Glinka Hall y Teatro de las Condes en Santiago (Chile). Como ávida músico de cámara ha tenido el placer de tocar junto a artistas distinguidos como Lars Anders Tomter, Guy Braunstein, Liza Fershtman, Henri Demarquette, Øyvind Gimse, el American String Quartet, Paul Neubauer, Amanda Forsyth y Pinchas Zukerman, y es una de los violinistas del recién formado Cuarteto Picasso. Como concertino invitada de la Orquesta Santa Cecilia, realizó una gira por España actuando en el Auditorio Nacional de Madrid, Auditorio de Zaragoza y Palau de Valencia, con el director y violinista Julian Rachlin.",
        "Comenzó a tocar el violín a la edad de 4 años y ha estudiado con el profesor Isaac Schuldman, obtuvo una Bachelor y Master de Música en la Manhattan School of Music en Nueva York, estudiando con Patinka Kopec y Pinchas Zukerman, como parte del “The Pinchas Zukerman Performance Program”. Nilsen es ganadora de los concursos Sparre Olsen (Noruega), Eisenberg-Fried (Nueva York), Lillian Fuchs (Nueva York) y Nacional de Violín para Jóvenes Noruegos, y ha recibido el Premio Dobloug, el Premio Hugo Kortschak y la Medalla de Honor de Málaga.",
        "Destacados recientes y futuros incluyen actuaciones como solista con la Orquesta de la Universidad Nacional de Santiago (Chile), la Orquesta Sinfónica de Murcia, la Orquesta Juvenil de León, la Orquesta de la Academia Galamian y la Orquesta de Cámara Barratt Due, interpretando conciertos para violín de Tchaikovsky, Brahms, Mendelssohn, Mozart y Vivaldi, recitales y conciertos de música de cámara con Pinchas Zukerman en Nueva York, en el Festival Internacional de Piano de Miami en Florida, el Festival de Música MurciArt en Murcia (España), el festival Podium en Haugesund (Noruega), concertino invitado para la ADDA Sinfonica de Alicante, y grabaciones en CD para el sello Aria Classics, de las sonatas completas de Busoni y Brahms, junto a los pianistas Josu de Solaun y Oscar Martín.",
        "Es cofundadora y profesora de violín en la Academia Internacional Galamian y cofundadora y directora del festival Málaga Clásica.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/anna-nilsen_kolwch.webp",
        "en",
        "Anna Nilsen",
        "Anna Nilsen EN",
        "Artistic Director, violin",
        "Anna Margrethe Nilsen has been praised for her “virtuosity, expressiveness and a very wise convergence of sensitive interpretative lines together with an exquisite melodic treatment” (“Ritmo” Magazine).",
        "At the age of nine, she made her solo debut with the Norwegian Broadcasting Orchestra, and has following been invited to perform as a soloist with the Bergen Philharmonic Orchestra, Kaliningrad Chamber Orchestra, Murcia Symphony Orchestra, Trondheim Symphony Orchestra, Kristiansand Symphony Orchestra, Bærum and Asker Symphony Orchestras, Novgorod Chamber Orchestra, Norwegian Opera Orchestra, Galician Chamber Orchestra, Manhattan School of Music Philharmonia, St. Petersburg State Symphony Orchestra and Belarussian State Chamber Orchestra.",
        "She has performed all over Europe, in Asia, North America and South America, in prestigious venues such as the Wiener Konzerthaus, Oslo Concert Hall, Carnegie Hall, Grieg Hall of Bergen, Teatro Cervantes in Málaga, Leon Auditorio, St. Petersburg Philharmonic Glinka Hall and Teatro de las Condes in Santiago (Chile). An avid chamber musician she has had the pleasure of performing alongside distinguished artists, including Lars Anders Tomter, Guy Braunstein, Liza Fershtman, Henri Demarquette, Øyvind Gimse, the American String Quartet, Paul Neubauer, Amanda Forsyth and Pinchas Zukerman, and is one of the violinists in the newly formed Picasso String Quartet. Invited as a guest concertmaster of the Santa Cecilia Orchestra, she toured Spain, performing in Madrid’s National Auditorium, Auditorium of Zaragoza and Palau de Valencia, with conductor and violinist Julian Rachlin.",
        "Music at the Manhattan School of Music, studying with Patinka Kopec and Pinchas Zukerman in “The Pinchas Zukerman Performance Program”. Nilsen is a winner of the competitions Sparre Olsen (Norway) , Eisenberg-Fried (New York), Lillian Fuchs (New York) and National Violin Competition for Youth (Norway), and has received the Dobloug Award, Hugo Kortschak Award and the Medal of Honor of Málaga.",
        "Recent and upcoming highlights include performances as a soloist with the Santiago National University Orchestra (Chile), Murcia Symphony Orchestra, Leon Youth Orchestra, Galamian Academy Orchestra and Barratt Due Chamber Orchestra, performing violin concertos by Tchaikovsky, Brahms, Mendelssohn, Mozart and Vivaldi, recitals and chamber music appearances with Pinchas Zukerman in New York, at the Miami International Piano Festival in Florida, the MurciArt Music Festival in Murcia (Spain), the Podium festival in Haugesund (Norway), invited concertmaster for the ADDA Symphony Orchestra of Alicante, and cd-recordings for the Aria Classics Label of the complete sonatas by Busoni and Brahms together with pianists Josu de Solaun and Oscar Martín.",
        "She is the co-founder and professor of violin at the Galamian International Academy (Málaga), and co-founder and director of Málaga Clásica festival.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/anna-nilsen_kolwch.webp",
        "es",
        "Nicolas Dautricourt",
        "Nicolas Dautricourt ES",
        "violín & viola",
        "El renombrado violinista francés Nicolas Dautricourt, aclamado como el Descubrimiento Clásico del Año por ADAMI y galardonado con el Premio Sacem Georges Enesco, ha dejado una marca indeleble en la escena de la música clásica.",
        "Actuando a nivel mundial, desde el Kennedy Center hasta el Tokyo Bunka Kaikan, ha colaborado con orquestas como la Detroit Symphony, la Royal Philharmonic Orchestra y la Orchestre National de France. También bajo la dirección de distinguidos directores como Leonard Slatkin, Paavo Järvi y Fabien Gabel.",
        "Su participación en festivales como Lockenhaus Kammermusikfest y Jazz à Vienne muestra su versatilidad. Como intérprete de un Stradivarius, la dirección artística de Dautricourt en \"Fêtes Musicales de Corbigny\" añade a su carrera multifacética.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Nicolas_Dautricourt_bzxdyo.webp",
        "en",
        "Nicolas Dautricourt",
        "Nicolas Dautricourt EN",
        "violin & viola",
        "Renowned French violinist Nicolas Dautricourt, lauded as ADAMI Classical Discovery of the Year and recipient of the Sacem Georges Enesco Prize, has left an indelible mark on the classical music scene.",
        "Performing globally, from the Kennedy Center to Tokyo Bunka Kaikan, he's collaborated with orchestras like the Detroit Symphony, Royal Philharmonic Orchestra, and Orchestre National de France, and under the baton of distinguished conductors such as Leonard Slatkin, Paavo Järvi, and Fabien Gabel.",
        "His participation in festivals like Lockenhaus Kammermusikfest and Jazz à Vienne showcases his versatility. A Stradivari player, Dautricourt's artistic directorship of \"Fêtes Musicales de Corbigny\" adds to his multifaceted career.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Nicolas_Dautricourt_bzxdyo.webp",
        "es",
        "Clémence de Forceville",
        "Clémence de Forceville ES",
        "violín",
        "Clémence de Forceville es una destacada violinista francesa.",
        "Bajo la tutela de eminentes mentores como Olivier Charlier y Antje Weithaas, obtuvo reconocimiento internacional desde temprana edad. Como solista, colaboró con orquestas como la Filarmónica de Baden-Baden y la Orchestre de Chambre de Paris. Su dedicación a la música de cámara es evidente en su papel como primera violinista del Cuarteto de Cuerdas Hieronymus y su colaboración con el Trío Sōra, que resultó en la aclamada grabación de los Tríos de Beethoven, recibiendo el Choc Classica del año 2021.",
        "Además, el liderazgo de Clémence como concertino en orquestas como la Orchestre National de Lille resalta su versatilidad y destreza en el repertorio sinfónico. Como asistente en la clase de Philippe Graffin en el Conservatoire National Supérieur de Musique et de Danse de Paris desde 2021, ha contribuido notablemente a la próxima generación de músicos. Apoyada por la Fundación Boubo-Music, Clémence toca un violín Lorenzo Storioni de 1777. Recientemente, fue nombrada concertino en la Orchestre de Chambre de Lausanne.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Cle%CC%81mence_de_Forceville_sxgcd6.webp",
        "en",
        "Clémence de Forceville",
        "Clémence de Forceville EN",
        "violin",
        "Clémence de Forceville stands out as a prominent French violinist.",
        "Under the tutelage of esteemed mentors Olivier Charlier and Antje Weithaas, she earned international acclaim early on. She collaborated as a soloist with orchestras like the Baden-Baden Philharmonic and the Orchestre de Chambre de Paris. Her commitment to chamber music is evident in her role as the first violin of the Hieronymus String Quartet and her collaboration with the Trio Sōra, resulting in the critically acclaimed recording of Beethoven Trios, receiving the Choc Classica of the year 2021.",
        "In addition, Clémence's leadership as concertmaster in orchestras like the Orchestre National de Lille highlights her versatility and prowess in the symphonic repertoire. As an assistant in Philippe Graffin's class at the Conservatoire National Supérieur de Musique et de Danse de Paris since 2021, she has notably contributed to the next generation of musicians. Supported by the Boubo-Music Foundation, Clémence performs on a 1777 Lorenzo Storioni violin. Clémence was recently appointed concertmaster at the Orchestre de Chambre de Lausanne.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Cle%CC%81mence_de_Forceville_sxgcd6.webp",
        "es",
        "Laura Romero",
        "Laura Romero ES",
        "violín & viola",
        "Nacida en Málaga, Laura Romero Alba comienza a tocar el violín a la edad de 7 años.",
        "Tras concluir su formación en el Conservatorio Superior de Málaga y en la Academia Internacional Galamian, con los profesores Anna Margrethe Nilsen y Jesús Reina, se traslada a Estados Unidos, donde realiza sus estudios de posgrado con el maestro Grigory Kalinovsky, en la Universidad de Indiana.",
        "Ha recibido masterclases de la mano de célebres pedagogos como Pinchas Zukerman o Patinka Kopec. Ha ofrecido conciertos en distintos puntos de Europa y Estados Unidos. En el ámbito de la música de cámara, participa en diversas agrupaciones como ‘River Quintet’ o ‘Camerata Bitácora’ tocando tanto el violín como la viola. Ha formado parte de orquestas como Columbus Indiana Philarmonic, Richmond Symphony Orchestra o Terre Haute Symphony Orchestra y ha actuado recientemente junto a la Hispanian Symphony Orchestra, la Orquesta Filarmónica de Málaga y la Joven Orquesta Nacional de España.",
        "Recientemente fue profesora asistente de violín y viola en la Academia Internacional Galamian en Málaga, y actualmente es miembro fundadora del quinteto Astrea.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Laura_Romero_Alba_skmexb.webp",
        "en",
        "Laura Romero",
        "Laura Romero EN",
        "violin & viola",
        "Born in Malaga, Laura Romero Alba started playing the violin at seven.",
        "After completing her studies at the Conservatory of Music in Malaga and the Galamian International Academy, studying with professors Anna Margrethe Nilsen and Jesús Reina, she moved to the United States, where she is currently completing her postgraduate studies at the University of Indiana with violin professor Grigory Kalinovsky.",
        "She has also received masterclasses from pedagogues such as Pinchas Zukerman and Patinka Kopec. She has performed as a soloist in various European and United States places. In chamber music, she participates in multiple groups, such as the ‘River Quintet’ and ‘Camerata Bitácora’ playing both the violin and the viola. She has been part of orchestras such as Columbus, Indiana Philarmonic, Richmond Symphony Orchestra and Terre Haute Symphony Orchestra.",
        "She has recently performed alongside the Hispanian Symphony Orchestra, the Philharmonic Orchestra of Malaga, and the Young National Orchestra of Spain. Until recently, she served as assistant professor of violin and viola at the Galamian International Academy in Malaga. Currently, she is a founding member of the Astrea quintet.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Laura_Romero_Alba_skmexb.webp",
        "es",
        "Tomoko Akasaka",
        "Tomoko Akasaka ES",
        "viola",
        "Tomoko Akasaka es valorada por su extraordinario carisma y presencia escénica.",
        "Ganó el “Concurso de Música Clásica de Japón y tercer premio en el Concurso Internacional ARD, apareciendo como solista con orquestas como Sinfónica de la Radio de Bavaria, de Cámara de Munich, Kremerata Báltica, Chambre Genève, Ensemble Contrechamps, FIlarmonica Banatul Timisoara, Sinfónica de Venezuela y de Cámara de Japón con directores como ara, Venezuelan Symphony Orchestra and Japan Chamber Orchestra under conductors such as Seiji Ozawa, Johannes Kalitzke, Rüdiger Bohn, Gheorghe Costin, Olivier Cuendet, Roman Kofman y Günther Herbig.",
        "Entre los músicos con quienes colabora Tomoko se encuentran Gidon Kremer, Yuri Bashmet, Daniel Hope, Juliane Banse, Heinz Holliger, Menahem Pressler, Julian Steckel, Andreas Ottensamer, Daishin Kashimoto y el Kuss Quartet , realizando conciertos en Lockenhaus, Salzburg Festival, Pablo Casals Festival, Verbier, Lucerne, Kissinger Sommer, San Francisco Musical Days, Olivier Messiaen Festival, Zagreb Chamber Music Festival, Kronberg Cello Festival, Alba Music Festival y Schubertiade.",
        "Tomoko Akasaka también ha actuado en el Concertgebouw Amsterdam, Tonhalle Zurich, Mozarteum Salzburg, Victoria Hall London, Grand Theater Geneva, Konzerthaus y Philharmonie Berlin, Elmau Castle, Suntory Hall Tokyo y Nymphenburg Castle Munich. Empezó a tocar el violín con cinco años y atendió la escuela especial de la Universidad de Música de Toho.",
        "Tras graduarse, estudió en la Academia Liszt de Budapest. Al poco tiempo cambió a la viola estudió en la Universidad de Toho Tokyo, continuando después en el Conservatorio de Ginebra con Nobuko Imai, siendo además su asistente. También fue profesora invitada en el Conservatorio de Neuchatel. Tomoko se unió al Cuarteto Amaryllis en 2016.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/tomoko_ndhzaw.webp",
        "en",
        "Tomoko Akasaka",
        "Tomoko Akasaka EN",
        "viola",
        "Tomoko Akasaka is appreciated for her extraordinary charisma and stage presence.",
        "She won the \"Japan Classical Music Competition\" and 3rd prize at the International Music Competition of ARD and appeared as soloist with the Bavarian Radio Symphony Orchestra, Munich Chamber Orchestra, Kremerata Baltica, Orchestre de Chambre Genève, Ensemble Contrechamps, Filarmonica Banatul Timisoara, Venezuelan Symphony Orchestra and Japan Chamber Orchestra under conductors such as Seiji Ozawa, Johannes Kalitzke, Rüdiger Bohn, Gheorghe Costin, Olivier Cuendet, Roman Kofman and Günther Herbig.",
        "Tomoko's chamber music partners include Gidon Kremer, Yuri Bashmet, Daniel Hope, Juliane Banse, Heinz Holliger, Menahem Pressler, Julian Steckel, Andreas Ottensamer, Daishin Kashimoto and the Kuss Quartet , performing at Lockenhaus, Salzburg Festival, Pablo Casals Festival, Verbier, Lucerne, Kissinger Sommer, San Francisco Musical Days, Olivier Messiaen Festival, Zagreb Chamber Music Festival, Kronberg Cello Festival, Alba Music Festival and Schubertiade.",
        "Tomoko Akasaka has played at the Concertgebouw Amsterdam, Tonhalle Zurich, Mozarteum Salzburg, Victoria Hall London, Grand Theater in Geneva, Konzerthaus and Philharmonie Berlin, Elmau Castle, Suntory Hall Tokyo and Nymphenburg Castle Munich. Tomoko first started playing the violin at the age of five and went to the special school of the Toho Music University.",
        "After graduation, she studied at the Liszt Academy in Budapest, Hungary. Shortly after, she switched to the viola and studied at the Toho Tokyo University, continuing her studies at the Geneva Conservatory with Nobuko Imai, while being her assistant. She was also a guest professor at the Conservatory of Neuchatel. Tomoko joined the Amaryllis Quartet in 2016.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/tomoko_ndhzaw.webp",
        "es",
        "Razvan Popovici",
        "Razvan Popovici ES",
        "viola",
        "El violista rumano Razvan Popovici ha actuado en escenarios prestigiosos, como Théatre-dés-Champs-Elysées (París), Filarmónica de Colonia, Carnegie Hall (Nueva York), Concertgebouw (Ámsterdam), Wigmore Hall (Londres), Suntory Hall (Tokio), Gasteig (Munich), Kennedy Center (Washington) y el Vienna Konzerthaus y Musikverein, Atheneum (Bucarest), Prinzregententheater (Munich), De Singel (Antwerpen), BOZAR (Bruselas), y con orquestas como la Orquesta de Cámara de Colonia, Kamerata Kronstadt, Kobe Chamber Orchestra, Lohja City Orchestra, Transylvania Symphony Orchestra Cluj, Sibiu State Philharmonic, Romanian National Radio Orchestra y George Enescu Philharmonic Bucharest.",
        "Como músico de cámara ha colaborado con Natalia Gutman, Shlomo Mintz, Enrico Pace, Giovanni Sollima, Konstantin Lifschitz, Lawrence Power, así como con los cuartetos Szymanowski, Vertavo, Casal, Danel, Kelémen, Glinka o Schumann, miembros del quarteto Amadeus y Ensemble Wien-Berlin, y ha lanzado ocho CDs con el Ensemble Raro, que realiza giras frecuentes por Europa, Japón y América del Norte.",
        "Es el Fundador y Director Ejecutivo del Festival Chiemgauer Musikfrühling en Alemania, del Festival SoNoRo en Bucarest y del Festival SoNoRo Arezzo en Toscana, así como Director Artístico de la Serie de Música de Cámara DA CAPO en Bucarest. Enseña regularmente en Villa Musica, y ha sido nombrado profesor en el Real Conservatorio de Amberes.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/razvan-popovici_xq4gj1.webp",
        "en",
        "Razvan Popovici",
        "Razvan Popovici EN",
        "viola",
        "The Romanian violist Razvan Popovici has performed in prestigious venues, including Théatre-dés-Champs-Elysées (Paris), Cologne Philharmony, Carnegie Hall (New York), Concertgebouw (Amsterdam), Wigmore Hall (London), Suntory Hall (Tokyo), Gasteig (Munich), Kennedy Center (Washington) and the Vienna Konzerthaus and Musikverein, Atheneum (Bucharest), Prinzregententheater (Munich), De Singel (Antwerpen), BOZAR (Brussels), and with orchestras such as the Cologne Chamber Orchestra, Camerata Kronstadt, Kobe Chamber Orchestra, Lohja City Orchestra, Transylvania Symphony Orchestra Cluj, Sibiu State Philharmonic, Romanian National Radio Orchestra and George Enescu Philharmonic Bucharest.",
        "As a chamber musician, he has collaborated with Natalia Gutman, Shlomo Mintz, Enrico Pace, Giovanni Sollima, Konstantin Lifschitz, Lawrence Power, as well as alongside the Szymanowski, Vertavo, Casal, Danel, Kelémen, Glinka or Schumann Quartets, members of the Amadeus Quartet and Ensemble Wien-Berlin, and has released eight CDs with the Ensemble Raro, which frequently tours Europe, Japan and North America.",
        "Popovici is the Founder and Executive Director of the Chiemgauer Musikfrühling Festival in Germany, the SoNoRo Festival in Bucharest and the SoNoRo Arezzo Festival in Tuscany, as well as the Artistic Director of the DA CAPO Chamber Music Series in Bucharest. He teaches regularly at the Villa Musica and has been appointed professor at the Royal Conservatory in Antwerp.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/razvan-popovici_xq4gj1.webp",
        "es",
        "Øyvind Gimse",
        "Øyvind Gimse ES",
        "violonchelo",
        "Øyvind Gimse, que ocupó el cargo de director artístico de Trondheim Soloists en 2002-2017, convirtió a la orquesta en uno de los ensembles más distinguidos de Escandinavia y ganó reconocimiento internacional por su sonido orquestal claramente abierto y claro, descrito por la revista musical británica \" Classic FM\" como \"The Trondheim Sound\".",
        "Sus grabaciones con los Trondheim Soloists han recibido siete nominaciones al GRAMMY y ganado tres premios Grammy noruegos, y con el ensemble ha realizado giras desde Japón hasta América del Sur. Como solista o líder orquestal invitado, Gimse ha visitó Finlandia, Italia, los Países Bajos y en particular España. Gimse visita regularmente todos los festivales de música de cámara de Noruega y ha actuado con músicos como Leif Ove Andsnes, Anthony Marwood, Nobuko Imai y Bobby McFerrin.",
        "Su dedicación a la música contemporánea le ha permitido él para cooperar con compositores como Sofia Gubaidolina, George Crumb y Bent Sorensen. Gimse es también internacionalmente reconocido como profesor, siendo profesor invitado en la Academia Galamian en Málaga y realizando talleres y masterclasses por toda Europa. El desarrollo del talento musical y el fomento de un ambiente musical duradero en Noruega constituye una parte vital de su trabajo.",
        "Es miembro del programa de mentores «Konstknekt», una cooperación entre la Orquesta Filarmónica de Berlín y el festival de música de cámara «Vinterfestspill» en Røros, donde ocupa el cargo de director artístico. Gimse toca un Francesco Goffriller (1730) propiedad de Sparebankstiftelsen/Dextra Musica en Oslo, un magnífico instrumento que antes tocaba la legendaria violonchelista Jacqueline du Pré.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/%C3%98yvind_Gimse_sq_iaqsrn.webp",
        "en",
        "Øyvind Gimse",
        "Øyvind Gimse EN",
        "cello",
        "Holding the position as Artistic Director of the Trondheim Soloists in 2002-2017, Øyvind Gimse developed the orchestra into being one of the most distinguished ensembles in Scandinavia and won international recognition for it’s distinctively open and clear orchestral sound, described by the British music magazine \"Classic FM\" as “The Trondheim Sound\".",
        "His recordings with the Trondheim Soloists have received seven GRAMMY nominations and won three Norwegian Grammys, and he has toured from Japan to South America with the ensemble. As a soloist or orchestral guest leader, Gimse has visited Finland, Italy, the Netherlands and in particular Spain. Gimse is regularly visiting all of the Norwegian chamber music festivals and has performed with musicians such as Leif Ove Andsnes, Anthony Marwood, Nobuko Imai and Bobby McFerrin.",
        "His dedication to contemporary music has allowed him to co-operate with composers like Sofia Gubaidolina, George Crumb and Bent Sorensen. Gimse is also an internationally recognized professor, holding a guest professorship at «Academia Galamian» in Malaga and taking workshops and masterclasses throughout Europe. The development of musical talent and the fostering of an enduring musical environment in Norway constitutes a vital part of his work.",
        "He is a member of the mentor program «Konstknekt», a cooperation between the Berlin Philharmonic orchestra and the chamber music festival «Vinterfestspill» in Røros, where he holds the position as the artistic director. Gimse plays a Francesco Goffriller(1730) owned by the Sparebankstiftelsen/Dextra Musica in Oslo, a magnificent instrument formerly played by the legendary cellist Jacqueline du Pré.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/%C3%98yvind_Gimse_sq_iaqsrn.webp",
        "es",
        "Per Nyström",
        "Per Nyström ES",
        "violonchelo",
        "Per, actualmente el violonchelista principal de Uppsala Chamber Soloists & Orchestra, cofundó y tocó con el galardonado Cuarteto Yggdrasil de 1990 a 2011, disfrutando de una residencia en la Universidad de Aberdeen.",
        "Posteriormente, fue violonchelista solista en Camerata Nordica de 2001 a 2016, combinando responsabilidades artísticas y de formación. Desde 2005, ocupa el cargo de director artístico de los festivales Kammarmusikens vänner, organizando cerca de 70 festivales internacionales y clases magistrales que atraen a participantes de todo el mundo. Además de sus compromisos orquestales, Per contribuye a conjuntos como el Trio Elégiaque y el Swedish Piano Trio, actuando como invitado en festivales globales.",
        "Reconocido por sus contribuciones, es miembro honorario de por vida de la Universidad de Aberdeen y ha recibido la Medalla Real \"Literis et artibus\". Per toca un violonchelo Antonio & Giuseppe Gagliano de 1796 proveniente de Nápoles y es conocido por su fuerza, levantando 200 kg en un levantamiento de pesas.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Per_Nystro%CC%88m_wplq3e.webp",
        "en",
        "Per Nyström",
        "Per Nyström EN",
        "cello",
        "Per, currently the principal cellist with Uppsala Chamber Soloists & Orchestra, co-founded and played with the prize-winning Yggdrasil Quartet from 1990 to 2011, enjoying a residency at the University of Aberdeen.",
        "Following this, he served as the solo cellist in Camerata Nordica from 2001 to 2016, combining artistic and lineup responsibilities. Since 2005, he has held the position of artistic director for Kammarmusikens vänner festivals, organizing nearly 70 international festivals and masterclasses that attract participants worldwide. In addition to his orchestral commitments, Per contributes to ensembles like Trio Elégiaque and the Swedish Piano Trio, performing as a guest at global festivals.",
        "Recognized for his contributions, he holds an honorary lifetime membership at the University of Aberdeen and has been awarded the Royal Medal \"Literis et artibus.\" Per plays a 1796 Antonio & Giuseppe Gagliano cello from Naples and is known for his strength, lifting 200 kg in a deadlift.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Per_Nystro%CC%88m_wplq3e.webp",
        "es",
        "Gabriel Ureña",
        "Gabriel Ureña ES",
        "violonchelo",
        "Gabriel Ureña ha tocado como solista con la London City Orchestra, Oviedo Filarmonía o Arteus Orquesta y en salas internacionales prestigiosas como el Musikverein (Viena), Teatro de los Campos Elíseos (París), Seoul Arts Center, Auditorio Nacional de Música (Madrid), Palau de la Música (Barcelona) o el Teatro de la Maestranza (Sevilla).",
        "Ha compartido escenario con artistas como Leo Nucci, Edita Gruberová, Ainhoa Arteta, Ruggero Raimondi, Anna Netrebko, Ilya Gringolts, Benjamin Schmid, las hermanas Labèque, Natalia Gutman o Midori, y ha ganado el Primer Premio del Concurso de Cello de Arquillos (Jaén) y del Concurso Internacional de Música de Cámara \"Ciudad de Manresa”.",
        "Entre los hitos más recientes de su carrera figuran la publicación de su primer CD, con el sello Aria Classics, con obras de Prokofiev, Shostakovich y Rachmaninov, junto al pianista Patxi Aizpiri, su concierto como solista con la Orquesta Filarmónica de Málaga o su debut con la Orquesta Nacional de Colombia en el Teatro Colón de Bogotá.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Gabriel_Urena_k3zidf.webp",
        "en",
        "Gabriel Ureña",
        "Gabriel Ureña EN",
        "cello",
        "Gabriel Ureña has performed as a soloist with the London City Orchestra, Oviedo Philharmonic and Arteus Orquesta and in prestigious international venues such as the Musikverein (Vienna), Theater of the Champs Elysees (Paris), Seoul Arts Center, National Auditorium of Music (Madrid), Palau de la Música (Barcelona) and the Teatro de la Maestranza (Seville).",
        "He has shared the stage with artists such as Leo Nucci, Edita Gruberová, Ainhoa Arteta, Ruggero Raimondi, Anna Netrebko, Ilya Gringolts, Benjamin Schmid, the Labèque sisters, Natalia Gutman and Midori, and is the First Prize Winner of the Cello Competition of Arquillos (Jaén) and the International Chamber Music Competition \"City of Manresa”.",
        "Among the most recent milestones of his career are the publication of his first CD for the label Aria Classics, with works by Prokofiev, Shostakovich and Rachmaninov, with the pianist Patxi Aizpiri, his solo appearance with the Malaga Philharmonic Orchestra and his debut with the Colombian National Orchestra at the Teatro Colón in Bogotá.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Gabriel_Urena_k3zidf.webp",
        "es",
        "Natalia Kucháeva",
        "Natalia Kucháeva ES",
        "piano",
        "Destacada por la crítica por “una técnica formidable, delicadeza y una sensibilidad exquisita” la pianista Natalia Kucháeva ha ganado premios en concursos como el Anton Rubinstein de París, el José Iturbi (Valencia), el Alexandr Scriabin de Grosetto (Italia), y el Ettlingen y el Pianale (Alemania), se formó en la Escuela de Música afiliada al Conservatorio Estatal P. I. Tchaikovsky de Moscú, en la Academia Gnessin y en la Escuela Superior de Música de Lucerna (Suiza), con los maestros Vladimir Tropp y Konstantin Lifschitz.",
        "Recientemente ha terminado el Máster de Lied “Victoria de los Ángeles” en la ESMUC de Barcelona recibiendo Matrícula de Honor. Durante 10 años ha sido maestra repetidora de la ópera en el Teatro de la Maestranza de Sevilla, y ha actuado en festivales y conciertos en Bienal de Flamenco 2020 (Sevilla) Festival Rafael Orozco (Córdoba), Festival Otoño Clásico (Lisboa), Casa Bösendorfer (Suiza), Casa Steingräber (Alemania), Teatro Petruzelli (Italia), Teatro de la Maestranza de Sevilla, Auditorio de Tenerife, Sala Bolshoi (Conservatorio Tchaikovsky de Moscú) y Act City Concert Hall (Japón), y forma un dúo pianístico con Jorge Lechado.",
        "Entre sus actuaciones destaca el concierto en la entrega del Premio Internacional de Poesía Federico García Lorca, en el Auditorio Manuel de Falla de Granada, con la presencia de los Príncipes de Asturias. Es profesora invitada en la Academia Internacional Galamian en Málaga, donde imparte clases del Método Brainin: “Desarrollo de intelecto musical“.",
        "Desde el año 2022 es profesora de repertorio de la Cátedra de Canto \"Alfredo Kraus\" de la Escuela Superior de Música Reina Sofía de Madrid.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Natalia_Kuchaeva_sq_xhbtyf.webp",
        "en",
        "Natalia Kucháeva",
        "Natalia Kucháeva EN",
        "piano",
        "Noted by critics for \"a formidable technique, delicacy and exquisite sensitivity\", pianist Natalia Kucháeva has won prizes in competitions, such as the Anton Rubinstein in Paris, the José Iturbi (Valencia), the Alexandr Scriabin in Grosetto (Italy) and the Ettlingen and Pianale (Germany). She studied at the School of Music affiliated with the P.I. Tchaikovsky State Conservatory (Moscow), at the Gnessin Academy and School of Music of Lucerne (Switzerland), with Vladimir Tropp and Konstantin Lifschitz.",
        "Recently she finished the Master of Lied \"Victoria de los Ángeles\" at the ESMUC in Barcelona graduation with an honorary degree. For 10 years she was a piano répétiteur of opera at the Teatro de la Maestranza in Seville, and has participated in festivals and performed in Bienal de Flamenco 2020 (Seville), Rafael Orozco Festival (Cordoba), Classic Autumn Festival (Lisbon), Bösendorfer House (Switzerland), Steingraber House (Germany), Petruzelli Theater (Italy), Teatro de la Maestranza (Seville), Tenerife Auditorium, Bolshoi Hall (Moscow Tchaikovsky Conservatory) and Act City Concert Hall (Japan), and she forms a piano duo with Jorge Lechado.",
        "Recent highlights include performances at the Federico García Lorca International Poetry Prize ceremony, in the Manuel de Falla Auditorium in Granada, with the presence of the Prince and Princess of Asturias. She is a visiting professor at the Galamian International Academy in Malaga, where she teaches the Brainin Method: \"Development of musical intellect\".",
        "Since 2022 she has been a repertoire teacher at the \"Alfredo Kraus\" Singing Chair at the Reina Sofía Superior School of Music in Madrid.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Natalia_Kuchaeva_sq_xhbtyf.webp",
        "es",
        "Josu De Solaun",
        "Josu De Solaun ES",
        "piano",
        "El pianista hispanoamericano Josu De Solaun es el ganador del Primer Premio del XIII Concurso Internacional de Piano George Enescu, Bucarest, el XV Concurso Internacional de Piano José Iturbi y el Primer Concurso de Piano de la Unión Europea.",
        "Ha sido invitado a actuar en distinguidas salas de conciertos de todo el mundo, incluyendo al Ateneo Rumano de Bucarest, el Teatro La Fenice de Venecia, el Teatro Mariinsky de San Petersburgo, el Kennedy Center de Washington, Carnegie Hall y Metropolitan Opera de Nueva York, Southbank Centre de Londres, Salle Cortot de París, Schumann Haus de Leipzig, Novel Hall en Taipei, la Sala Silvestre Revueltas de la Ciudad de México, el Palacio Nostitz de Praga, la Academia de España en Roma, el Festival Internacional de Música de Menton y todas las principales ciudades de España.",
        "La temporada 2020-2021 contó con su concierto–debut de improvisación libre al piano, panDEMiCity, en el Auditorio Ciudad de León, así como actuaciones como solista con orquestas en España, República Checa y Rumanía. En 2021, también recibió el prestigioso premio ICMA (International Classical Music Awards) por su grabación de Sonatas para violín y piano francesas con la violinista Franziska Pietsch («Fantasque«), y en 2023, recibión el mismo galardón por su álbum Haydn Piano Sonatas. Su último álbum en solitario de obras de Brahms y Schumann para el sello IBS Classical – «Digressions» – ha cosechado excelentes críticas.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Josu_de_Solaun_mrounb.webp",
        "en",
        "Josu De Solaun",
        "Josu De Solaun EN",
        "piano",
        "Spanish-American pianist Josu De Solaun is the winner of the First Prize of the XIII George Enescu International Piano Competition, Bucharest, the XV José Iturbi International Piano Competition and the First Piano Competition of the European Union.",
        "He has been invited to perform in distinguished concert halls around the world, including the Romanian Athenaeum in Bucharest, the La Fenice Theater in Venice, the Mariinsky Theater in St. Petersburg, the Kennedy Center in Washington, Carnegie Hall and the Metropolitan Opera in New York, the Southbank Center in London, the Salle Cortot in Paris, the Schumann Haus in Leipzig, the Novel Hall in Taipei, the Sala Silvestre Revueltas in Mexico City, the Nostitz Palace in Prague, the Spanish Academy in Rome, the International Music Festival of Menton and all the main cities of Spain.",
        "The 2020-2021 season featured his free improvisation concert-debut on piano, panDEMiCity, at the León Auditorium, as well as solo performances with orchestras, in Spain, the Czech Republic and Romania. In 2021, he also received the prestigious ICMA (International Classical Music Awards) award for his recording of French Violin and Piano Sonatas with violinist Franziska Pietsch (“Fantasque”), and in 2023 he obtained the same award for his Haydn Piano Sonatas album. His latest solo album of works by Brahms and Schumann for the IBS Classical label – “Digressions” – has garnered great reviews.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Josu_de_Solaun_mrounb.webp",
        "es",
        "Antonio del Pino",
        "Antonio del Pino ES",
        "órgano",
        "Antonio del Pino, doctor en Musicología por el Pontificio Instituto de Música Sacra de Roma, destaca como violista, organista y director coral.",
        "Su trayectoria incluye participación en festivales internacionales en Italia, como Castelli d'Aria, Musica a Tramonti y Fiori Musicali de Zurich en Suiza, además de festivales en Portugal como São Vicente de Fora en Lisboa, Festival Internacional de Mafra, y en Suiza el Festival Internacional de Música de Rocca Massima.",
        "Dirige el coro de la Catedral de Málaga, donde también desempeña el cargo de organista y coordina el ciclo de órgano en primavera. Investigador becado por la Junta de Andalucía, ha destacado en proyectos sobre el compositor malagueño Juan B. Cansino Antolínez. Obtuvo el Magisterio en Canto Gregoriano y Dirección de Coro en Milán, defendiendo una tesis sobre la influencia aquitana en los cantorales de Canto Llano de la Catedral de Málaga.",
        "Fundador de la Capilla Maestro Iribarren, ha colaborado con reconocidos músicos como Marco Frisina, organizando estrenos mundiales. Su labor editorial abarca artículos y ediciones críticas, y en 2019 recibió el Premio a la mejor labor musical del año de Málaga.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Antonio_del_Pino_lok4vw.webp",
        "en",
        "Antonio del Pino",
        "Antonio del Pino EN",
        "organ",
        "Antonio del Pino, a Ph.D. in Musicology from the Pontifical Institute of Sacred Music in Rome, stands out as a violist, organist, and choral director.",
        "His career includes participation in international festivals in Italy, such as Castelli d'Aria, Musica a Tramonti, and Fiori Musicali in Zurich, Switzerland, as well as festivals in Portugal, including São Vicente de Fora in Lisbon and the International Festival of Mafra, and in Switzerland, the International Music Festival of Rocca Massima.",
        "He directs the choir of the Cathedral of Malaga, where he also serves as the organist and coordinates the spring organ cycle. A researcher funded by the Junta de Andalucía, he has excelled in projects related to the Malaga composer Juan B. Cansino Antolínez. He obtained a Master's degree in Gregorian Chant and Choir Direction in Milan, defending a thesis on the Aquitanian influence in the plainchant choirbooks of the Cathedral of Malaga.",
        "As the founder of the Capilla Maestro Iribarren, he has collaborated with renowned musicians like Marco Frisina, organising world premieres. His editorial work encompasses articles and critical editions, and in 2019, he was awarded the prize for the Musical Achievement of the Year in Malaga.",
        "https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Antonio_del_Pino_lok4vw.webp"
    ],
    "variables": [
        "artists"
    ],
    "comments": [
        "Jesús Reina",
        "English - Jesús Reina",
        "Anna Nilsen",
        "English - Anna Nilsen",
        "Nicolas Dautricourt",
        "English - Nicolas Dautricourt",
        "Clémence de Forceville",
        "English - Clémence de Forceville",
        "Robert Kowalski",
        "{",
        "locale: `es`,",
        "name: `Robert Kowalski`,",
        "slug_name: `Robert Kowalski ES`,",
        "instrument: `violín`,",
        "para_1: `El primer concertino de la Orchestra della Svizzera italiana cautiva al público con un sonido único e intenso y una musicalidad que es a la vez vivaz y elegante.`,",
        "sentences: [",
        "`Comenzó a estudiar el violín con siete años y solo cuatro años después interpretó el concierto para violín de Mendelssohn con la Orquesta Filarmónica del Báltico. Aparece regularmente como solista y músico de cámara en festivales de música en Europa, Estados Unidos y Asia, actuando en prestigiosas salas de conciertos como el Wiener Musikverein, el Mozarteum de Salzburgo, el Laeiszhalle (Hamburgo) y el Carnegie Hall (Nueva York).`,",
        "`Ha ganado premios en concursos internacionales, incluido el Concurso Internacional de Personalidades Musicales Aleksander Tansman en Polonia, el Premio a Artistas Jóvenes del Ministerio de Cultura de Polonia y el Premio a Creadores Jóvenes del alcalde de su ciudad natal de Gdansk. `,",
        "`Robert estudió en Alemania y Suiza con Waleri Gradow, y más tarde con Kolja Blacher y Ana Chumachenco. Su desarrollo musical también estuvo profundamente influenciado por Bernard Greenhouse, Ivry Gitlis e Ida Haendel y ha trabajado con notables musicos como Vladimir Ashkenazy, Reinhard Goebel, Martha Argerich y Julian Rachlin.`,",
        "`Su grabación del concierto para violín de Richard Strauss con la Orchestra della Svizzera Italiana y Markus Poschner, lanzada en 2018 por el sello CPO, obtuvo elogios de la crítica en toda Europa y la nominación a los International Classical Music Awards 2019. En 2016 se unió a la mundialmente reconocida Cuarteto Karol Szymanowski. Toca un violín J. B. Vuillaume de 1860, cedido generosamente por la Fondazione per l'Arte e Socialità.`,",
        "],",
        "image: `https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Robert_Kowalski_g93mwg.webp`,",
        "},",
        "English - Robert Kowalski",
        "{",
        "locale: `en`,",
        "name: `Robert Kowalski`,",
        "slug_name: `Robert Kowalski EN`,",
        "instrument: `violin`,",
        "para_1: `The first concertmaster of the Orchestra della Svizzera italiana captivates audiences with a unique, intense sound and a musicality that is at once lively and elegant.`,",
        "sentences: [",
        "`He began studying the violin aged seven, and only four years later performed Mendelssohn’s Violin Concerto with the Baltic Philharmonic Orchestra. He appears regularly as a soloist and chamber musician at music festivals in Europe, the USA and Asia, performing in prestigious concert venues such as the Wiener Musikverein, Mozarteum Salzburg, Laeiszhalle (Hamburg) and Carnegie Hall (New York).`,",
        "`He has won prizes in international competitions, including the Aleksander Tansman International Competition of Musical Personalities in Poland, Young Artists Award of the Polish Ministry of Culture, and Young Creators Award from the mayor of his native city of Gdansk.`,",
        "`Robert studied in Germany and Switzerland with Waleri Gradow, and later on with Kolja Blacher and Ana Chumachenco. His musical development was also profoundly influenced by Bernard Greenhouse, Ivry Gitlis and Ida Haendel and he has worked with remarkable musicians such as Vladimir Ashkenazy, Reinhard Goebel, Martha Argerich and Julian Rachlin.`,",
        "`His recording of the violin concerto by Richard Strauss with the Orchestra della Svizzera Italiana and Markus Poschner, released in 2018 by the CPO label, earned critical acclaim throughout Europe and the nomination for International Classical Music Awards 2019. In 2016 he joined the world-renowned Karol Szymanowski Quartet. He plays a J. B. Vuillaume violin from 1860, on generous loan from the Fondazione per l'Arte e Socialità.`,",
        "],",
        "image: `https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Robert_Kowalski_g93mwg.webp`,",
        "},",
        "Joanna Wronko",
        "{",
        "locale: `es`,",
        "name: `Joanna Wronko`,",
        "slug_name: `Joanna Wronko ES`,",
        "instrument: `violín`,",
        "para_1: `La violinista polaca Joanna Wronko es una músico polivalente con una amplia experiencia en el mundo de orquesta y música de cámara.`,",
        "sentences: [",
        "`Estudió en Friburgo con la prof. Magdalena Rezler, completando su Diploma de Solista en Hamburgo con la prof. Kolja Blacher. Durante el Festival Holland Music Sessions fue nominada al premio New Masters on Tour con un recital de debut en el Concertgebouw en 2007. En 2008 grabó un CD a dúo con Frank van de Laar, que ha sido retransmitido por la radio holandesa y polaca. Joanna ha aparecido en festivales como el Festival de Música de Colmar (Francia), Keshet Eilon (Israel), Gustav Mahler Academy (Italia), Festival en el Centro Europeo Penderecki (Polonia) y Grachtenfestival en Amsterdam.`,",
        "`Ha trabajado con Radio Philharmonisch Orkest, Nederlands Kammerorkest Orkest, Royal Concertgebouw Orchestra, Mahler Chamber Orchestra y Orchestra Mozart, como principal de segundos con Royal Opera House Covent Garden, London Philharmonic Orchestra, Scottish Chamber Orchestra, Philharmonia Orchestra, y colaborado con directores como Claudio Abbado, Bernard Haitink, Andris Nelsons, Daniel Harding y Sir John Eliot Gardiner.`,",
        "`Ha realizado giras con Academy of St.Martin in the Fields dirigida por Joshua Bell en Europa, Asia y EE. UU. De 2019 a 2021 ocupó el cargo de primera concertino en la Noord Nederlands Orkest, y ha sido concertino invitada de Balletorkest, Antwerp Symphony, Trondheim Symphony, Odense Symphony, Stavanger Symphony, Orquesta Sinfónica de Galicia y Orquesta Ciudad de Granada con quien se presentó recientemente en el Festival Musika-Música de Bilbao.`,",
        "],",
        "image: `https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Joanna_Wronko_sq_ipgycw.webp`,",
        "},",
        "English - Joanna Wronko",
        "{",
        "locale: `en`,",
        "name: `Joanna Wronko`,",
        "slug_name: `Joanna Wronko EN`,",
        "instrument: `violin`,",
        "para_1: `The Polish violinist Joanna Wronko is a versatile musician with a broad experience in the world of orchestra and chamber music.`,",
        "sentences: [",
        "`She studied in Freiburg with prof. Magdalena Rezler, completing her Solo Diploma in Hamburg with prof. Kolja Blacher. During the Festival Holland Music Sessions she got nominated for the New Masters on Tour prize with a debut recital in the Concertgebouw in 2007. In 2008 she recorded a duo CD with Frank van de Laar, which has been broadcasted by Dutch and Polish radio. Joanna has appeared in festivals such as the Music Festival in Colmar (France), Keshet Eilon (Israel), Gustav Mahler Academy (Italy), Festival in the European Penderecki Center (Poland) and Grachtenfestival in Amsterdam.`,",
        "`She has worked with the Radio Philharmonisch Orkest, Nederlands Kammerorkest Orkest, Royal Concertgebouw Orchestra, Mahler Chamber Orchestra and Orchestra Mozart, as principal 2nd with Royal Opera House Covent Garden, London Philharmonic Orchestra, Scottish Chamber Orchestra, Philharmonia Orchestra, and collaborated with conductors like Claudio Abbado, Bernard Haitink, Andris Nelsons, Daniel Harding, Sir John and Eliot Gardiner.`,",
        "`She has toured with Academy of St.Martin in the Fields led by Joshua Bell in Europe, Asia and USA. From 2019 to 2021 she held a position as the first concertmaster at the Noord Nederlands Orkest, and been guest concert master of Balletorkest, Antwerp Symphony, Trondheim Symphony, Odense Symphony, Stavanger Symphony, Orquesta Sinfónica de Galicia and Orquesta Ciudad de Granada with whom she appeared recently at the Festival Musika-Música in Bilbao.`,",
        "],",
        "image: `https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Joanna_Wronko_sq_ipgycw.webp`,",
        "},",
        "Laura Romero",
        "English - Laura Romero",
        "Chieh-Fan Yiu",
        "{",
        "locale: `es`,",
        "name: `Chieh-Fan Yiu`,",
        "slug_name: `Chieh-Fan Yiu ES`,",
        "instrument: `viola`,",
        "para_1: `Aclamado por el New York Times como “encantador”, el violista canadiense nacido en Taiwán, Chieh-Fan Yiu, es el ganador triple del premio del Concurso Lionel Tertis, incluido el Premio del Presidente del Jurado de Yuri Bashmet. El Dr. Yiu actúa frecuentemente con Brooklyn Art Song Society, Carnegie Hill Concerts, Frisson Ensemble, PhiloSonia Music y New York Classical Players.`,",
        "sentences: [",
        "`Sus actuaciones lo han llevado por todo el mundo en festivales como Carbondale Arts en Colorado, Chamber Music Society of the Carolinas, Music@Menlo, Moritzburg, Verbier, Aspen y Sarasota Music Festivals. También es miembro fundador del Festival de Música Ben Feng en Taiwán, ahora en su décima temporada. Aparece regularmente con la Orquesta de Cámara de Filadelfia, la Orquesta Experiencial y el Ensemble Metropolis.`,",
        "`Ha colaborado con David Cohen, Chad Hoopes, Tessa Lark, Matthew Lipman, Sasha Sitkovetsky, Josu De Solaun, así como con los cuartetos Argus, Emerson, Formosa y Tesla. Como violista del Ensemble For The Romantic Century, un ensemble que combina obras completamente escenificadas con música de cámara en vivo y diseños visuales elaborados, el Dr. Yiu ha protagonizado 'El caso Dreyfus', 'Porque no podía parar: un encuentro con Emily Dickinson' y 'La oreja de Van Gogh', con más de 70 funciones hasta la fecha.`,",
        "`Como pedagogo y mentor, el Dr. Yiu se ha desempeñado como artista residente en el Instituto de Gobierno Rockefeller de la Universidad Estatal de Nueva York, SUNY Schenectady, el programa CHIME de la Orquesta Juvenil del Empire State, así como en la Escuela de Música Moores en la Universidad de Houston.`,",
        "`El Dr. Yiu es violista del ensemble Delirium Musicum en Los Ángeles, que acaba de lanzar su álbum titulado \"Seasons\" para Warner Classics.`,",
        "],",
        "image: `https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Chieh-Fan_Yiu_s5nb1f.webp`,",
        "},",
        "English - Chieh-Fan Yiu",
        "{",
        "locale: `en`,",
        "name: `Chieh-Fan Yiu`,",
        "slug_name: `Chieh-Fan Yiu EN`,",
        "instrument: `viola`,",
        "para_1: `Hailed by the New York Times as “Ravishing,” Taiwanese-born Canadian violist Chieh-Fan Yiu is the triple-prized winner of the Lionel Tertis Competition, including Yuri Bashmet’s President Of The Jury Prize. Dr. Yiu performs regularly with Brooklyn Art Song Society, Carnegie Hill Concerts, Frisson Ensemble, PhiloSonia Music, and New York Classical Players.`,",
        "sentences: [",
        "`His performances have taken him around the world in festivals such as Carbondale Arts in Colorado, Chamber Music Society of the Carolinas, Music@Menlo, Moritzburg, Verbier, Aspen, and Sarasota Music Festivals. He is a founding member of Ben Feng Music Festival in Taiwan, now in its tenth season and regularly appears with Chamber Orchestra of Philadelphia, Experiential Orchestra, and Metropolis Ensemble.`,",
        "`He has collaborated with David Cohen, Chad Hoopes, Tessa Lark, Matthew Lipman, Sasha Sitkovetsky, Josu De Solaun, as well as the Argus, Emerson, Formosa, and Tesla Quartets.",
        "As the violist of Ensemble For The Romantic Century, an ensemble that combines fully staged plays with live chamber music and elaborate visual designs, Dr. Yiu has starred in ‘The Dreyfus Affair’, 'Because I Could Not Stop: An Encounter With Emily Dickinson', and ‘Van Gogh’s Ear’, playing more than 70 performances to date.`,",
        "`As a pedagogue and mentor, Dr. Yiu has served as artist-in-residence at the State University of New York Rockefeller Institute of Government, SUNY Schenectady, Empire State Youth Orchestra’s CHIME program and Moores School of Music in University of Houston.`,",
        "`Dr. Yiu is the violist of ensemble Delirium Musicum, who just released their album titled “Seasons” for Warner Classics.`,",
        "],",
        "image: `https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Chieh-Fan_Yiu_s5nb1f.webp`,",
        "},",
        "Tomoko Akasaka",
        "English - Tomoko Akasaka",
        "Rumen Cvetkov",
        "{",
        "locale: `es`,",
        "name: `Rumen Cvetkov`,",
        "slug_name: `Rumen Cvetkov ES`,",
        "instrument: `viola`,",
        "para_1: `Ha actuado en importantes escenarios como el Berliner Filharmoniker Hall, Carnegie Hall, Wigmore Hall, Walt Disney Hall, Pallacio de Bellas Artes de Ciudad de México, y ha colaborado con músicos como Ida Haendel, Bernard Greenhouse, Mihail Muntian, sir Harold Martina, José Feghali, Christian Tetzlaff o Vladimir Mendelssohn, y los miembros de los cuartetos Borromeo, Kronos, Aviv, Jerusalem y Verdi.`,",
        "sentences: [",
        "`En 2012, el maestro Zubin Mehta le invitó a ser el nuevo solista de viola del Palau de Les Arts Reina Sofia de Valencia. En 2019 editó su primer CD con sonatas de Brahms junto con el pianista Ludmil Angelov.`,",
        "`Es profesor de Viola en el Conservatorio de Tilburg (Países Bajos) y en la New Bulgarian University (Sofía, Bulgaria), fundador del ensemble Solistas Mediterráneos, y es cofundador y codirector artístico del MurciArt Music Festival.`,",
        "],",
        "image: `https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/rumen-cvetkov_mopwol.webp`,",
        "},",
        "English - Rumen Cvetkov",
        "{",
        "locale: `en`,",
        "name: `Rumen Cvetkov`,",
        "slug_name: `Rumen Cvetkov EN`,",
        "instrument: `viola`,",
        "para_1: `He has performed in important venues worldwide, such as Berliner Philharmoniker Hall, Carnegie Hall, Wigmore Hall, Walt Disney Hall, Palacio de Bellas Artes of Mexico City and has collaborated with musicians such as Ida Haendel, Bernard Greenhouse, Mihail Muntian, Sir Harold Martina, Jose Feghali, Christian Tetzlaff, Vladimir Mendelssohn.`,",
        "sentences: [",
        "`In 2012 he was invited by Maestro Zubin Mehta to become the solo violist of the Royal Spanish Opera House “Queen Sofia” in Valencia. His debut solo CD, “Brahms Alliance”, with pianist Ludmil Angelov.`,",
        "`Currently, he is a Professor of viola at Tilburg Conservatory (Holland) and New Bulgarian University (Sofia, Bulgaria), the founder and Artistic Leader of the Chamber Orchestra “Mediterranean Soloists”, and the founder and Artistic Director of MurciArt Music Festival.`,",
        "],",
        "image: `https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/rumen-cvetkov_mopwol.webp`,",
        "},",
        "Razvan Popovici",
        "English - Razvan Popovici",
        "Øyvind Gimse",
        "English - Øyvind Gimse",
        "Per Nyström",
        "English - Per Nyström",
        "Gabriel Ureña",
        "English - Gabriel Ureña",
        "Adolfo Gutiérrez",
        "{",
        "locale: `es`,",
        "name: `Adolfo Gutiérrez`,",
        "slug_name: `Adolfo Gutiérrez ES`,",
        "instrument: `violonchelo`,",
        "para_1: `Adolfo Gutiérrez, ganador del premio Ravel 2012, debutó con la London Symphony Orchestra en el prestigioso ciclo Ibermusica, en Madrid, interpretando el Concierto para violonchelo de Elgar y enseguida fue invitado a actuar con la Royal Philharmonic Orchestra (Charles Dutoit) , Orquesta Nacional de España (Ton Koopman) y en el Festival Mendelssohn en la Gewandhaus de Leipzig.`,",
        "sentences: [",
        "`Entre sus compromisos caben a destacar actuaciones como solista con la Orquesta Filarmónica de Londres (Vladimir Jurowski), la Orquesta Nacional de España (Krzysztof Penderecki), la Sinfónica de Fort Worth bajo la dirección de Miguel Harth-Bedoya, la Orquesta Sinfónica Nacional de Colombia y actuaciones en el Festival de Ravinia y el Festival de Verano de la Sinfónica de Montreal.`,",
        "`Adolfo ha actuado en escenarios importantes como el Concertgebouw de Ámsterdam, el Auditorio Nacional de Música de Madrid, el Ford Theatre de Los Ángeles, l'Auditori y Palau de la Música de Barcelona, ​​la Sala Bulgaria de Sofía o el Palacio Euskalduna de Bilbao, y ha colaborado con directores como como Edward Gardner, José Ramón Encinar, Roberto Minczuk, Pablo González, Anu Tali y Antoni Ros-Marbà.`,",
        "`Adolfo ha grabado Barber, Rachmaninov, Piazzolla y el ciclo completo de las suites para violonchelo de J.S. Bach con el sello Verso. Su grabación reciente de las sonatas completas de Beethoven con el pianista Christopher Park ha recibido excelentes críticas. Adolfo toca un Francesco Ruggieri, hecho a mano en Cremona en 1673.`,",
        "],",
        "image: `https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/adolfo-gutierrez_fkv4oe.webp`,",
        "},",
        "English - Adolfo Gutiérrez",
        "{",
        "locale: `en`,",
        "name: `Adolfo Gutiérrez`,",
        "slug_name: `Adolfo Gutiérrez EN`,",
        "instrument: `cello`,",
        "para_1: `Adolfo Gutiérrez, the winner of the Ravel prize 2012, made his debut with the London Symphony Orchestra in the prestigious Ibermusica series, in Madrid, performing Elgar’s Cello Concerto and following was invited to perform with the Royal Philharmonic Orchestra (Charles Dutoit), Orquesta Nacional de España (Ton Koopman) and at the Mendelssohn Festival at Leipzig’s Gewandhaus.`,",
        "sentences: [",
        "`Current highlights include performances as a soloist with the London Philharmonic Orchestra (Vladimir Jurowski), Orquesta Nacional de España (Krzysztof Penderecki), Fort Worth Symphony under Miguel Harth-Bedoya, Orquesta Sinfónica Nacional de Colombia and performances at the Ravinia Festival and Montreal Symphony’s Summer Festival.`,",
        "`Adolfo has performed at major venues such as Amsterdam’s Concertgebouw, Auditorio Nacional de Música in Madrid, Ford Theatre in Los Angeles, l’Auditori and Palau de la Música in Barcelona, Bulgaria Hall in Sofia and Palacio Euskalduna in Bilbao, and collaborated with conductors such as Edward Gardner, José Ramón Encinar, Roberto Minczuk, Pablo González, Anu Tali and Antoni Ros-Marbà.`,",
        "`Adolfo has recorded Barber, Rachmaninov, Piazzolla and the complete cycle of the cello suites by J.S. Bach on the Verso label. His recent recording of the complete Beethoven Sonatas with pianist Christopher Park received great critical acclaim. Adolfo plays a Francesco Ruggieri, handcrafted in Cremona in 1673. `,",
        "],",
        "image: `https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/adolfo-gutierrez_fkv4oe.webp`,",
        "},",
        "Natalia Kucháeva",
        "English - Natalia Kucháeva",
        "Josu De Solaun",
        "English - Josu De Solaun",
        "Antonio del Pino",
        "English - Antonio del Pino",
        "Julien Quentin",
        "{",
        "locale: `es`,",
        "name: `Julien Quentin`,",
        "slug_name: `Julien Quentin ES`,",
        "instrument: `piano`,",
        "para_1: `El pianista francés Julien Quentin ha actuado en el Concertgebouw (Amsterdam), Wigmore Hall (Londres), Louvre (París), Baden-Baden Festspielhaus, Filarmónica de Berlín, Gewandhaus (Leipzig), Konzerthaus (Viena), Teatro Mariinsky (San Petersburgo), en Avery Fisher, Alice Tully y Carnegie Hall en Nueva York.`,",
        "sentences: [",
        "`Ha grabado para EMI, Channel Classics, Sony RCA, Hungaroton y Decca. Julien Quentin comenzó sus estudios en el Conservatorio de Ginebra con Alexis Golovine, recibió su Diploma de Artista bajo la tutela de Emile Naoumoff en la Universidad de Indiana y el Diploma de Posgrado de la Juilliard School, estudiando con György Sándor.`,",
        "`Con \"Musica Litoralis\" en el Piano Salon Christophori en Berlín, ha creado una exitosa serie de conciertos que recuerda a los salones de los locos años veinte. Con artistas visuales, explora nuevas visiones artísticas que unen varias formas de arte.`,",
        "`Persigue su interés por otros géneros musicales colaborando con los pianistas Kelvin Sholar, Kaan Bulak y Francesco Tristano, o los productores Adrien de Maublanc y Cesar Merveille en proyectos que van desde la improvisación hasta la producción de música electrónica, sobre todo dentro de sus nuevos proyectos Midiminuit & Les Coeurs Brisés.`,",
        "],",
        "image: `https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Julien_Quentin_cemtl1.webp`,",
        "},",
        "English - Julien Quentin",
        "{",
        "locale: `en`,",
        "name: `Julien Quentin`,",
        "slug_name: `Julien Quentin EN`,",
        "instrument: `piano`,",
        "para_1: `French pianist Julien Quentin has appeared at the Concertgebouw (Amsterdam), Wigmore Hall (London), Louvre (Paris), Baden-Baden Festspielhaus, Berlin Philharmonie, Gewandhaus (Leipzig), Konzerthaus (Vienna), Mariinsky Theatre (Saint Petersburg), in Avery Fisher, Alice Tully and Carnegie Hall in New York.`,",
        "sentences: [",
        "`He has recorded for EMI, Channel Classics, Sony RCA, Hungaroton and Decca. Julien Quentin started his studies at the Geneva Conservatory with Alexis Golovine, received his Artist Diploma under the tutelage of Emile Naoumoff at Indiana University, and Graduate Diploma from the Juilliard School, studying with György Sándor.`,",
        "`With ‘Musica Litoralis’ at the Piano Salon Christophori in Berlin, he has created a successful concert series reminiscent of the salons of the Roaring Twenties. With visual artists, he explores new artistic visions bringing various art forms together.`,",
        "`He pursues his interest in other genres of music collaborating with pianists Kelvin Sholar, Kaan Bulak and Francesco Tristano, or producers Adrien de Maublanc and Cesar Merveille in projects ranging from improvisation to producing electronic music, most notably within their new projects Midiminuit & Les Coeurs Brisés.`,",
        "],",
        "image: `https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Julien_Quentin_cemtl1.webp`,",
        "},",
        "Susanne Hvinden Hals",
        "{",
        "locale: `es`,",
        "name: `Susanne Hvinden Hals`,",
        "slug_name: `Susanne Hvinden Hals ES`,",
        "instrument: `soprano`,",
        "para_1: `La joven soprano noruega, Susanne Hvinden Hals, proviene de Oslo, Noruega. Recibió su Master de Música, voz y ópera en la Real Academia Danesa de Música en Copenhague.`,",
        "sentences: [",
        "`Debutó en la Ópera de Montpellier en Francia en 2003 con el Coro Infantil Femenino Noruego, y posteriormente ha interpretado papeles como Susanna en «Le nozze di Figaro»  de Mozart, Adele en «Die Fledermaus»  de J. Strauss, Pamina en «Die Zauberflöte» de Mozart, y Lucia en «La violación de Lucrecia» de Benjamin Britten.`,",
        "`Susanne es una soprano muy solicitada en Noruega, y ha colaborado con varias orquestas en oratorios y actúa en varios festivales y conciertos tanto en Noruega como en el extranjero. Junto con su hermana y violinista Kathrine Hvinden Hals, forma el dúo Søstrene Hals.`,",
        "],",
        "image: `https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Susanne_Hvinden_Hals_sq_nizgnv.webp`,",
        "},",
        "English - Susanne Hvinden Hals",
        "{",
        "locale: `en`,",
        "name: `Susanne Hvinden Hals`,",
        "slug_name: `Susanne Hvinden Hals EN`,",
        "instrument: `soprano`,",
        "para_1: `The young Norwegian soprano, Susanne Hvinden Hals, hails from Oslo, Norway. She received her Master of Music, voice and opera at The Royal Danish Academy of Music in Copenhagen.`,",
        "sentences: [",
        "`She made her debut at the Opera Montpellier in France in 2003 with the Norwegian Girls Choir, and has later on sung roles such as Susanna in Mozart´s «Le nozze di Figaro», Adele in «Die Fledermaus», J. Strauss, Pamina in «Die Zauberflöte», and Lucia in «The rape of Lucretia» by Benjamin Britten.`,",
        "`Susanne is a highly sought-after soprano in Norway, and has collaborated with various orchestras in oratorios, and performs at several festivals and concerts both in Norway and abroad. Together with her sister and violinist Kathrine Hvinden Hals, she forms the duo Søstrene Hals.`,",
        "],",
        "image: `https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Susanne_Hvinden_Hals_sq_nizgnv.webp`,",
        "},",
        "Nils Nilsen",
        "{",
        "locale: `es`,",
        "name: `Nils Nilsen`,",
        "slug_name: `Nils Nilsen ES`,",
        "instrument: `tenor`,",
        "para_1: `El tenor Nils Georg Nilsen debutó en el Lincoln Center de Nueva York tras recibir su Master de Música de la Manhattan School of Music en 2012.`,",
        "sentences: [",
        "`Desde entonces, ha cantado como solista con la Orquesta Sinfónica de Chicago, en la Ópera de Israel, la Ópera National de Noruega y Opera Tampa en Florida, y ha actuado en varios festivales y conciertos internacionales en Europa y los Estados Unidos. Nils Georg ha sido el ganador del Premio Solveig en el Concurso Edvard Grieg, el Premio del Público durante el festival LidalNorth en numerosas ocasiones y el Concurso de Música para Jóvenes en Noruega.`,",
        "`Recientemente ha cantado el Mozart Requiem con la Orquesta de Radio Noruega, Rossinis Stabat Mater y Handels Messiah con la Orquesta Sinfónica Drammen y en el Festival Ravinia en los Estados Unidos, y es Profesor de Voz en la Academia Internacional Galamian en Málaga. Desde 2021 forma parte del grupo vocal Nordic Tenors, junto a los tenores Jan-Tore Saltnes and Roald Haarr.`,",
        "],",
        "image: `https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Nils_Nilsen_sq_bdcfss.webp`,",
        "},",
        "English - Nils Nilsen",
        "{",
        "locale: `en`,",
        "name: `Nils Nilsen`,",
        "slug_name: `Nils Nilsen EN`,",
        "instrument: `tenor`,",
        "para_1: `Tenor Nils Georg Nilsen debuted at the Lincoln Center in New York after receiving his Master of Music from Manhattan School of Music in 2012.`,",
        "sentences: [",
        "`Since then he has appeared as a soloist with the Chicago Symphony Orchestra, at the Israeli Opera, the Norwegian Opera House and Opera Tampa in Florida, and performed in several international festivals and concerts in Europe and the US. Nils Georg has won the Solveig’s Award in the Edvard Grieg Competition, the Audience Award during the festival LidalNorth on numerous occasions, and the Youth Music Competition in Norway.`,",
        "`In addition to being professor of Voice at the Galamian International Accademy in Malaga, Nils Georg is a sought-after tenor, and recent highlights include Mozart Requiem with the Norwegian Radio Orchestra, Rossinis Stabat Mater and Handels Messiah with Drammen Symphony Orchestra and performances at the Ravinia Festival in the US. Since 2021 he is part of the vocal group Nordic Tenors, together with the tenors Jan-Tore Saltnes and Roald Haarr.`,",
        "],",
        "image: `https://res.cloudinary.com/dt3k2apqd/image/upload/q_auto/M%C3%A1laga%20Cl%C3%A1sica/Nils_Nilsen_sq_bdcfss.webp`,",
        "},"
    ],
    "docstrings": [],
    "functions": [],
    "classes": []
}